{
    "@context": "https://schema.org",
    "@type": "FAQPage",
    "mainEntity": [
        {
            "@type": "Question",
            "name": "What is collaborative coding?",
            "acceptedAnswer": {
                "@type": "Answer",
                "text": "<p>Collaborative coding is the process of writing code with the help of another coder who helps in fixing issues, resolving errors, refactoring the code, etc. It is also known as pair programming and it can be done remotely or in person.</p>"
            }
        },
        {
            "@type": "Question",
            "name": "Is collaborative coding a replacement for source code control systems such as git?",
            "acceptedAnswer": {
                "@type": "Answer",
                "text": "<p>No, source code control systems track all changes and manage different versions of code whereas collaborative coding allows coders to ask for help on specific portions of code. Source control systems last for the entire lifetime of the software whereas collaborative coding sessions last for only a few hours.</p>"
            }
        },
        {
            "@type": "Question",
            "name": "How does collaborative coding work?",
            "acceptedAnswer": {
                "@type": "Answer",
                "text": "<p>Collaborative coding works by trying to establish a peer-to-peer connection using WebRTC where IDEs first connect to a central server to find IP addresses of other participants and then connect to them directly for the rest of the session without needing to talk to the central server. Other tools use the central server as a relay server which transfers messages between participants throughout the session.</p>"
            }
        },
        {
            "@type": "Question",
            "name": "How can I do remote pair programming for free?",
            "acceptedAnswer": {
                "@type": "Answer",
                "text": "<p>Visual Studio Live Share, Code With Me, Duckly, and CodeTogether can be used for creating free pair-programming sessions. <a href=\"/code-collaboration-pair-programming/\" class=\"link\">The Console review of the best code collaboration and pair programming tools for developers</a> explains which one we think is best.</p>"
            }
        }
    ]
}