{"items": [{"Company/Org": "Prestige", "Tool/Product/Project": "Prestige", "Reviewed": "2021-06-17", "Scheduled for": "2021-07-01", "URL": "https://prestigemad.com/", "Category": "Developer Tools - API Client", "Type": "Open Source", "What is it?": "Browser- and text-based HTTP client.", "Len": "135", "What we like": "Really simple way to execute HTTP commands but can also send more complex requests e.g. headers, file uploads, cookies, JSON. Can write commands in plain text, JS, or define variables in templates. Prettified and syntax-highlighted response parsing. Can save to local browser storage (GitHub and others on roadmap). Open source codebase.", "What we dislike": "Requests run through a proxy rather than your browser (due to CORS), but localhost URLs are routed directly. No support for OAuth APIs.", "Interview": "", "favicon": "img/favicons/prestigemad.com.png", "Top Category": "Developer Tools", "Sub Category": "API Client", "Filter Taxonomy": "developer-tools, open-source"}, {"Company/Org": "chezmoi", "Tool/Product/Project": "chezmoi", "Reviewed": "2021-06-17", "Scheduled for": "2021-07-01", "URL": "https://www.chezmoi.io/", "Category": "Misc - Terminal utilities", "Type": "Open Source", "What is it?": "dotfile manager.", "Len": "266", "What we like": "Single compiled binary. No bootstrap requirements - supports many platforms. Can query password manager for secrets and supports encrypted files. Configs can be templated for differences across environments. Can run scripts, including run-once (ideal for cloud IDEs or ephemeral environments). File edit flow similar to git (which is used for versioning).", "What we dislike": "You can edit files directly but using the edit flow ensures changes/conflicts are handled properly, which may require retraining muscle memory. Doesn’t handle git subdirectories e.g. Oh My Zsh particularly well (better to use a script to install outside of chezmoi).", "Interview": "", "favicon": "img/favicons/www.chezmoi.io.png", "Top Category": "Misc", "Sub Category": "Terminal utilities", "Filter Taxonomy": "misc, open-source"}]}