{"results":[{"command":{"func":"getData","kwargs":[{"range":"'All Tools'!A:O","hasHeaderRow":true},null]},"result":{"rawData":[["Meilisearch","Meilisearch","2022-04-27","2022-04-28","https://www.meilisearch.com/","Developer Tools - Site Search","Open Source","Open source search engine.","26","Search backend as a single (Rust) binary. Gives you search as you type, typo-tolerance, synonyms, highlighting, filters, facets, sorting, and phrase search via a REST API. SDKs for a large number of languages, frontend, and backend frameworks. Includes a simple search web UI out of the box.","291","Databases incompatible between versions whilst pre-v1.0 - requires manual steps to upgrade. Not designed for >10 million documents.","131","/interviews/meilisearch-quentin-de-quelen/","FALSE"],["Encore","Encore","2022-04-27","2022-04-28","https://encore.dev/","Developer Tools - Backend framework","Open Source","Backend dev framework.","22","Create APIs (internal, public, authenticated) from annotations on standard functions. Databases, queues, scheduled tasks are native code primitives. Builds, deploys, tracing and logs built in. Provisions local and/or cloud test/dev environments. Open source, use your own cloud (AWS, Azure, GCP), or the Encore cloud.","317","Platform is Golang only. Auto-generates API client libraries, but currently only supports TypeScript. Supports Postgres migrations, but no rollbacks.","149","","FALSE"],["Changie","Changie","2022-04-27","2022-04-28","https://changie.dev/","Developer Tools - Documentation","Open Source","Automated changelogs.","21","Simple CLI for generating file-based changelogs separate from commits. Using files means changelog entries can be part of diffs. Customizable templates for standardizing input of different types of changes e.g. bug fix, feature, deprecation. Command to merge all changes into a single file.","290","Adding changes becomes another step separate from committing, but it can be integrated with other tools e.g. GoReleaser or GitHub release triggers.","147","","FALSE"],["Rowy","Rowy","2022-04-20","2022-04-21","https://www.rowy.io/","Developer Tools - Backend framework","Open Source","Low-code backend framework.","27","Acts as a layer on top of the GCP products e.g. Firestore, Cloud Functions, so you can always “break out” to use the full cloud functionality. Easy to create UIs with field types, JOINs across tables, custom code functions executing on data, or external web services. Write functions in JS and use NPM modules. Open source.","323","Only supports Google Cloud and Firestore (for now). Only supports JS/TS functions.","82","/interviews/rowy-harini-janakiraman/","TRUE"],["nut.js","nut.js","2022-04-20","2022-04-21","https://nutjs.dev/","Misc - OS","Open Source","Desktop UI automation.","22","Script desktop UI actions - mouse, keyboard, clipboard, windows and what is on screen. Supports macOS, Windows, and Linux. Trigger keyboard shortcuts, input text, find images, click and drag actions. Useful for UI testing or automating common actions. Open source.","264","Requires additional runtimes on each platform. Docs don’t do a good job of explaining real-world use cases - best to explore code & examples.","141","","FALSE"],["Redo","Redo","2022-04-20","2022-04-21","https://github.com/barthr/redo","Misc - Terminal utilities","Open Source","Create reusable shell functions.","32","Interactive CLI to combine previously executed commands into a new shell function. Shell agnostic. Generated functions are written to a plain text file which can easily be stored in Git or cloud storage.","203","Passing additional arguments not supported. No OS packages e.g. homebrew. Doesn’t work on Windows.","98","","FALSE"],["Warp","Warp","2022-04-13","2022-04-14","https://www.warp.dev/","Misc - Terminal emulators","Desktop","GPU accelerated terminal.","25","Built-in auto complete for common commands and options. Output contained within blocks which can be navigated with keyboard shortcuts, easily copied or shared using a web link. Input is a proper text field e.g., easy input for multiple lines, select text, dual cursors, etc. Dark/light mode theme sync. Command palette.","319","macOS only (for now). Not open source (yet). You have to manually find and download themes. Default telemetry whilst in beta.","125","/interviews/warp-zach-lloyd/","TRUE"],["Dockside","Dockside","2022-04-13","2022-04-14","https://dockside.io/","Developer Tools - IDE","Other","IDE in containers.","18","Like running your own local GitHub Codespaces - containerized environment with an IDE attached (uses Theia). Or host in the cloud for team access. IDE is VS Code compatible, runs in your browser. Specify Docker images to launch, or use your own. Quickly spin up new containers for different environments, with RBAC and HTTPS endpoints","334","Theia is very minimalistic by default and doesn’t support VS Code Settings Sync, so you need to spend time setting it up. Assumes x86 by default - be sure to use arch-specific images e.g. ARM, otherwise it’s very slow.","218","","FALSE"],["RonDB","RonDB","2022-04-13","2022-04-14","https://www.rondb.com/","Database - KV store","Open Source","K/V store with SQL interface.","29","High performance high availability datastore with fully synchronous transactions and non-blocking two phase commits within a single cluster. Async replication between clusters. Scales linearly with CPUs. Queries automatically parallelized. MySQL (NDB) compatible interface with many native language SDKs. Open source.","317","Query server and data server are split components, which adds some network overhead (deliberate decision for high availability and distributed environments). Designed for scale, which you may not need. Missing quickstart guide.","227","","FALSE"],["Knock","Knock","2022-04-06","2022-04-07","https://knock.app/","API - Communication","SaaS","Notifications infrastructure.","29","APIs for all the logic around sending notifications. Batching allows triggers to be aggregated into a single notification e.g. many recent comments on a doc into a single email. Supports email, SMS, push and chat notifications, plus in-app feeds. State sync for read status plus notification delays e.g. send email if not read in-feed after 30 mins.","349","Available SDKs limited to REST, Node, Python, Ruby, .NET and Elixir. Doesn’t send the notifications - needs to integrate with Twilio, Sendgrid, etc.","148","/interviews/knock-christopher-bell/","TRUE"],["Helix","Helix","2022-04-06","2022-04-07","https://helix-editor.com/","Developer Tools - Text editors","Open Source","Terminal text editor.","21","Everything is included - no need to install extra plugins. Supports fuzzy search, buffers, language server with syntax highlighting, suggestions and auto indent. Easily discoverable commands. Powerful text manipulation via selection then edit. Clipboard integration. Built-in themes. Open source.","296","Suggestions and auto indent language support are more limited than those which support syntax highlighting. No real plugin ecosystem - text editor rather than an IDE.","166","","FALSE"],["tRPC","tRPC","2022-04-06","2022-04-07","https://trpc.io/","API - API","Open Source","Typesafe API framework.","23","Define type-safe APIs in TypeScript to avoid code generation by sharing types between client/server. Includes adapters for major frameworks e.g. React, Next, Express. Built-in query batching and caching. Supports middleware, logs, WebSockets, and Subscriptions. Supports data transforms e.g. superjson to use standard types over the wire.","338","Assumes you’re using TypeScript for client and server. Not so useful if you’ve already built a GraphQL endpoint. WebSockets & subscriptions in beta. ","149","","FALSE"],["Tonic","Tonic","2022-03-30","2022-03-31","https://www.tonic.ai/","Developer Tools - Testing frameworks","SaaS","Fake data platform.","19","Generates realistic fake data through analysis of the real data. Understands field types with a large range of generators e.g. addresses, cross-table sums, UUIDs, etc. Can implement differential privacy and statistical relationships between fields / foreign keys. Maintains consistency through constraints, cardinality and duplication. SaaS or on-prem.","352","No self-service signup. Generated data is exported directly to a destination database - no option to download rather than export.","129","/interviews/tonic-adam-kamor/","TRUE"],["Hypertrace","Hypertrace","2022-03-30","2022-03-31","https://www.hypertrace.org/","DevOps - Observability","Other","Open source tracing.","20","Supports OpenTelemetry, Jaeger and Zipkin plus agent-based SDKs for Java, Go and Python. Cloud native design running inside k8s with Helm Charts. Built-in UI for global health, services, metrics, traces and logs. Processes events in real-time without sampling. Open source.","273","Complicated architecture, which provides scalability at the cost of complexity. You need to learn how to manage the analytics datastore (Apache Pinot, still pre-v1.0).","167","","FALSE"],["TablePlus","TablePlus","2022-03-30","2022-03-31","https://tableplus.com/","Database - Management","Desktop","Desktop database client.","24","Native client (not Electron) for PgSQL, MySQL, Mongo, Redshift, and others. Query log shows SQL behind the scenes. Visual row and table editor makes it easy to select field types, alter structure, search/filter, and input data. Can preview changes and SQL before it executes. Inspect DDL for schemas. CSV/SQL import/export. Mac, Windows, iOS.","342","Linux support in alpha testing. GUI sometimes confusing e.g. position of “+ Row” to add a new row is at the bottom, unable to multi-select a column rather than the whole row.","174","","FALSE"],["Pipedream","Pipedream","2022-03-23","2022-03-24","https://pipedream.com/","Developer Tools - Workflow management","SaaS","Connect APIs with (no)code.","27","Handle events from a large number of sources - HTTP endpoints, databases, services like Docusign, Zoom or Google Drive. Chain steps to manipulate source data - send emails, update Google Sheets, insert into database. No-code web editor to query source fields. Use pre-built modules or write code and use packages in custom steps.","329","Primary support for custom modules written in Node, but Python, Go, and Bash are in alpha testing. 512MB diskspace limit.","121","/interviews/pipedream-dylan-sather/","FALSE"],["Lazygit","Lazygit","2022-03-23","2022-03-24","https://github.com/jesseduffield/lazygit","Developer Tools - Git tools","Open Source","git TUI.","8","Easily run common actions visually - stage (individual lines, files, everything), commit, stash, review logs, interactive rebase, undo/move commits or patches - with just a few keyboard shortcuts. Cherry pick commits to other branches. Uses default terminal theme, also customizable. Binaries and packages available for every platform.","335","Lots of keyboard shortcuts to learn, but the display menu makes it easy to discover them. Up/Down keybindings not used - uses Left/Right, which is somewhat unintuitive.","168","","FALSE"],["Tilt","Tilt","2022-03-23","2022-03-24","https://tilt.dev/","Developer Tools - Local development","Open Source","Dev environment manager for k8s.","32","Define all the containers and services in complex (microservices) applications to manage local dev with a single `tilt up` command. Config file uses a dialect of Python so it can be programmed. UI to manage all running services - get endpoint, view status, tail logs, create your own actions. Supports live updates/rebuilds. Open source.","337","Focused on k8s, but does support other systems e.g. Podman, Helm, shell scripts. Has opt-in support for remote clusters, but designed primarily for local dev environments.","171","","FALSE"],["Liveblocks Storage","Liveblocks Storage","2022-03-16","2022-03-17","https://liveblocks.io/","API - API","SaaS","Real-time data storage API.","27","Building blocks to make it easy to create collaborative applications e.g. multiplayer documents. APIs convert JS objects, lists and maps into CRDTs with managed sync of changes, conflicts, and offline support. Handles persistence of documents. REST API or SDKs for React, Zustand, Redux, Node.","293","JS-only. 128KiB payload size limit - you need to handle splitting data structures.","82","","TRUE"],["dsq","dsq","2022-03-16","2022-03-17","https://github.com/multiprocessio/dsq","Misc - Terminal utilities","Open Source","CLI for querying files with SQL.","32","Allows querying different file types with SQL e.g. CSV, JSON, Parquet, Excel, Apache/Nginx logs. Uses SQLite under the hood. Supports multiple files as “table”, and joins between them. Query nested objects.","206","Piping files doesn’t work on Windows. Doesn’t support paths through nested arrays. Binaries only for x86_64.","108","","FALSE"],["Secretive","Secretive","2022-03-16","2022-03-17","https://github.com/maxgoedjen/secretive","Misc - OS","Desktop","Store SSH keys in secure enclave.","33","SSH keys securely stored in Apple’s secure enclave. Works with git, SSH connections, etc. Authenticated via macOS, which allows you to use Touch ID and Apple Watch. Native management GUI. Open source.","200","Keys can’t be exported, which is by design and you should really have different keys per machine anyway.","104","","FALSE"],["Daily.dev","Daily.dev","2022-03-09","2022-03-10","https://daily.dev/","Misc - Browser utilities","Desktop","Feed for developer news.","24","Highlights dev-related articles based on customizable topics. Web version or replace browser start page (Chrome, Firefox, Edge). DND mode to avoid distracting articles during specified times. Bookmarked articles available as RSS and can be committed to GitHub. Open source.","273","Ability to subscribe to arbitrary RSS feeds would make it more customizable. No native iOS app.","95","/interviews/dailydev-ido-shamun/","TRUE"],["GrowthBook","GrowthBook","2022-03-09","2022-03-10","https://www.growthbook.io/","Developer Tools - Testing frameworks","Open Source","Open source feature flags & A/B testing.","40","Option for self-hosted (via a Docker container) or cloud service. Supports many different analytics datastores so existing data can be used to run experiments e.g. Redshift, Snowflake, ClickHouse, Postgres, MySQL. SDKs for running experiments from code. Jupyter notebook export.","278","SDKs only available for JS, React, PHP, Ruby, Python, Go, Kotlin. When self-hosting, you need to deal with deploying the feature definition endpoint behind a caching CDN.","170","","FALSE"],["micro","micro","2022-03-09","2022-03-10","https://micro-editor.github.io/","Developer Tools - Text editors","Open Source","Terminal text editor.","21","Static (Go) binary makes it easy to install anywhere (also in major package managers). Splits, tabs, discoverable keybindings, multiple cursors, mouse support (selecting!), color themes, diff gutter, auto-complete, syntax highlighting, system clipboard integration, linting, macros.","282","Plugins written in Lua and the ecosystem is still small. Compatibility mode for those coming from vim would help the transition.","128","","FALSE"],["Stepsize","Stepsize","2022-03-02","2022-03-03","https://www.stepsize.com/?utm_source=console.dev&utm_medium=referral&utm_campaign=console.dev+interview","Developer Tools - IDE","SaaS","Link issues to code.","20","Integrates with VS Code and JetBrains IDEs to link issues with code. Issues highlighted with the currently open editor with indicators on the relevant lines of code. Syncs with JIRA, GitHub Issues, Linear. Tracks TODO comments across the codebase.","247","Issues exist within Stepsize and any synced third-party issue tracker - would like to see the ability to have the third-party tracker as the sole backend. No GitLab integration.","177","/interviews/stepsize-alex-omeyer/","TRUE"],["Hermit","Hermit","2022-03-02","2022-03-03","https://cashapp.github.io/hermit/","Developer Tools - Dependency management","Open Source","Dev environment management.","27","Bootstrap and manage isolated dev environments tied to the code e.g. specific versions of Go, Rust, Node, GNU make, etc. Config (and packages) defined in HCL. Supports private packages. Can define environment variables. Runs in CI. Hooks into your shell for auto-activation of environments.","290","Supports Mac and Linux only. It’s not a package manager - it handles the dev tools only, so Nix may be better for code dependencies.","132","","FALSE"],["htmlq","htmlq","2022-03-02","2022-03-03","https://github.com/mgdm/htmlq","Misc - Terminal utilities","Open Source","CSS selectors for HTML.","23","Easily query HTML using selectors such as IDs, attributes, text filters, and nodes. Can perform actions like returning all links, extracting text, removing nodes. Pretty print HTML. Open source. Packages available for Mac, FreeBSD, Windows.","240","No syntax highlighting for pretty print - you’ll need to pipe it to something else.","83","","FALSE"],["Strapi","Strapi","2022-02-23","2022-02-24","https://strapi.io/?utm_source=console.dev&utm_medium=referral&utm_campaign=newsletter","Developer Tools - Backend framework","Open Source","Open source headless CMS.","25","Provides REST (default) and GraphQL (via a plugin) APIs to your content. Choice of backing datastore - defaults to SQLite; MySQL, Postgres, MariaDB also supported. Admin panel is “static”, so can be deployed anywhere that can serve web requests e.g. S3. Can also use S3 for handling media uploads. Open source.","310","Need to deploy a proxy such as HAProxy or Nginx in front of your API to provide load balancing and SSL in production. Admin UI has no dark mode.","144","/interviews/strapi-pierre-burgy/","TRUE"],["Goose","Goose","2022-02-23","2022-02-24","https://pressly.github.io/goose/","Database - Management","Open Source","DB schema migration framework.","30","Can run migrations as SQL files on disk or embedded into Go functions. The latter means you can ship a self-contained binary to run migrations with no dependencies. Supports out of order migrations. Good DB support: Redshift, MySQL, Postgres, Clickhouse, and others.","266","No dry-run mode. ","17","","FALSE"],["GitFinder","GitFinder","2022-02-23","2022-02-24","https://gitfinder.com/","Developer Tools - Git tools","Desktop","Git GUI for macOS.","18","Finder integration shows file status badges. Can open and manage GitHub, GitLab, BitBucket PRs from the client. Repo browser with history timeline, tags, remotes, branches. Use the built-in diff viewer or launch your own. Point & click GUI or do everything via shortcuts.","271","Have to manually add each repo you want to use it with. No syntax highlighting in built-in diff viewer.","103","","FALSE"],["Replay","Replay","2022-02-16","2022-02-17","https://www.replay.io","Developer Tools - Testing frameworks","SaaS","Time travel debugger.","21","Go back in time and add debug statements, inspect React components, access browser devtools and network requests. Record automated tests (Playwright, Puppeteer) to get replays for failures. Clever implementation means (non-deterministic) inputs are recorded rather than every system call (significantly reduces overhead and allows for replaying state at all points in time).","374","Currently only supports web runtimes via a browser or Node - other language support is on the roadmap. Partial dark mode support (in the Replay browser, but not the app).","170","/interviews/replay-jason-laster/","FALSE"],["JLess","JLess","2022-02-16","2022-02-17","https://jless.io/","Misc - Terminal utilities","Open Source","JSON explorer CLI.","18","Pretty-print JSON files. Expand/collapse objects and arrays. Vim-inspired commands make navigating easy e.g. move around nodes and siblings, focus on lines, scroll by characters or lines. Uses native shell colors. Regex and full text searching.","244","macOS and Linux only. Ability to word-wrap lines would be useful.","65","","FALSE"],["Dockly","Dockly","2022-02-16","2022-02-17","https://github.com/lirantal/dockly","DevOps - Containers","Open Source","Docker TUI.","11","Interactive terminal interface for managing Docker - list, search, tail logs, stop, star and enter shell for any locally running containers. Shows basic stats e.g. CPU utilization, state and status. Inherits native shell colors.","228","Doesn’t auto-refresh on the dashboard view. Assumes connecting to a local Docker daemon - can be run in Docker itself though.","125","","FALSE"],["Semgrep","Semgrep","2022-02-09","2022-02-10","https://semgrep.dev","Developer Tools - Testing frameworks","Open Source","Code analysis CLI.","18","Analyze code via CLI, IDE and/or CI/CD for rule compliance e.g. deprecate APIs, enforce coding standards, detect common security issues (OWASP 10, etc). Understands meaning of code, not just rules by text matching, Large number of community rules for common scenarios. Open source + cloud version for team features.","315","Rules are defined in code similar to the language(s) it is scanning, but still requires learning a new config syntax. Support for some languages still experimental (Bash, C, C++, PHP, Rust).","190","/interviews/semgrep-isaac-evans/","TRUE"],["Fly.io","Fly.io","2022-02-09","2022-02-10","https://fly.io","Cloud - Compute","SaaS","Deploy containers globally.","27","CLI-first interface. Deploys apps from a Dockerfile to global locations, but they actually run on Firecracker VMs. Scale up app instances with 1 command (or use auto scaling). Internal IPv6 networking with clever address routing to discover instances (which you can connect to via Wireguard). Managed Postgres with HA & read replicas.","334","Some nuances are unclear in the docs e.g. specifying health checks and port routing examples. Billing/usage info is only via a limited web UI. No (documented) API.","163","","FALSE"],["Cheat","Cheat","2022-02-09","2022-02-10","https://github.com/cheat/cheat","Misc - Terminal utilities","","CLI cheat sheets.","17","Built in community cheat sheets auto-downloaded for all major Unix commands - quickly get access to examples of the most common options. Create your own, then add tags and paths. Phrase search within. Autocompletion for bash, fish and zsh.","239","Integration with fzf is not clear how to use. Does not inherit custom shell colors.\n","84","","FALSE"],["Budibase","Budibase","2022-02-02","2022-02-03","https://budibase.com/?utm_source=newsletter&utm_medium=email&utm_campaign=console_dev","Developer Tools - UI Builder","Open Source","Open source low-code app builder.","33","Can connect to REST APIs and import API specs e.g. Swagger/OpenAPI 2.0 to automatically connect the UI to the data (or databases and CSV). Can create custom views with filters, grouped or calculated fields from data sources. Multi-step automations to process data. Supports dark mode. Open source or cloud service.","314","Only has basic theming options. OpenAPI 3.0 is not yet supported. Apps can be exported/imported as JSON, but format is undocumented and not ideal for storing in version control.","177","/interviews/budibase-martin-mckeaveney/","TRUE"],["Script Kit","Script Kit","2022-02-02","2022-02-03","https://www.scriptkit.com/","Developer Tools - Local development","Desktop","Dev workflow scripting.","23","Quickly execute scripts from an Alfred/Spotlight type launcher. Scripts written in JS to perform actions like search APIs, launch apps, resize images, manipulate strings - anything you can do with Node.JS (including npm support). Built-in UI for script inputs. Add keyboard shortcuts.","284","Windows and Linux support still in preview - Linux has no OS packages and has some feature limitations, Windows build is unsigned. Limited docs.","144","@johnlindquist","FALSE"],["Gita","Gita","2022-02-02","2022-02-03","https://github.com/nosarthur/gita","Developer Tools - Git tools","Open Source","Manage multiple Git repos.","26","List all Git repos in a directory and view their status, branch, staged/unstaged changes and last commit message. Color coding shows status compared to remote. Can add flags, list by flag, group, list by group. List repos in a config file then clone them all at once. Batch execute git commands across all/grouped/specific repos e.g. git pull on all repos. ","357","Would benefit from a dry-run option to see what it is going to do e.g. when cloning many repos. Need to manually add repos you want it to be able to manage (easily add all in a directory using recursive add).","208","","FALSE"],["imgproxy","imgproxy","2022-01-26","2022-01-27","https://imgproxy.net/","API - API","Open Source","Fast remote image resizer.","26","Go binary or run as a container (includes official Helm chart). Resize images via URLs, which can (and should) be signed. Can serve files from cloud storage (S3, GCS, etc). Can compress, crop, fill, blur, watermark and convert to desired formats. Emits metrics to Prometheus, New Relic & Datadog. Open source.","309","Designed to focus just on image resizing - you need to configure your own caching and HTTPS proxy, and other non-core features - but this is a deliberate tradeoff for security & performance. No official images for Windows or arm64.","231","","FALSE"],["elfshaker","elfshaker","2022-01-26","2022-01-27","https://github.com/elfshaker/elfshaker","Misc - Terminal utilities","Open Source","High performance version control for binaries.","46","Designed to work particularly well for use cases with lots of similar files that don’t change often. Snapshot command stores the state of the current working directory - execute as you make changes like a git commit. Pack command compresses the snapshots. Very fast snapshot extract. Open source and works on Windows, Linux, macOS.","331","Snapshot names have restricted allowed characters e.g. period is not allowed which would be useful for version numbering. Pre-compiled binaries Linux-only so you need to build yourself with Rust.","195","","FALSE"],["Miller","Miller","2022-01-26","2022-01-27","https://miller.readthedocs.io/en/latest/","Misc - Terminal utilities","Open Source","Query & reformat CSV, TSV, JSON.","32","Work with field names rather than positional indices. Add new fields, run aggregations, colorized, tabular pretty-print. Operates with streams so only a single record is in memory at one time (unless needed for certain operations like sort) i.e. minimal footprint. Single binary (Golang, open source) with packages for Windows, Linux, macOS.","341","Uses its own color scheme rather than inheriting current shell profile. Lots of power in the Miller DSL and the built-in command verbs can do a lot, but it’s another programming language to use for custom transformations.","221","","FALSE"],["Swimm","Swimm","2022-01-19","2022-01-20","https://swimm.io/?utm_source=newsletter&utm_medium=paid_refferal&utm_campaign=console.dev","Developer Tools - Documentation","SaaS","Documentation as code.","22","Docs live as Markdown in the code repo. Smart editor links snippets and references even through refactors, moves, renames, etc. Plugin for VS Code and JetBrains editors to render docs in-line/. Integrate with CI (or Git hooks) to get PR comments and a quick edit link when docs need updating.","292","CLI can be run in any CI/CD environment, but the GitHub app gives much faster feedback as PR comments (other integrations on the roadmap). Any existing docs need to be imported manually.","186","/interviews/swimm-omer-rosenbaum/","TRUE"],["Cube","Cube","2022-01-19","2022-01-20","https://cube.dev/","API - API","Open Source","API for building analytics.","27","Provides an HTTP API with caching, pre-aggregation and SQL support on top of popular datastores e.g. Postgres, Redshift, BigQuery. Visualization libraries provided for D3, Vue, Angular, React. Local “playground” UI makes it easy to debug queries. Open source (including cluster mode for scaling). Optional cloud version.","320","Caching can’t be disabled and requires Redis in prod, but the refresh time can be set to a low value e.g. 1s. SQL and GraphQL APIs still in preview.","148","","FALSE"],["watchexec","watchexec","2022-01-19","2022-01-20","https://github.com/watchexec/watchexec","Misc - Terminal utilities","Open Source","Execute commands on file change.","32","Simply watch files and execute commands when changes are detected. Specify files, filetypes, directories, filters/ignores (including .gitignore). Can issue command restarts e.g. for servers. Runs commands in a shell, which can be specified (or set to no shell).","261","Directory watch is recursive, which might catch a large number of files (filter can be used to ignore them).","108","","FALSE"],["AutoCloud","AutoCloud","2022-01-12","2022-01-13","https://www.autocloud.dev/?utm_source=consoledev&utm_medium=email&utm_campaign=jan2022","DevOps - Infrastructure automation","SaaS","Visualize cloud resources.","26","Snapshots allow you to visualize changes in cloud resources. Provides security and compliance suggestions, which can be exported to CSV. Search and filter resources which are highlighted in the map view. Provides a GraphQL API for your cloud resources. Open source backend with CLI.","282","Can’t define custom policies for flagged issues. Auto crawl is only triggered once per day (can be integrated into CI/CD to trigger a version on deploy).","153","/interviews/autocloud-evelyn-latour/","TRUE"],["mob","mob","2022-01-12","2022-01-13","https://mob.sh/","Developer Tools - Git tools","Open Source","Fast git handover for pair programming.","39","Manages WIP branches and makes it easy to hand over development to your programming partner(s). Makes it easy for multiple people to simultaneously contribute to a coding session. Built-in timers. Squashes commits by default. Single binary CLI with packages for macOS, Windows, Linux (including Arch & Nix).","307","Config options set via environment variables only, so cannot be persisted across sessions. Default timer notification uses the system voice to speak out loud - can be changed via config, but a nicer media bell sound might be better.","232","","FALSE"],["Turborepo","Turborepo","2022-01-12","2022-01-13","https://turborepo.org/","Developer Tools - App Distribution","Open Source","Fast builds for JS / TS monorepos.","34","Gradual install so you can slowly roll it out to different parts of your repo. Pipelines defined in package.json. Caches based on hashes so builds are incremental, which also includes logs and emitted files, making builds much faster. Supports remote caching that can be shared using content addressable storage.","312","Treating logs as artifacts and caching them + emitted files is a technique which needs highlighting. Developers are careful about what gets output e.g. environmental variables and sensitive data in build logs.","209","","FALSE"],["fuite","fuite","2022-01-04","2022-01-06","https://github.com/nolanlawson/fuite","Developer Tools - Testing frameworks","Open Source","Find memory leaks in web apps.","30","Simple CLI for automating testing for memory leaks, primarily relevant for SPAs. Examines objects, event listeners, DOM nodes and collections. Default test scenario does most of what you need, but custom scenarios can be defined e.g. custom setup to log into an app. Has an API.","278","Sensitive to all memory growth, a small amount of which may be perfectly normal for maintaining state. Focuses on the main frame so ignores cross-origin iFrames or web workers. Chrome-only.","189","","FALSE"],["Dura","Dura","2022-01-04","2022-01-06","https://github.com/tkellogg/dura","Developer Tools - Git tools","Open Source","Undo for Git repos.","19","Commits uncommitted changes every 5 sec to a separate branch without affecting HEAD, the current branch or staged files. Use standard git commands to switch to the Dura branch if you need to recover. Can watch multiple directories.","231","Still a prototype. Recovery requires multiple git commands to manage your working directory and checkout the branch. No indication whether the background process is still working.","179","","FALSE"],["xh","xh","2022-01-04","2022-01-06","https://github.com/ducaale/xh","Misc - Terminal utilities","Open Source","Easy HTTP client.","17","Not as fiddly as curl - can use shorthand URLs and it’ll do the right thing (HTTPS by default if using xhs binary). Can ask it to output the curl equivalent command if needed. Easy to specify body parameters, query strings, set request headers, get response headers. Response colorized by default. Packages for most systems (Mac, Linux & Windows).","347","Doesn’t use the system TLS library, which means more consistent results but could cause issues if using it to troubleshoot local issues. No support for HTTP/3.","159","","FALSE"],["Teleport","Teleport","2021-12-15","2021-12-16","https://goteleport.com/?utm_campaign=eg&utm_medium=partner&utm_source=console","Security - Authentication","Open Source","Remote access management.","25","RBAC for remote login to servers (SSH), databases, k8s, desktops and internal web applications. Uses cert-based access control with 2FA rather than passwords or keys. Records all sessions automatically. Teleport SSH server compatible with OpenSSH so you can use any client (including a web client). Open source - deploy self-hosted or via cloud.","345","Supports config via Terraform but the provider is not available in the Terraform registry - must be installed manually. Desktop access for Windows only (for now).","162","/interviews/teleport-ev-kontsevoy/","TRUE"],["sd","sd","2021-12-15","2021-12-16","https://github.com/chmln/sd","Misc - Terminal utilities","Open Source","CLI for find & replace.","23","Use regex syntax from JS and Python rather than figuring out sed and awk. Find and replace using string-literals to avoid regex entirely. Simple syntax for in-file operations, including preview changes. Simple replacements on large files significantly faster than sed. Cross-platform support with packages for common OSs.","321","Latest release missing Windows binary (included with previous versions). Release binaries on GitHub only provided for x86, but other options included in OS packages.","165","","FALSE"],["LakeFS","LakeFS","2021-12-15","2021-12-16","https://lakefs.io/","Developer Tools - Source control","Open Source","Git-like version control for object storage.","44","Sits on top of S3-compatible object storage and acts as a copy-on-write management layer/proxy. Create branches of data e.g. to run tests, upgrade tools, migrate schemas, etc without risking the data. Atomic merge avoids bad states and allows rollbacks. Can ingest existing data without copying it.","298","Depends on PostgreSQL for storing metadata, which adds operational overhead (decoupling, pluggable interfaces and storing metadata in the object storage itself are all on the roadmap).","184","","FALSE"],["Soda","Soda","2021-12-08","2021-12-09","https://github.com/sodadata","Developer Tools - Testing frameworks","Open Source","Observability & monitoring for data.","36","Auto-suggests initial tests. Config and tests are code. Either run as a CLI with all analysis done locally, or as a Python library to programmatically test data. Configurable expected error rate before erroring. Works alongside Airflow, Dagster, or dbt to support scheduled tests. Open source - cloud service optional (alerts and reporting).","341","Initial installation and setup varies in complexity depending on your datastore. No colorized output from the CLI. No other language SDKs.","138","/interviews/soda-maarten-masschelein/","TRUE"],["Olric","Olric","2021-12-08","2021-12-09","https://github.com/buraksezer/olric","Database - KV store","Open Source","Distributed in-memory k/v store.","32","Easy to create a replicated (sync or async) in-memory cache across distributed nodes. Can be used as a client/server (language independent & horizontally scalable) or as an embedded Go library (lower latency). Supports topics and listeners for distributed event processing.","273","No persistence. Binary protocol currently undocumented and Go is the only supported client.","91","","FALSE"],["flatpickr","flatpickr","2021-12-08","2021-12-09","https://flatpickr.js.org/","Developer Tools - UI Builder","Open Source","JS datetime picker.","19","Dependency free - lightweight total size. Everyone needs a datepicker eventually and the UX is always difficult to get right. Support for all major browsers going back to very old versions. Date, time, date range selection. Libraries for React, Vue, etc. Supports localization and themes, including a dark version.","314","Browser built-in alternatives are improving quickly, which offer a more native experience with better accessibility, but not as good functionality. No release since Dec 2020.","174","","FALSE"],["tealdeer","tealdeer","2021-12-01","2021-12-02","https://github.com/dbrgn/tealdeer","Misc - Terminal utilities","Open Source","CLI for simpler manpages.","25","Makes terminal cheat sheets from tldr available offline (cached) with common examples for how to use the specified command. Colorized output uses your shell color preferences. Open source, cross platform and packages available for most systems.","244","Latest release is >1 year ago which is missing many fixes and updates made to the project since.","96","","FALSE"],["Toxiproxy","Toxiproxy","2021-12-01","2021-12-02","https://github.com/shopify/toxiproxy","Developer Tools - Testing frameworks","Open Source","Simulate network chaos conditions.","34","Designed to be invoked via client libraries so the test conditions can be deterministic and programmatically defined. Simulate latency, timeouts, peer resets and other weird network conditions. Can be configured to introduce randomness. Official clients for Ruby and Go (other community clients available)","305","Requires connection through a client rather than dropping into the middle of the connection with no code changes (but this is what enables the programmatic testing).","165","","FALSE"],["Archbee","Archbee","2021-12-01","2021-12-02","https://www.archbee.io/","Developer Tools - Documentation","SaaS","Developer docs editor.","22","Markdown-based editor with custom dev-docs focused components e.g. diagrams, multi-language code blocks, GraphQL / OpenAPI endpoint blocks, changelogs. Build internal or public docs. Publish multiple doc versions e.g. for different API versions.","245","No real-time collaboration - edits by others overwrite your changes. Sync to GitHub allows Markdown source to live in the repo, but editing is much more limited.","161","","FALSE"],["Mergify","Mergify","2021-11-24","2021-11-25","https://mergify.com/?utm_source=consoledev&utm_medium=newsletter&utm_campaign=november21","Developer Tools - Git tools","SaaS","Pull request automation.","24","Define rules and automations in code based on conditions for approvals, assignment, merges, rebasing, reviews, queueing and prioritization. Can examine attributes like task list status, PR dependencies, Dependabot, Snyk and other tool integrations. Engine is open source.","271","GitHub only. Specifying PR dependencies does not work across repos.","67","/interviews/mergify-julien-danjou/","TRUE"],["Runno","Runno","2021-11-24","2021-11-25","https://runno.dev/","Misc - Language","Open Source","Browser executable code samples.","32","Code samples can run locally in the browser (using WebAssembly). Can be embedded into a web page using an iFrame or web component. Enable editor to allow the user to modify and run the code. Sandboxed and runs in a terminal emulator.","233","Limited by language runtimes available in WebAssembly Package Manager - Python, JS, SQL, C, C++. Best for simple code that uses stdin / stdout.","143","","FALSE"],["Vector","Vector","2021-11-24","2021-11-25","https://vector.dev/","DevOps - Observability","Open Source","High performance observability pipeline.","40","Lots of plugins for sources e.g. AWS S3, Apache, StatsD, stdin; transforms e.g. aggregate, filter, log to metric; sinks e.g. Cloudwatch, Prometheus, Elasticsearch. Makes it easy to create a consistent pipeline even as sources and sinks change - no lockin. Can run as a single agent, sidecar or as an aggregator cluster for more throughput. Open source.\n","353","Transforms performed using the custom Vector Remap Language, which is another syntax to learn (but does compile to Rust = safety + performance).","144","","FALSE"],["PackageCloud","PackageCloud","2021-11-17","2021-11-18","https://packagecloud.io/","Developer Tools - Package Managers","SaaS","Hosted package repository service.","34","Manage your packages across all repos from a single service (RPM, Deb, RubyGem, PyPI, NPM). Web UI or CLI to push new packages. Create private repos for internal packages. Auto-generates install scripts for users. Integration with CI to easily push packages on build.","267","Quick installer instructions and package inspection (view files, dependencies, etc) not available for all package types. Would like to see support for container repos.","167","/interviews/packagecloud-donnie-hasseltine/","TRUE"],["Bramble","Bramble","2021-11-17","2021-11-18","https://github.com/maxmcd/bramble","Developer Tools - Package Managers","Open Source","Functional build system and package manager.","44","Project-based and sandboxed, which makes it safer to use it to try third-party projects. Config is code (Starlark) - no arbitrary flags, env vars, etc, so the result is much more predictable. Inputs/outputs are content addressed, hashed and cached (or built from source) which then makes them reproducible.","306","Currently a proof of concept, only works on Linux (macOS soon). Defining the full dependency tree can be tedious, but that is the whole point of sandboxing and ensuring reproducible builds.","189","","FALSE"],["ct.css","ct.css","2021-11-17","2021-11-18","https://github.com/csswizardry/ct","Developer Tools - Testing frameworks","Other","Highlight problems in <head>","28","Quickly show possible performance problems in your HTML <head> such as blocking JS, redundant calls, third-party stylesheets. Either drop in a CSS stylesheet or run the JS snippet for any page using browser devtools.","216","Prone to some false positives, e.g. non-blocking non-print stylesheets, injected JS, whether the third-party JS is truly non-blocking. Unknown license.","151","","FALSE"],["CloudGraph","CloudGraph","2021-11-10","2021-11-11","https://github.com/cloudgraphdev/cli","API - API","Open Source","GraphQL API for your cloud resources.","37","Use GraphQL to query resources. Queries run against a cached database which you can scale yourself, avoiding AWS limits. Consistent interface across products - avoid complex JOINs. Query historical state because data is versioned. Bundled UI with autocompletion and schema explorer.","282","Currently only supports AWS. Deployment is currently manual (or via Docker). Docs are still quite limited.","106","/interviews/cloudgraph-tyson-kunovsky/","TRUE"],["sysz","sysz","2021-11-10","2021-11-11","https://github.com/joehillen/sysz","Misc - Terminal utilities","Open Source","Search TUI for systemctl.","25","Quickly search and filter system and user units. State view shows service metadata plus recent logs. Shortcuts for filtering by state and reloading. Prompts to run relevant commands.","182","Requires fzf, which must be installed manually. Assumes you know what you’re doing, but since it’s Linux-only, you probably do.","127","","FALSE"],["Edamagit","Edamagit","2021-11-10","2021-11-11","https://github.com/kahole/edamagit","Developer Tools - Git tools","Open Source","Magit (better Git) for VSCode.","30","Significantly speed up common git tasks with shortcuts. Improved version control view with show/hide diff, easily stage individual files or multi-select changes. Stage chunks of changes. Forge mode provides extra context from GitHub e.g. issues, PRs.","250","Forge mode slows down status view initial load. Doesn’t yet support the more advanced features from Magit (advanced diff, bisect, patch).","137","","FALSE"],["Plow","Plow","2021-11-03","2021-11-04","https://github.com/six-ddc/plow","Developer Tools - Benchmarking / Load testing","Open Source","High-performance HTTP benchmarking.","35","Displays real-time stats as tests are executed, both on the CLI and via a web UI. Reports latency, req/s, errors, read/writes. Includes latency histogram and percentiles. Supports all HTTP verbs including reading in POST data from a file. Dockerfile provided.","259","Histogram charts disappear and web UI stops serving on test completion.","71","","FALSE"],["SQLime","SQLime","2021-11-03","2021-11-04","https://sqlime.org/","Database - Relational database","Open Source","SQLite browser playground.","26","Runs a full version of SQLite entirely in the browser. Can load DB files from a URL or a file. Can optionally sync with GitHub to save data and queries in plain text. Easy to share via a link. There is no server. Open source.","225","No code completion. No error handling UI (check the browser console).","69","","FALSE"],["werf","werf","2021-11-03","2021-11-04","https://werf.io/","DevOps - CI/CD","Open Source","Git CLI for consistent delivery & deployment.","45","Implements automated delivery from Git to k8s. “giterminism” concept provides reproducibility without external config dependencies - everything is based on the git repo. Handles Docker image builds, k8s rollout and cleanup. Can be embedded in existing CI/CD pipelines. Generates and manages Helm templates.","306","Needs expanded guides for languages - basics are covered but missing more detailed real-world examples. Assumes you’re running on k8s.","134","","FALSE"],["FireHydrant","FireHydrant","2021-10-27","2021-10-28","https://firehydrant.io/","DevOps - Infrastructure automation","SaaS","Incident response automation.","29","Automate tedious incident handling workflows e.g. create new Slack room, status page update, create Zoom bridge. Inventory catalog assigns teams and aggregates useful tools (e.g. PagerDuty on call, Datadog dashboard, last GitHub event) for quick lookup during incidents. Auto-generate timelines based on chat logs, events, actions to make retrospectives easier.","361","Small number of integrations e.g. assumes using Slack for chat, JIRA for tickets, Zoom/Meet for conferencing.","109","/interviews/firehydrant-robert-ross/","TRUE"],["OpenReplay","OpenReplay","2021-10-27","2021-10-28","https://openreplay.com/","DevOps - Error logging","Open Source","Open source session replay debugging.","37","Record and debug user sessions with full devtool capture (JS errors, network, perf, state). Sanitize data before it is captured through generic global rules or HTML attributes. Can un-minify JS with source maps. Plugins to capture API requests e.g. GraphQL and correlate with backend monitoring (Datadog, New Relic, Cloudwatch, etc).","333","Limited documentation for scalability and reliability - you must manage multiple components e.g. Redis, PostgreSQL (a fully managed cloud version is available). Data exporter only available in enterprise version.","212","","FALSE"],["git-bug","git-bug","2021-10-27","2021-10-28","https://github.com/MichaelMure/git-bug","Developer Tools - Git tools","Open Source","Bug tracker embedded in your git repo.","38","Work from a CLI, interactive TUI or web UI. Doesn’t pollute your repo (everything lives in .git) and interactions are like normal Git (add, push, pull, etc). Issues can live alongside the code repo they belong to. Can bridge with GitHub, GitLab and JIRA so you can use git-bug and others can stick with a centralized server.","324","Web UI is currently read-only. Does not support media file attachments. Not a stable release yet, but still worth playing with.","127","","FALSE"],["immudb","immudb","2021-10-20","2021-10-21","https://github.com/codenotary/immudb","Database - Relational database","Open Source","Open source immutable database.","31","Can be used as a database server or as a library. Acts as a k/v store or can be queried using SQL. Storage agnostic - can even be S3. Built-in Prometheus endpoint. Can disable synchronous indexing to increase performance. Supports PostgreSQL wire protocol. Interesting use case as a secondary database for cryptographic verification of the primary.","348","Only Go SDK is fully developed - others still in progress. No replication or hot backup support yet.","100","/interviews/immudb-jeronimo-irazabal/","TRUE"],["gron","gron","2021-10-20","2021-10-21","https://github.com/tomnomnom/gron","Misc - Terminal utilities","Open Source","Makes JSON greppable.\n","22","Supports input from a file, URL or stdin so it can be piped to grep and properly searched. Allows the full path to be revealed. Colorizes output. Easily diff sets of JSON. ungron reverses the conversion, so you can pipe grep results back to JSON. Cross-platform binaries available for Windows, Linux and Mac.","308","You could just use jq which has more features, but it assumes you know more about your JSON data structure. gron is deliberately simple and grep is well known.","159","","FALSE"],["git-branchless","git-branchless","2021-10-20","2021-10-21","https://github.com/arxanas/git-branchless","Developer Tools - Git tools","Open Source","Git tools for repo visualization and navigation.","48","Allows you to move between stacks of commits without using branches. `git move` is implemented in-memory so is faster than `git rebase`, which works on-disk. Interactive `git undo` command helps fix commits, merges, rebases, checkouts and branches. Smartlog command visualizes work without branches (unlike `git log --graph`).","326","No release binaries - must be installed (and compiled) with Rust’s cargo. Not designed to handle untracked files.","113","","FALSE"],["LambdaTest","LambdaTest","2021-10-13","2021-10-14","https://www.lambdatest.com/","Developer Tools - Browser testing","SaaS","Cross browser testing platform.","31","Lots of desktop and mobile browser versions, including very old devices and new betas. Can write tests in open source Selenium or Cypress frameworks. Tests can be automatically compared against previous runs. Integrates into CI/CD to detect regressions. Geotarget features can test localization e.g. currencies, time zone changes etc.","334","Mobile tests are executed on emulators (real device support currently in beta). No support for testing on Linux.","112","/interviews/lambdatest-mayank-bhola/","TRUE"],["Delta","Delta","2021-10-13","2021-10-14","https://github.com/dandavison/delta","Developer Tools - Git tools","Open Source","CLI for (git) code diffs.","25","Displays line numbers. Side by side view. Can be used independently from the terminal, but configured through git means it supports all git features outputting code. Highly configurable theming and output options e.g. colors, line number styles. Cross platform and OS packages for multiple systems.","298","Colorized output does not follow the current terminal theme - must be independently configured. ","96","","FALSE"],["exo","exo","2021-10-06","2021-10-07","https://exo.deref.io/","Developer Tools - Local development","Open Source","Process and log manager for dev.","32","Runs the commands from your Procfile or Docker Compose config e.g. running separate commands to launch your project’s UI and API. Aggregates logs into a single, colorized terminal output. Local web GUI allows log toggle, search & filtering, manage spawned processes and other resources e.g. Docker storage. CLI can control processes, query logs and daemonize.","359","Weird, custom open source license. Web docs could do with expanding - CLI has a useful builtin help command though. No OS packages - binaries for Linux and macOS only.","167","","FALSE"],["Unleash","Unleash","2021-10-06","2021-10-07","https://www.getunleash.io/","Developer Tools - Testing frameworks","Open Source","Open source feature flags.","26","Local evaluation of feature toggles avoids network latency. SDKs for all major languages. Proxy module means it can work even for single page apps. Support for gradual rollout and user segmentation strategies e.g. by user profile fields. Tech debt dashboard tracks use of feature flags and warns if they are unused.","315","Unclear how to deploy in a high availability configuration. Limited usage stats (evaluations over the last minute and hour).\n","125","","FALSE"],["CodeSee","CodeSee Maps","2021-09-29","2021-09-30","https://www.codesee.io/","Developer Tools - Documentation","SaaS","Code maps as documentation.","27","Highlights dependencies and related code structure. Code maps auto-update with each commit - map diffs posted into GitHub PRs. Can build step-by-step tours for onboarding new devs into the codebase. Auto heat maps by latest activity, creation date or commit count.","264","Requires GitHub. Currently only supports dependency resolution for 4 languages (Python, JS, Java, Go).","102","/interviews/codesee-shanea-leven/","TRUE"],["procs","procs","2021-09-29","2021-09-30","https://github.com/dalance/procs","Misc - Terminal utilities","Open Source","Process status viewer; replacement for ps.","42","Uses terminal theme colors. Layout makes it easy to read. Tree option shows parent and child processes. Can look into Docker to reveal container name & commands. Watch mode like top. Columns can be configured at run time or in a config file. Can show ports processes are listening on. Cross-platform support.","308","macOS and Windows support is experimental (worked fine in our tests). No pager on Windows. Search is case sensitive.","116","","FALSE"],["zoxide","zoxide","2021-09-21","2021-09-23","https://github.com/ajeetdsouza/zoxide","Misc - Terminal utilities","Open Source","Smarter cd for your terminal.","29","Ranking algorithm means it usually guesses which path you mean so you can navigate common long paths without typing them all out. Multi-platform options for installing. Includes an fzf-powered interactive mode. Integrations available for Emacs, Ranger, Neovim. Zsh autocomplete available.","288","Years of muscle memory using cd means you probably want to alias it to zoxide. Renamed paths can confuse the history - need to edit the DB to update them.","154","","FALSE"]],"formatted":[{"Company/Org":"Meilisearch","Tool/Product/Project":"Meilisearch","Reviewed":"2022-04-27","Scheduled for":"2022-04-28","URL":"https://www.meilisearch.com/","Category":"Developer Tools - Site Search","Type":"Open Source","What is it?":"Open source search engine.","Len":"131","What we like":"Search backend as a single (Rust) binary. Gives you search as you type, typo-tolerance, synonyms, highlighting, filters, facets, sorting, and phrase search via a REST API. SDKs for a large number of languages, frontend, and backend frameworks. Includes a simple search web UI out of the box.","What we dislike":"Databases incompatible between versions whilst pre-v1.0 - requires manual steps to upgrade. Not designed for >10 million documents.","Interview":"/interviews/meilisearch-quentin-de-quelen/","Sponsored":"FALSE"},{"Company/Org":"Encore","Tool/Product/Project":"Encore","Reviewed":"2022-04-27","Scheduled for":"2022-04-28","URL":"https://encore.dev/","Category":"Developer Tools - Backend framework","Type":"Open Source","What is it?":"Backend dev framework.","Len":"149","What we like":"Create APIs (internal, public, authenticated) from annotations on standard functions. Databases, queues, scheduled tasks are native code primitives. Builds, deploys, tracing and logs built in. Provisions local and/or cloud test/dev environments. Open source, use your own cloud (AWS, Azure, GCP), or the Encore cloud.","What we dislike":"Platform is Golang only. Auto-generates API client libraries, but currently only supports TypeScript. Supports Postgres migrations, but no rollbacks.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Changie","Tool/Product/Project":"Changie","Reviewed":"2022-04-27","Scheduled for":"2022-04-28","URL":"https://changie.dev/","Category":"Developer Tools - Documentation","Type":"Open Source","What is it?":"Automated changelogs.","Len":"147","What we like":"Simple CLI for generating file-based changelogs separate from commits. Using files means changelog entries can be part of diffs. Customizable templates for standardizing input of different types of changes e.g. bug fix, feature, deprecation. Command to merge all changes into a single file.","What we dislike":"Adding changes becomes another step separate from committing, but it can be integrated with other tools e.g. GoReleaser or GitHub release triggers.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Rowy","Tool/Product/Project":"Rowy","Reviewed":"2022-04-20","Scheduled for":"2022-04-21","URL":"https://www.rowy.io/","Category":"Developer Tools - Backend framework","Type":"Open Source","What is it?":"Low-code backend framework.","Len":"82","What we like":"Acts as a layer on top of the GCP products e.g. Firestore, Cloud Functions, so you can always “break out” to use the full cloud functionality. Easy to create UIs with field types, JOINs across tables, custom code functions executing on data, or external web services. Write functions in JS and use NPM modules. Open source.","What we dislike":"Only supports Google Cloud and Firestore (for now). Only supports JS/TS functions.","Interview":"/interviews/rowy-harini-janakiraman/","Sponsored":"TRUE"},{"Company/Org":"nut.js","Tool/Product/Project":"nut.js","Reviewed":"2022-04-20","Scheduled for":"2022-04-21","URL":"https://nutjs.dev/","Category":"Misc - OS","Type":"Open Source","What is it?":"Desktop UI automation.","Len":"141","What we like":"Script desktop UI actions - mouse, keyboard, clipboard, windows and what is on screen. Supports macOS, Windows, and Linux. Trigger keyboard shortcuts, input text, find images, click and drag actions. Useful for UI testing or automating common actions. Open source.","What we dislike":"Requires additional runtimes on each platform. Docs don’t do a good job of explaining real-world use cases - best to explore code & examples.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Redo","Tool/Product/Project":"Redo","Reviewed":"2022-04-20","Scheduled for":"2022-04-21","URL":"https://github.com/barthr/redo","Category":"Misc - Terminal utilities","Type":"Open Source","What is it?":"Create reusable shell functions.","Len":"98","What we like":"Interactive CLI to combine previously executed commands into a new shell function. Shell agnostic. Generated functions are written to a plain text file which can easily be stored in Git or cloud storage.","What we dislike":"Passing additional arguments not supported. No OS packages e.g. homebrew. Doesn’t work on Windows.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Warp","Tool/Product/Project":"Warp","Reviewed":"2022-04-13","Scheduled for":"2022-04-14","URL":"https://www.warp.dev/","Category":"Misc - Terminal emulators","Type":"Desktop","What is it?":"GPU accelerated terminal.","Len":"125","What we like":"Built-in auto complete for common commands and options. Output contained within blocks which can be navigated with keyboard shortcuts, easily copied or shared using a web link. Input is a proper text field e.g., easy input for multiple lines, select text, dual cursors, etc. Dark/light mode theme sync. Command palette.","What we dislike":"macOS only (for now). Not open source (yet). You have to manually find and download themes. Default telemetry whilst in beta.","Interview":"/interviews/warp-zach-lloyd/","Sponsored":"TRUE"},{"Company/Org":"Dockside","Tool/Product/Project":"Dockside","Reviewed":"2022-04-13","Scheduled for":"2022-04-14","URL":"https://dockside.io/","Category":"Developer Tools - IDE","Type":"Other","What is it?":"IDE in containers.","Len":"218","What we like":"Like running your own local GitHub Codespaces - containerized environment with an IDE attached (uses Theia). Or host in the cloud for team access. IDE is VS Code compatible, runs in your browser. Specify Docker images to launch, or use your own. Quickly spin up new containers for different environments, with RBAC and HTTPS endpoints","What we dislike":"Theia is very minimalistic by default and doesn’t support VS Code Settings Sync, so you need to spend time setting it up. Assumes x86 by default - be sure to use arch-specific images e.g. ARM, otherwise it’s very slow.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"RonDB","Tool/Product/Project":"RonDB","Reviewed":"2022-04-13","Scheduled for":"2022-04-14","URL":"https://www.rondb.com/","Category":"Database - KV store","Type":"Open Source","What is it?":"K/V store with SQL interface.","Len":"227","What we like":"High performance high availability datastore with fully synchronous transactions and non-blocking two phase commits within a single cluster. Async replication between clusters. Scales linearly with CPUs. Queries automatically parallelized. MySQL (NDB) compatible interface with many native language SDKs. Open source.","What we dislike":"Query server and data server are split components, which adds some network overhead (deliberate decision for high availability and distributed environments). Designed for scale, which you may not need. Missing quickstart guide.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Knock","Tool/Product/Project":"Knock","Reviewed":"2022-04-06","Scheduled for":"2022-04-07","URL":"https://knock.app/","Category":"API - Communication","Type":"SaaS","What is it?":"Notifications infrastructure.","Len":"148","What we like":"APIs for all the logic around sending notifications. Batching allows triggers to be aggregated into a single notification e.g. many recent comments on a doc into a single email. Supports email, SMS, push and chat notifications, plus in-app feeds. State sync for read status plus notification delays e.g. send email if not read in-feed after 30 mins.","What we dislike":"Available SDKs limited to REST, Node, Python, Ruby, .NET and Elixir. Doesn’t send the notifications - needs to integrate with Twilio, Sendgrid, etc.","Interview":"/interviews/knock-christopher-bell/","Sponsored":"TRUE"},{"Company/Org":"Helix","Tool/Product/Project":"Helix","Reviewed":"2022-04-06","Scheduled for":"2022-04-07","URL":"https://helix-editor.com/","Category":"Developer Tools - Text editors","Type":"Open Source","What is it?":"Terminal text editor.","Len":"166","What we like":"Everything is included - no need to install extra plugins. Supports fuzzy search, buffers, language server with syntax highlighting, suggestions and auto indent. Easily discoverable commands. Powerful text manipulation via selection then edit. Clipboard integration. Built-in themes. Open source.","What we dislike":"Suggestions and auto indent language support are more limited than those which support syntax highlighting. No real plugin ecosystem - text editor rather than an IDE.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"tRPC","Tool/Product/Project":"tRPC","Reviewed":"2022-04-06","Scheduled for":"2022-04-07","URL":"https://trpc.io/","Category":"API - API","Type":"Open Source","What is it?":"Typesafe API framework.","Len":"149","What we like":"Define type-safe APIs in TypeScript to avoid code generation by sharing types between client/server. Includes adapters for major frameworks e.g. React, Next, Express. Built-in query batching and caching. Supports middleware, logs, WebSockets, and Subscriptions. Supports data transforms e.g. superjson to use standard types over the wire.","What we dislike":"Assumes you’re using TypeScript for client and server. Not so useful if you’ve already built a GraphQL endpoint. WebSockets & subscriptions in beta. ","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Tonic","Tool/Product/Project":"Tonic","Reviewed":"2022-03-30","Scheduled for":"2022-03-31","URL":"https://www.tonic.ai/","Category":"Developer Tools - Testing frameworks","Type":"SaaS","What is it?":"Fake data platform.","Len":"129","What we like":"Generates realistic fake data through analysis of the real data. Understands field types with a large range of generators e.g. addresses, cross-table sums, UUIDs, etc. Can implement differential privacy and statistical relationships between fields / foreign keys. Maintains consistency through constraints, cardinality and duplication. SaaS or on-prem.","What we dislike":"No self-service signup. Generated data is exported directly to a destination database - no option to download rather than export.","Interview":"/interviews/tonic-adam-kamor/","Sponsored":"TRUE"},{"Company/Org":"Hypertrace","Tool/Product/Project":"Hypertrace","Reviewed":"2022-03-30","Scheduled for":"2022-03-31","URL":"https://www.hypertrace.org/","Category":"DevOps - Observability","Type":"Other","What is it?":"Open source tracing.","Len":"167","What we like":"Supports OpenTelemetry, Jaeger and Zipkin plus agent-based SDKs for Java, Go and Python. Cloud native design running inside k8s with Helm Charts. Built-in UI for global health, services, metrics, traces and logs. Processes events in real-time without sampling. Open source.","What we dislike":"Complicated architecture, which provides scalability at the cost of complexity. You need to learn how to manage the analytics datastore (Apache Pinot, still pre-v1.0).","Interview":"","Sponsored":"FALSE"},{"Company/Org":"TablePlus","Tool/Product/Project":"TablePlus","Reviewed":"2022-03-30","Scheduled for":"2022-03-31","URL":"https://tableplus.com/","Category":"Database - Management","Type":"Desktop","What is it?":"Desktop database client.","Len":"174","What we like":"Native client (not Electron) for PgSQL, MySQL, Mongo, Redshift, and others. Query log shows SQL behind the scenes. Visual row and table editor makes it easy to select field types, alter structure, search/filter, and input data. Can preview changes and SQL before it executes. Inspect DDL for schemas. CSV/SQL import/export. Mac, Windows, iOS.","What we dislike":"Linux support in alpha testing. GUI sometimes confusing e.g. position of “+ Row” to add a new row is at the bottom, unable to multi-select a column rather than the whole row.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Pipedream","Tool/Product/Project":"Pipedream","Reviewed":"2022-03-23","Scheduled for":"2022-03-24","URL":"https://pipedream.com/","Category":"Developer Tools - Workflow management","Type":"SaaS","What is it?":"Connect APIs with (no)code.","Len":"121","What we like":"Handle events from a large number of sources - HTTP endpoints, databases, services like Docusign, Zoom or Google Drive. Chain steps to manipulate source data - send emails, update Google Sheets, insert into database. No-code web editor to query source fields. Use pre-built modules or write code and use packages in custom steps.","What we dislike":"Primary support for custom modules written in Node, but Python, Go, and Bash are in alpha testing. 512MB diskspace limit.","Interview":"/interviews/pipedream-dylan-sather/","Sponsored":"FALSE"},{"Company/Org":"Lazygit","Tool/Product/Project":"Lazygit","Reviewed":"2022-03-23","Scheduled for":"2022-03-24","URL":"https://github.com/jesseduffield/lazygit","Category":"Developer Tools - Git tools","Type":"Open Source","What is it?":"git TUI.","Len":"168","What we like":"Easily run common actions visually - stage (individual lines, files, everything), commit, stash, review logs, interactive rebase, undo/move commits or patches - with just a few keyboard shortcuts. Cherry pick commits to other branches. Uses default terminal theme, also customizable. Binaries and packages available for every platform.","What we dislike":"Lots of keyboard shortcuts to learn, but the display menu makes it easy to discover them. Up/Down keybindings not used - uses Left/Right, which is somewhat unintuitive.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Tilt","Tool/Product/Project":"Tilt","Reviewed":"2022-03-23","Scheduled for":"2022-03-24","URL":"https://tilt.dev/","Category":"Developer Tools - Local development","Type":"Open Source","What is it?":"Dev environment manager for k8s.","Len":"171","What we like":"Define all the containers and services in complex (microservices) applications to manage local dev with a single `tilt up` command. Config file uses a dialect of Python so it can be programmed. UI to manage all running services - get endpoint, view status, tail logs, create your own actions. Supports live updates/rebuilds. Open source.","What we dislike":"Focused on k8s, but does support other systems e.g. Podman, Helm, shell scripts. Has opt-in support for remote clusters, but designed primarily for local dev environments.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Liveblocks Storage","Tool/Product/Project":"Liveblocks Storage","Reviewed":"2022-03-16","Scheduled for":"2022-03-17","URL":"https://liveblocks.io/","Category":"API - API","Type":"SaaS","What is it?":"Real-time data storage API.","Len":"82","What we like":"Building blocks to make it easy to create collaborative applications e.g. multiplayer documents. APIs convert JS objects, lists and maps into CRDTs with managed sync of changes, conflicts, and offline support. Handles persistence of documents. REST API or SDKs for React, Zustand, Redux, Node.","What we dislike":"JS-only. 128KiB payload size limit - you need to handle splitting data structures.","Interview":"","Sponsored":"TRUE"},{"Company/Org":"dsq","Tool/Product/Project":"dsq","Reviewed":"2022-03-16","Scheduled for":"2022-03-17","URL":"https://github.com/multiprocessio/dsq","Category":"Misc - Terminal utilities","Type":"Open Source","What is it?":"CLI for querying files with SQL.","Len":"108","What we like":"Allows querying different file types with SQL e.g. CSV, JSON, Parquet, Excel, Apache/Nginx logs. Uses SQLite under the hood. Supports multiple files as “table”, and joins between them. Query nested objects.","What we dislike":"Piping files doesn’t work on Windows. Doesn’t support paths through nested arrays. Binaries only for x86_64.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Secretive","Tool/Product/Project":"Secretive","Reviewed":"2022-03-16","Scheduled for":"2022-03-17","URL":"https://github.com/maxgoedjen/secretive","Category":"Misc - OS","Type":"Desktop","What is it?":"Store SSH keys in secure enclave.","Len":"104","What we like":"SSH keys securely stored in Apple’s secure enclave. Works with git, SSH connections, etc. Authenticated via macOS, which allows you to use Touch ID and Apple Watch. Native management GUI. Open source.","What we dislike":"Keys can’t be exported, which is by design and you should really have different keys per machine anyway.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Daily.dev","Tool/Product/Project":"Daily.dev","Reviewed":"2022-03-09","Scheduled for":"2022-03-10","URL":"https://daily.dev/","Category":"Misc - Browser utilities","Type":"Desktop","What is it?":"Feed for developer news.","Len":"95","What we like":"Highlights dev-related articles based on customizable topics. Web version or replace browser start page (Chrome, Firefox, Edge). DND mode to avoid distracting articles during specified times. Bookmarked articles available as RSS and can be committed to GitHub. Open source.","What we dislike":"Ability to subscribe to arbitrary RSS feeds would make it more customizable. No native iOS app.","Interview":"/interviews/dailydev-ido-shamun/","Sponsored":"TRUE"},{"Company/Org":"GrowthBook","Tool/Product/Project":"GrowthBook","Reviewed":"2022-03-09","Scheduled for":"2022-03-10","URL":"https://www.growthbook.io/","Category":"Developer Tools - Testing frameworks","Type":"Open Source","What is it?":"Open source feature flags & A/B testing.","Len":"170","What we like":"Option for self-hosted (via a Docker container) or cloud service. Supports many different analytics datastores so existing data can be used to run experiments e.g. Redshift, Snowflake, ClickHouse, Postgres, MySQL. SDKs for running experiments from code. Jupyter notebook export.","What we dislike":"SDKs only available for JS, React, PHP, Ruby, Python, Go, Kotlin. When self-hosting, you need to deal with deploying the feature definition endpoint behind a caching CDN.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"micro","Tool/Product/Project":"micro","Reviewed":"2022-03-09","Scheduled for":"2022-03-10","URL":"https://micro-editor.github.io/","Category":"Developer Tools - Text editors","Type":"Open Source","What is it?":"Terminal text editor.","Len":"128","What we like":"Static (Go) binary makes it easy to install anywhere (also in major package managers). Splits, tabs, discoverable keybindings, multiple cursors, mouse support (selecting!), color themes, diff gutter, auto-complete, syntax highlighting, system clipboard integration, linting, macros.","What we dislike":"Plugins written in Lua and the ecosystem is still small. Compatibility mode for those coming from vim would help the transition.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Stepsize","Tool/Product/Project":"Stepsize","Reviewed":"2022-03-02","Scheduled for":"2022-03-03","URL":"https://www.stepsize.com/?utm_source=console.dev&utm_medium=referral&utm_campaign=console.dev+interview","Category":"Developer Tools - IDE","Type":"SaaS","What is it?":"Link issues to code.","Len":"177","What we like":"Integrates with VS Code and JetBrains IDEs to link issues with code. Issues highlighted with the currently open editor with indicators on the relevant lines of code. Syncs with JIRA, GitHub Issues, Linear. Tracks TODO comments across the codebase.","What we dislike":"Issues exist within Stepsize and any synced third-party issue tracker - would like to see the ability to have the third-party tracker as the sole backend. No GitLab integration.","Interview":"/interviews/stepsize-alex-omeyer/","Sponsored":"TRUE"},{"Company/Org":"Hermit","Tool/Product/Project":"Hermit","Reviewed":"2022-03-02","Scheduled for":"2022-03-03","URL":"https://cashapp.github.io/hermit/","Category":"Developer Tools - Dependency management","Type":"Open Source","What is it?":"Dev environment management.","Len":"132","What we like":"Bootstrap and manage isolated dev environments tied to the code e.g. specific versions of Go, Rust, Node, GNU make, etc. Config (and packages) defined in HCL. Supports private packages. Can define environment variables. Runs in CI. Hooks into your shell for auto-activation of environments.","What we dislike":"Supports Mac and Linux only. It’s not a package manager - it handles the dev tools only, so Nix may be better for code dependencies.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"htmlq","Tool/Product/Project":"htmlq","Reviewed":"2022-03-02","Scheduled for":"2022-03-03","URL":"https://github.com/mgdm/htmlq","Category":"Misc - Terminal utilities","Type":"Open Source","What is it?":"CSS selectors for HTML.","Len":"83","What we like":"Easily query HTML using selectors such as IDs, attributes, text filters, and nodes. Can perform actions like returning all links, extracting text, removing nodes. Pretty print HTML. Open source. Packages available for Mac, FreeBSD, Windows.","What we dislike":"No syntax highlighting for pretty print - you’ll need to pipe it to something else.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Strapi","Tool/Product/Project":"Strapi","Reviewed":"2022-02-23","Scheduled for":"2022-02-24","URL":"https://strapi.io/?utm_source=console.dev&utm_medium=referral&utm_campaign=newsletter","Category":"Developer Tools - Backend framework","Type":"Open Source","What is it?":"Open source headless CMS.","Len":"144","What we like":"Provides REST (default) and GraphQL (via a plugin) APIs to your content. Choice of backing datastore - defaults to SQLite; MySQL, Postgres, MariaDB also supported. Admin panel is “static”, so can be deployed anywhere that can serve web requests e.g. S3. Can also use S3 for handling media uploads. Open source.","What we dislike":"Need to deploy a proxy such as HAProxy or Nginx in front of your API to provide load balancing and SSL in production. Admin UI has no dark mode.","Interview":"/interviews/strapi-pierre-burgy/","Sponsored":"TRUE"},{"Company/Org":"Goose","Tool/Product/Project":"Goose","Reviewed":"2022-02-23","Scheduled for":"2022-02-24","URL":"https://pressly.github.io/goose/","Category":"Database - Management","Type":"Open Source","What is it?":"DB schema migration framework.","Len":"17","What we like":"Can run migrations as SQL files on disk or embedded into Go functions. The latter means you can ship a self-contained binary to run migrations with no dependencies. Supports out of order migrations. Good DB support: Redshift, MySQL, Postgres, Clickhouse, and others.","What we dislike":"No dry-run mode. ","Interview":"","Sponsored":"FALSE"},{"Company/Org":"GitFinder","Tool/Product/Project":"GitFinder","Reviewed":"2022-02-23","Scheduled for":"2022-02-24","URL":"https://gitfinder.com/","Category":"Developer Tools - Git tools","Type":"Desktop","What is it?":"Git GUI for macOS.","Len":"103","What we like":"Finder integration shows file status badges. Can open and manage GitHub, GitLab, BitBucket PRs from the client. Repo browser with history timeline, tags, remotes, branches. Use the built-in diff viewer or launch your own. Point & click GUI or do everything via shortcuts.","What we dislike":"Have to manually add each repo you want to use it with. No syntax highlighting in built-in diff viewer.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Replay","Tool/Product/Project":"Replay","Reviewed":"2022-02-16","Scheduled for":"2022-02-17","URL":"https://www.replay.io","Category":"Developer Tools - Testing frameworks","Type":"SaaS","What is it?":"Time travel debugger.","Len":"170","What we like":"Go back in time and add debug statements, inspect React components, access browser devtools and network requests. Record automated tests (Playwright, Puppeteer) to get replays for failures. Clever implementation means (non-deterministic) inputs are recorded rather than every system call (significantly reduces overhead and allows for replaying state at all points in time).","What we dislike":"Currently only supports web runtimes via a browser or Node - other language support is on the roadmap. Partial dark mode support (in the Replay browser, but not the app).","Interview":"/interviews/replay-jason-laster/","Sponsored":"FALSE"},{"Company/Org":"JLess","Tool/Product/Project":"JLess","Reviewed":"2022-02-16","Scheduled for":"2022-02-17","URL":"https://jless.io/","Category":"Misc - Terminal utilities","Type":"Open Source","What is it?":"JSON explorer CLI.","Len":"65","What we like":"Pretty-print JSON files. Expand/collapse objects and arrays. Vim-inspired commands make navigating easy e.g. move around nodes and siblings, focus on lines, scroll by characters or lines. Uses native shell colors. Regex and full text searching.","What we dislike":"macOS and Linux only. Ability to word-wrap lines would be useful.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Dockly","Tool/Product/Project":"Dockly","Reviewed":"2022-02-16","Scheduled for":"2022-02-17","URL":"https://github.com/lirantal/dockly","Category":"DevOps - Containers","Type":"Open Source","What is it?":"Docker TUI.","Len":"125","What we like":"Interactive terminal interface for managing Docker - list, search, tail logs, stop, star and enter shell for any locally running containers. Shows basic stats e.g. CPU utilization, state and status. Inherits native shell colors.","What we dislike":"Doesn’t auto-refresh on the dashboard view. Assumes connecting to a local Docker daemon - can be run in Docker itself though.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Semgrep","Tool/Product/Project":"Semgrep","Reviewed":"2022-02-09","Scheduled for":"2022-02-10","URL":"https://semgrep.dev","Category":"Developer Tools - Testing frameworks","Type":"Open Source","What is it?":"Code analysis CLI.","Len":"190","What we like":"Analyze code via CLI, IDE and/or CI/CD for rule compliance e.g. deprecate APIs, enforce coding standards, detect common security issues (OWASP 10, etc). Understands meaning of code, not just rules by text matching, Large number of community rules for common scenarios. Open source + cloud version for team features.","What we dislike":"Rules are defined in code similar to the language(s) it is scanning, but still requires learning a new config syntax. Support for some languages still experimental (Bash, C, C++, PHP, Rust).","Interview":"/interviews/semgrep-isaac-evans/","Sponsored":"TRUE"},{"Company/Org":"Fly.io","Tool/Product/Project":"Fly.io","Reviewed":"2022-02-09","Scheduled for":"2022-02-10","URL":"https://fly.io","Category":"Cloud - Compute","Type":"SaaS","What is it?":"Deploy containers globally.","Len":"163","What we like":"CLI-first interface. Deploys apps from a Dockerfile to global locations, but they actually run on Firecracker VMs. Scale up app instances with 1 command (or use auto scaling). Internal IPv6 networking with clever address routing to discover instances (which you can connect to via Wireguard). Managed Postgres with HA & read replicas.","What we dislike":"Some nuances are unclear in the docs e.g. specifying health checks and port routing examples. Billing/usage info is only via a limited web UI. No (documented) API.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Cheat","Tool/Product/Project":"Cheat","Reviewed":"2022-02-09","Scheduled for":"2022-02-10","URL":"https://github.com/cheat/cheat","Category":"Misc - Terminal utilities","Type":"","What is it?":"CLI cheat sheets.","Len":"84","What we like":"Built in community cheat sheets auto-downloaded for all major Unix commands - quickly get access to examples of the most common options. Create your own, then add tags and paths. Phrase search within. Autocompletion for bash, fish and zsh.","What we dislike":"Integration with fzf is not clear how to use. Does not inherit custom shell colors.\n","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Budibase","Tool/Product/Project":"Budibase","Reviewed":"2022-02-02","Scheduled for":"2022-02-03","URL":"https://budibase.com/?utm_source=newsletter&utm_medium=email&utm_campaign=console_dev","Category":"Developer Tools - UI Builder","Type":"Open Source","What is it?":"Open source low-code app builder.","Len":"177","What we like":"Can connect to REST APIs and import API specs e.g. Swagger/OpenAPI 2.0 to automatically connect the UI to the data (or databases and CSV). Can create custom views with filters, grouped or calculated fields from data sources. Multi-step automations to process data. Supports dark mode. Open source or cloud service.","What we dislike":"Only has basic theming options. OpenAPI 3.0 is not yet supported. Apps can be exported/imported as JSON, but format is undocumented and not ideal for storing in version control.","Interview":"/interviews/budibase-martin-mckeaveney/","Sponsored":"TRUE"},{"Company/Org":"Script Kit","Tool/Product/Project":"Script Kit","Reviewed":"2022-02-02","Scheduled for":"2022-02-03","URL":"https://www.scriptkit.com/","Category":"Developer Tools - Local development","Type":"Desktop","What is it?":"Dev workflow scripting.","Len":"144","What we like":"Quickly execute scripts from an Alfred/Spotlight type launcher. Scripts written in JS to perform actions like search APIs, launch apps, resize images, manipulate strings - anything you can do with Node.JS (including npm support). Built-in UI for script inputs. Add keyboard shortcuts.","What we dislike":"Windows and Linux support still in preview - Linux has no OS packages and has some feature limitations, Windows build is unsigned. Limited docs.","Interview":"@johnlindquist","Sponsored":"FALSE"},{"Company/Org":"Gita","Tool/Product/Project":"Gita","Reviewed":"2022-02-02","Scheduled for":"2022-02-03","URL":"https://github.com/nosarthur/gita","Category":"Developer Tools - Git tools","Type":"Open Source","What is it?":"Manage multiple Git repos.","Len":"208","What we like":"List all Git repos in a directory and view their status, branch, staged/unstaged changes and last commit message. Color coding shows status compared to remote. Can add flags, list by flag, group, list by group. List repos in a config file then clone them all at once. Batch execute git commands across all/grouped/specific repos e.g. git pull on all repos. ","What we dislike":"Would benefit from a dry-run option to see what it is going to do e.g. when cloning many repos. Need to manually add repos you want it to be able to manage (easily add all in a directory using recursive add).","Interview":"","Sponsored":"FALSE"},{"Company/Org":"imgproxy","Tool/Product/Project":"imgproxy","Reviewed":"2022-01-26","Scheduled for":"2022-01-27","URL":"https://imgproxy.net/","Category":"API - API","Type":"Open Source","What is it?":"Fast remote image resizer.","Len":"231","What we like":"Go binary or run as a container (includes official Helm chart). Resize images via URLs, which can (and should) be signed. Can serve files from cloud storage (S3, GCS, etc). Can compress, crop, fill, blur, watermark and convert to desired formats. Emits metrics to Prometheus, New Relic & Datadog. Open source.","What we dislike":"Designed to focus just on image resizing - you need to configure your own caching and HTTPS proxy, and other non-core features - but this is a deliberate tradeoff for security & performance. No official images for Windows or arm64.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"elfshaker","Tool/Product/Project":"elfshaker","Reviewed":"2022-01-26","Scheduled for":"2022-01-27","URL":"https://github.com/elfshaker/elfshaker","Category":"Misc - Terminal utilities","Type":"Open Source","What is it?":"High performance version control for binaries.","Len":"195","What we like":"Designed to work particularly well for use cases with lots of similar files that don’t change often. Snapshot command stores the state of the current working directory - execute as you make changes like a git commit. Pack command compresses the snapshots. Very fast snapshot extract. Open source and works on Windows, Linux, macOS.","What we dislike":"Snapshot names have restricted allowed characters e.g. period is not allowed which would be useful for version numbering. Pre-compiled binaries Linux-only so you need to build yourself with Rust.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Miller","Tool/Product/Project":"Miller","Reviewed":"2022-01-26","Scheduled for":"2022-01-27","URL":"https://miller.readthedocs.io/en/latest/","Category":"Misc - Terminal utilities","Type":"Open Source","What is it?":"Query & reformat CSV, TSV, JSON.","Len":"221","What we like":"Work with field names rather than positional indices. Add new fields, run aggregations, colorized, tabular pretty-print. Operates with streams so only a single record is in memory at one time (unless needed for certain operations like sort) i.e. minimal footprint. Single binary (Golang, open source) with packages for Windows, Linux, macOS.","What we dislike":"Uses its own color scheme rather than inheriting current shell profile. Lots of power in the Miller DSL and the built-in command verbs can do a lot, but it’s another programming language to use for custom transformations.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Swimm","Tool/Product/Project":"Swimm","Reviewed":"2022-01-19","Scheduled for":"2022-01-20","URL":"https://swimm.io/?utm_source=newsletter&utm_medium=paid_refferal&utm_campaign=console.dev","Category":"Developer Tools - Documentation","Type":"SaaS","What is it?":"Documentation as code.","Len":"186","What we like":"Docs live as Markdown in the code repo. Smart editor links snippets and references even through refactors, moves, renames, etc. Plugin for VS Code and JetBrains editors to render docs in-line/. Integrate with CI (or Git hooks) to get PR comments and a quick edit link when docs need updating.","What we dislike":"CLI can be run in any CI/CD environment, but the GitHub app gives much faster feedback as PR comments (other integrations on the roadmap). Any existing docs need to be imported manually.","Interview":"/interviews/swimm-omer-rosenbaum/","Sponsored":"TRUE"},{"Company/Org":"Cube","Tool/Product/Project":"Cube","Reviewed":"2022-01-19","Scheduled for":"2022-01-20","URL":"https://cube.dev/","Category":"API - API","Type":"Open Source","What is it?":"API for building analytics.","Len":"148","What we like":"Provides an HTTP API with caching, pre-aggregation and SQL support on top of popular datastores e.g. Postgres, Redshift, BigQuery. Visualization libraries provided for D3, Vue, Angular, React. Local “playground” UI makes it easy to debug queries. Open source (including cluster mode for scaling). Optional cloud version.","What we dislike":"Caching can’t be disabled and requires Redis in prod, but the refresh time can be set to a low value e.g. 1s. SQL and GraphQL APIs still in preview.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"watchexec","Tool/Product/Project":"watchexec","Reviewed":"2022-01-19","Scheduled for":"2022-01-20","URL":"https://github.com/watchexec/watchexec","Category":"Misc - Terminal utilities","Type":"Open Source","What is it?":"Execute commands on file change.","Len":"108","What we like":"Simply watch files and execute commands when changes are detected. Specify files, filetypes, directories, filters/ignores (including .gitignore). Can issue command restarts e.g. for servers. Runs commands in a shell, which can be specified (or set to no shell).","What we dislike":"Directory watch is recursive, which might catch a large number of files (filter can be used to ignore them).","Interview":"","Sponsored":"FALSE"},{"Company/Org":"AutoCloud","Tool/Product/Project":"AutoCloud","Reviewed":"2022-01-12","Scheduled for":"2022-01-13","URL":"https://www.autocloud.dev/?utm_source=consoledev&utm_medium=email&utm_campaign=jan2022","Category":"DevOps - Infrastructure automation","Type":"SaaS","What is it?":"Visualize cloud resources.","Len":"153","What we like":"Snapshots allow you to visualize changes in cloud resources. Provides security and compliance suggestions, which can be exported to CSV. Search and filter resources which are highlighted in the map view. Provides a GraphQL API for your cloud resources. Open source backend with CLI.","What we dislike":"Can’t define custom policies for flagged issues. Auto crawl is only triggered once per day (can be integrated into CI/CD to trigger a version on deploy).","Interview":"/interviews/autocloud-evelyn-latour/","Sponsored":"TRUE"},{"Company/Org":"mob","Tool/Product/Project":"mob","Reviewed":"2022-01-12","Scheduled for":"2022-01-13","URL":"https://mob.sh/","Category":"Developer Tools - Git tools","Type":"Open Source","What is it?":"Fast git handover for pair programming.","Len":"232","What we like":"Manages WIP branches and makes it easy to hand over development to your programming partner(s). Makes it easy for multiple people to simultaneously contribute to a coding session. Built-in timers. Squashes commits by default. Single binary CLI with packages for macOS, Windows, Linux (including Arch & Nix).","What we dislike":"Config options set via environment variables only, so cannot be persisted across sessions. Default timer notification uses the system voice to speak out loud - can be changed via config, but a nicer media bell sound might be better.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Turborepo","Tool/Product/Project":"Turborepo","Reviewed":"2022-01-12","Scheduled for":"2022-01-13","URL":"https://turborepo.org/","Category":"Developer Tools - App Distribution","Type":"Open Source","What is it?":"Fast builds for JS / TS monorepos.","Len":"209","What we like":"Gradual install so you can slowly roll it out to different parts of your repo. Pipelines defined in package.json. Caches based on hashes so builds are incremental, which also includes logs and emitted files, making builds much faster. Supports remote caching that can be shared using content addressable storage.","What we dislike":"Treating logs as artifacts and caching them + emitted files is a technique which needs highlighting. Developers are careful about what gets output e.g. environmental variables and sensitive data in build logs.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"fuite","Tool/Product/Project":"fuite","Reviewed":"2022-01-04","Scheduled for":"2022-01-06","URL":"https://github.com/nolanlawson/fuite","Category":"Developer Tools - Testing frameworks","Type":"Open Source","What is it?":"Find memory leaks in web apps.","Len":"189","What we like":"Simple CLI for automating testing for memory leaks, primarily relevant for SPAs. Examines objects, event listeners, DOM nodes and collections. Default test scenario does most of what you need, but custom scenarios can be defined e.g. custom setup to log into an app. Has an API.","What we dislike":"Sensitive to all memory growth, a small amount of which may be perfectly normal for maintaining state. Focuses on the main frame so ignores cross-origin iFrames or web workers. Chrome-only.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Dura","Tool/Product/Project":"Dura","Reviewed":"2022-01-04","Scheduled for":"2022-01-06","URL":"https://github.com/tkellogg/dura","Category":"Developer Tools - Git tools","Type":"Open Source","What is it?":"Undo for Git repos.","Len":"179","What we like":"Commits uncommitted changes every 5 sec to a separate branch without affecting HEAD, the current branch or staged files. Use standard git commands to switch to the Dura branch if you need to recover. Can watch multiple directories.","What we dislike":"Still a prototype. Recovery requires multiple git commands to manage your working directory and checkout the branch. No indication whether the background process is still working.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"xh","Tool/Product/Project":"xh","Reviewed":"2022-01-04","Scheduled for":"2022-01-06","URL":"https://github.com/ducaale/xh","Category":"Misc - Terminal utilities","Type":"Open Source","What is it?":"Easy HTTP client.","Len":"159","What we like":"Not as fiddly as curl - can use shorthand URLs and it’ll do the right thing (HTTPS by default if using xhs binary). Can ask it to output the curl equivalent command if needed. Easy to specify body parameters, query strings, set request headers, get response headers. Response colorized by default. Packages for most systems (Mac, Linux & Windows).","What we dislike":"Doesn’t use the system TLS library, which means more consistent results but could cause issues if using it to troubleshoot local issues. No support for HTTP/3.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Teleport","Tool/Product/Project":"Teleport","Reviewed":"2021-12-15","Scheduled for":"2021-12-16","URL":"https://goteleport.com/?utm_campaign=eg&utm_medium=partner&utm_source=console","Category":"Security - Authentication","Type":"Open Source","What is it?":"Remote access management.","Len":"162","What we like":"RBAC for remote login to servers (SSH), databases, k8s, desktops and internal web applications. Uses cert-based access control with 2FA rather than passwords or keys. Records all sessions automatically. Teleport SSH server compatible with OpenSSH so you can use any client (including a web client). Open source - deploy self-hosted or via cloud.","What we dislike":"Supports config via Terraform but the provider is not available in the Terraform registry - must be installed manually. Desktop access for Windows only (for now).","Interview":"/interviews/teleport-ev-kontsevoy/","Sponsored":"TRUE"},{"Company/Org":"sd","Tool/Product/Project":"sd","Reviewed":"2021-12-15","Scheduled for":"2021-12-16","URL":"https://github.com/chmln/sd","Category":"Misc - Terminal utilities","Type":"Open Source","What is it?":"CLI for find & replace.","Len":"165","What we like":"Use regex syntax from JS and Python rather than figuring out sed and awk. Find and replace using string-literals to avoid regex entirely. Simple syntax for in-file operations, including preview changes. Simple replacements on large files significantly faster than sed. Cross-platform support with packages for common OSs.","What we dislike":"Latest release missing Windows binary (included with previous versions). Release binaries on GitHub only provided for x86, but other options included in OS packages.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"LakeFS","Tool/Product/Project":"LakeFS","Reviewed":"2021-12-15","Scheduled for":"2021-12-16","URL":"https://lakefs.io/","Category":"Developer Tools - Source control","Type":"Open Source","What is it?":"Git-like version control for object storage.","Len":"184","What we like":"Sits on top of S3-compatible object storage and acts as a copy-on-write management layer/proxy. Create branches of data e.g. to run tests, upgrade tools, migrate schemas, etc without risking the data. Atomic merge avoids bad states and allows rollbacks. Can ingest existing data without copying it.","What we dislike":"Depends on PostgreSQL for storing metadata, which adds operational overhead (decoupling, pluggable interfaces and storing metadata in the object storage itself are all on the roadmap).","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Soda","Tool/Product/Project":"Soda","Reviewed":"2021-12-08","Scheduled for":"2021-12-09","URL":"https://github.com/sodadata","Category":"Developer Tools - Testing frameworks","Type":"Open Source","What is it?":"Observability & monitoring for data.","Len":"138","What we like":"Auto-suggests initial tests. Config and tests are code. Either run as a CLI with all analysis done locally, or as a Python library to programmatically test data. Configurable expected error rate before erroring. Works alongside Airflow, Dagster, or dbt to support scheduled tests. Open source - cloud service optional (alerts and reporting).","What we dislike":"Initial installation and setup varies in complexity depending on your datastore. No colorized output from the CLI. No other language SDKs.","Interview":"/interviews/soda-maarten-masschelein/","Sponsored":"TRUE"},{"Company/Org":"Olric","Tool/Product/Project":"Olric","Reviewed":"2021-12-08","Scheduled for":"2021-12-09","URL":"https://github.com/buraksezer/olric","Category":"Database - KV store","Type":"Open Source","What is it?":"Distributed in-memory k/v store.","Len":"91","What we like":"Easy to create a replicated (sync or async) in-memory cache across distributed nodes. Can be used as a client/server (language independent & horizontally scalable) or as an embedded Go library (lower latency). Supports topics and listeners for distributed event processing.","What we dislike":"No persistence. Binary protocol currently undocumented and Go is the only supported client.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"flatpickr","Tool/Product/Project":"flatpickr","Reviewed":"2021-12-08","Scheduled for":"2021-12-09","URL":"https://flatpickr.js.org/","Category":"Developer Tools - UI Builder","Type":"Open Source","What is it?":"JS datetime picker.","Len":"174","What we like":"Dependency free - lightweight total size. Everyone needs a datepicker eventually and the UX is always difficult to get right. Support for all major browsers going back to very old versions. Date, time, date range selection. Libraries for React, Vue, etc. Supports localization and themes, including a dark version.","What we dislike":"Browser built-in alternatives are improving quickly, which offer a more native experience with better accessibility, but not as good functionality. No release since Dec 2020.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"tealdeer","Tool/Product/Project":"tealdeer","Reviewed":"2021-12-01","Scheduled for":"2021-12-02","URL":"https://github.com/dbrgn/tealdeer","Category":"Misc - Terminal utilities","Type":"Open Source","What is it?":"CLI for simpler manpages.","Len":"96","What we like":"Makes terminal cheat sheets from tldr available offline (cached) with common examples for how to use the specified command. Colorized output uses your shell color preferences. Open source, cross platform and packages available for most systems.","What we dislike":"Latest release is >1 year ago which is missing many fixes and updates made to the project since.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Toxiproxy","Tool/Product/Project":"Toxiproxy","Reviewed":"2021-12-01","Scheduled for":"2021-12-02","URL":"https://github.com/shopify/toxiproxy","Category":"Developer Tools - Testing frameworks","Type":"Open Source","What is it?":"Simulate network chaos conditions.","Len":"165","What we like":"Designed to be invoked via client libraries so the test conditions can be deterministic and programmatically defined. Simulate latency, timeouts, peer resets and other weird network conditions. Can be configured to introduce randomness. Official clients for Ruby and Go (other community clients available)","What we dislike":"Requires connection through a client rather than dropping into the middle of the connection with no code changes (but this is what enables the programmatic testing).","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Archbee","Tool/Product/Project":"Archbee","Reviewed":"2021-12-01","Scheduled for":"2021-12-02","URL":"https://www.archbee.io/","Category":"Developer Tools - Documentation","Type":"SaaS","What is it?":"Developer docs editor.","Len":"161","What we like":"Markdown-based editor with custom dev-docs focused components e.g. diagrams, multi-language code blocks, GraphQL / OpenAPI endpoint blocks, changelogs. Build internal or public docs. Publish multiple doc versions e.g. for different API versions.","What we dislike":"No real-time collaboration - edits by others overwrite your changes. Sync to GitHub allows Markdown source to live in the repo, but editing is much more limited.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Mergify","Tool/Product/Project":"Mergify","Reviewed":"2021-11-24","Scheduled for":"2021-11-25","URL":"https://mergify.com/?utm_source=consoledev&utm_medium=newsletter&utm_campaign=november21","Category":"Developer Tools - Git tools","Type":"SaaS","What is it?":"Pull request automation.","Len":"67","What we like":"Define rules and automations in code based on conditions for approvals, assignment, merges, rebasing, reviews, queueing and prioritization. Can examine attributes like task list status, PR dependencies, Dependabot, Snyk and other tool integrations. Engine is open source.","What we dislike":"GitHub only. Specifying PR dependencies does not work across repos.","Interview":"/interviews/mergify-julien-danjou/","Sponsored":"TRUE"},{"Company/Org":"Runno","Tool/Product/Project":"Runno","Reviewed":"2021-11-24","Scheduled for":"2021-11-25","URL":"https://runno.dev/","Category":"Misc - Language","Type":"Open Source","What is it?":"Browser executable code samples.","Len":"143","What we like":"Code samples can run locally in the browser (using WebAssembly). Can be embedded into a web page using an iFrame or web component. Enable editor to allow the user to modify and run the code. Sandboxed and runs in a terminal emulator.","What we dislike":"Limited by language runtimes available in WebAssembly Package Manager - Python, JS, SQL, C, C++. Best for simple code that uses stdin / stdout.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Vector","Tool/Product/Project":"Vector","Reviewed":"2021-11-24","Scheduled for":"2021-11-25","URL":"https://vector.dev/","Category":"DevOps - Observability","Type":"Open Source","What is it?":"High performance observability pipeline.","Len":"144","What we like":"Lots of plugins for sources e.g. AWS S3, Apache, StatsD, stdin; transforms e.g. aggregate, filter, log to metric; sinks e.g. Cloudwatch, Prometheus, Elasticsearch. Makes it easy to create a consistent pipeline even as sources and sinks change - no lockin. Can run as a single agent, sidecar or as an aggregator cluster for more throughput. Open source.\n","What we dislike":"Transforms performed using the custom Vector Remap Language, which is another syntax to learn (but does compile to Rust = safety + performance).","Interview":"","Sponsored":"FALSE"},{"Company/Org":"PackageCloud","Tool/Product/Project":"PackageCloud","Reviewed":"2021-11-17","Scheduled for":"2021-11-18","URL":"https://packagecloud.io/","Category":"Developer Tools - Package Managers","Type":"SaaS","What is it?":"Hosted package repository service.","Len":"167","What we like":"Manage your packages across all repos from a single service (RPM, Deb, RubyGem, PyPI, NPM). Web UI or CLI to push new packages. Create private repos for internal packages. Auto-generates install scripts for users. Integration with CI to easily push packages on build.","What we dislike":"Quick installer instructions and package inspection (view files, dependencies, etc) not available for all package types. Would like to see support for container repos.","Interview":"/interviews/packagecloud-donnie-hasseltine/","Sponsored":"TRUE"},{"Company/Org":"Bramble","Tool/Product/Project":"Bramble","Reviewed":"2021-11-17","Scheduled for":"2021-11-18","URL":"https://github.com/maxmcd/bramble","Category":"Developer Tools - Package Managers","Type":"Open Source","What is it?":"Functional build system and package manager.","Len":"189","What we like":"Project-based and sandboxed, which makes it safer to use it to try third-party projects. Config is code (Starlark) - no arbitrary flags, env vars, etc, so the result is much more predictable. Inputs/outputs are content addressed, hashed and cached (or built from source) which then makes them reproducible.","What we dislike":"Currently a proof of concept, only works on Linux (macOS soon). Defining the full dependency tree can be tedious, but that is the whole point of sandboxing and ensuring reproducible builds.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"ct.css","Tool/Product/Project":"ct.css","Reviewed":"2021-11-17","Scheduled for":"2021-11-18","URL":"https://github.com/csswizardry/ct","Category":"Developer Tools - Testing frameworks","Type":"Other","What is it?":"Highlight problems in <head>","Len":"151","What we like":"Quickly show possible performance problems in your HTML <head> such as blocking JS, redundant calls, third-party stylesheets. Either drop in a CSS stylesheet or run the JS snippet for any page using browser devtools.","What we dislike":"Prone to some false positives, e.g. non-blocking non-print stylesheets, injected JS, whether the third-party JS is truly non-blocking. Unknown license.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"CloudGraph","Tool/Product/Project":"CloudGraph","Reviewed":"2021-11-10","Scheduled for":"2021-11-11","URL":"https://github.com/cloudgraphdev/cli","Category":"API - API","Type":"Open Source","What is it?":"GraphQL API for your cloud resources.","Len":"106","What we like":"Use GraphQL to query resources. Queries run against a cached database which you can scale yourself, avoiding AWS limits. Consistent interface across products - avoid complex JOINs. Query historical state because data is versioned. Bundled UI with autocompletion and schema explorer.","What we dislike":"Currently only supports AWS. Deployment is currently manual (or via Docker). Docs are still quite limited.","Interview":"/interviews/cloudgraph-tyson-kunovsky/","Sponsored":"TRUE"},{"Company/Org":"sysz","Tool/Product/Project":"sysz","Reviewed":"2021-11-10","Scheduled for":"2021-11-11","URL":"https://github.com/joehillen/sysz","Category":"Misc - Terminal utilities","Type":"Open Source","What is it?":"Search TUI for systemctl.","Len":"127","What we like":"Quickly search and filter system and user units. State view shows service metadata plus recent logs. Shortcuts for filtering by state and reloading. Prompts to run relevant commands.","What we dislike":"Requires fzf, which must be installed manually. Assumes you know what you’re doing, but since it’s Linux-only, you probably do.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Edamagit","Tool/Product/Project":"Edamagit","Reviewed":"2021-11-10","Scheduled for":"2021-11-11","URL":"https://github.com/kahole/edamagit","Category":"Developer Tools - Git tools","Type":"Open Source","What is it?":"Magit (better Git) for VSCode.","Len":"137","What we like":"Significantly speed up common git tasks with shortcuts. Improved version control view with show/hide diff, easily stage individual files or multi-select changes. Stage chunks of changes. Forge mode provides extra context from GitHub e.g. issues, PRs.","What we dislike":"Forge mode slows down status view initial load. Doesn’t yet support the more advanced features from Magit (advanced diff, bisect, patch).","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Plow","Tool/Product/Project":"Plow","Reviewed":"2021-11-03","Scheduled for":"2021-11-04","URL":"https://github.com/six-ddc/plow","Category":"Developer Tools - Benchmarking / Load testing","Type":"Open Source","What is it?":"High-performance HTTP benchmarking.","Len":"71","What we like":"Displays real-time stats as tests are executed, both on the CLI and via a web UI. Reports latency, req/s, errors, read/writes. Includes latency histogram and percentiles. Supports all HTTP verbs including reading in POST data from a file. Dockerfile provided.","What we dislike":"Histogram charts disappear and web UI stops serving on test completion.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"SQLime","Tool/Product/Project":"SQLime","Reviewed":"2021-11-03","Scheduled for":"2021-11-04","URL":"https://sqlime.org/","Category":"Database - Relational database","Type":"Open Source","What is it?":"SQLite browser playground.","Len":"69","What we like":"Runs a full version of SQLite entirely in the browser. Can load DB files from a URL or a file. Can optionally sync with GitHub to save data and queries in plain text. Easy to share via a link. There is no server. Open source.","What we dislike":"No code completion. No error handling UI (check the browser console).","Interview":"","Sponsored":"FALSE"},{"Company/Org":"werf","Tool/Product/Project":"werf","Reviewed":"2021-11-03","Scheduled for":"2021-11-04","URL":"https://werf.io/","Category":"DevOps - CI/CD","Type":"Open Source","What is it?":"Git CLI for consistent delivery & deployment.","Len":"134","What we like":"Implements automated delivery from Git to k8s. “giterminism” concept provides reproducibility without external config dependencies - everything is based on the git repo. Handles Docker image builds, k8s rollout and cleanup. Can be embedded in existing CI/CD pipelines. Generates and manages Helm templates.","What we dislike":"Needs expanded guides for languages - basics are covered but missing more detailed real-world examples. Assumes you’re running on k8s.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"FireHydrant","Tool/Product/Project":"FireHydrant","Reviewed":"2021-10-27","Scheduled for":"2021-10-28","URL":"https://firehydrant.io/","Category":"DevOps - Infrastructure automation","Type":"SaaS","What is it?":"Incident response automation.","Len":"109","What we like":"Automate tedious incident handling workflows e.g. create new Slack room, status page update, create Zoom bridge. Inventory catalog assigns teams and aggregates useful tools (e.g. PagerDuty on call, Datadog dashboard, last GitHub event) for quick lookup during incidents. Auto-generate timelines based on chat logs, events, actions to make retrospectives easier.","What we dislike":"Small number of integrations e.g. assumes using Slack for chat, JIRA for tickets, Zoom/Meet for conferencing.","Interview":"/interviews/firehydrant-robert-ross/","Sponsored":"TRUE"},{"Company/Org":"OpenReplay","Tool/Product/Project":"OpenReplay","Reviewed":"2021-10-27","Scheduled for":"2021-10-28","URL":"https://openreplay.com/","Category":"DevOps - Error logging","Type":"Open Source","What is it?":"Open source session replay debugging.","Len":"212","What we like":"Record and debug user sessions with full devtool capture (JS errors, network, perf, state). Sanitize data before it is captured through generic global rules or HTML attributes. Can un-minify JS with source maps. Plugins to capture API requests e.g. GraphQL and correlate with backend monitoring (Datadog, New Relic, Cloudwatch, etc).","What we dislike":"Limited documentation for scalability and reliability - you must manage multiple components e.g. Redis, PostgreSQL (a fully managed cloud version is available). Data exporter only available in enterprise version.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"git-bug","Tool/Product/Project":"git-bug","Reviewed":"2021-10-27","Scheduled for":"2021-10-28","URL":"https://github.com/MichaelMure/git-bug","Category":"Developer Tools - Git tools","Type":"Open Source","What is it?":"Bug tracker embedded in your git repo.","Len":"127","What we like":"Work from a CLI, interactive TUI or web UI. Doesn’t pollute your repo (everything lives in .git) and interactions are like normal Git (add, push, pull, etc). Issues can live alongside the code repo they belong to. Can bridge with GitHub, GitLab and JIRA so you can use git-bug and others can stick with a centralized server.","What we dislike":"Web UI is currently read-only. Does not support media file attachments. Not a stable release yet, but still worth playing with.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"immudb","Tool/Product/Project":"immudb","Reviewed":"2021-10-20","Scheduled for":"2021-10-21","URL":"https://github.com/codenotary/immudb","Category":"Database - Relational database","Type":"Open Source","What is it?":"Open source immutable database.","Len":"100","What we like":"Can be used as a database server or as a library. Acts as a k/v store or can be queried using SQL. Storage agnostic - can even be S3. Built-in Prometheus endpoint. Can disable synchronous indexing to increase performance. Supports PostgreSQL wire protocol. Interesting use case as a secondary database for cryptographic verification of the primary.","What we dislike":"Only Go SDK is fully developed - others still in progress. No replication or hot backup support yet.","Interview":"/interviews/immudb-jeronimo-irazabal/","Sponsored":"TRUE"},{"Company/Org":"gron","Tool/Product/Project":"gron","Reviewed":"2021-10-20","Scheduled for":"2021-10-21","URL":"https://github.com/tomnomnom/gron","Category":"Misc - Terminal utilities","Type":"Open Source","What is it?":"Makes JSON greppable.\n","Len":"159","What we like":"Supports input from a file, URL or stdin so it can be piped to grep and properly searched. Allows the full path to be revealed. Colorizes output. Easily diff sets of JSON. ungron reverses the conversion, so you can pipe grep results back to JSON. Cross-platform binaries available for Windows, Linux and Mac.","What we dislike":"You could just use jq which has more features, but it assumes you know more about your JSON data structure. gron is deliberately simple and grep is well known.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"git-branchless","Tool/Product/Project":"git-branchless","Reviewed":"2021-10-20","Scheduled for":"2021-10-21","URL":"https://github.com/arxanas/git-branchless","Category":"Developer Tools - Git tools","Type":"Open Source","What is it?":"Git tools for repo visualization and navigation.","Len":"113","What we like":"Allows you to move between stacks of commits without using branches. `git move` is implemented in-memory so is faster than `git rebase`, which works on-disk. Interactive `git undo` command helps fix commits, merges, rebases, checkouts and branches. Smartlog command visualizes work without branches (unlike `git log --graph`).","What we dislike":"No release binaries - must be installed (and compiled) with Rust’s cargo. Not designed to handle untracked files.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"LambdaTest","Tool/Product/Project":"LambdaTest","Reviewed":"2021-10-13","Scheduled for":"2021-10-14","URL":"https://www.lambdatest.com/","Category":"Developer Tools - Browser testing","Type":"SaaS","What is it?":"Cross browser testing platform.","Len":"112","What we like":"Lots of desktop and mobile browser versions, including very old devices and new betas. Can write tests in open source Selenium or Cypress frameworks. Tests can be automatically compared against previous runs. Integrates into CI/CD to detect regressions. Geotarget features can test localization e.g. currencies, time zone changes etc.","What we dislike":"Mobile tests are executed on emulators (real device support currently in beta). No support for testing on Linux.","Interview":"/interviews/lambdatest-mayank-bhola/","Sponsored":"TRUE"},{"Company/Org":"Delta","Tool/Product/Project":"Delta","Reviewed":"2021-10-13","Scheduled for":"2021-10-14","URL":"https://github.com/dandavison/delta","Category":"Developer Tools - Git tools","Type":"Open Source","What is it?":"CLI for (git) code diffs.","Len":"96","What we like":"Displays line numbers. Side by side view. Can be used independently from the terminal, but configured through git means it supports all git features outputting code. Highly configurable theming and output options e.g. colors, line number styles. Cross platform and OS packages for multiple systems.","What we dislike":"Colorized output does not follow the current terminal theme - must be independently configured. ","Interview":"","Sponsored":"FALSE"},{"Company/Org":"exo","Tool/Product/Project":"exo","Reviewed":"2021-10-06","Scheduled for":"2021-10-07","URL":"https://exo.deref.io/","Category":"Developer Tools - Local development","Type":"Open Source","What is it?":"Process and log manager for dev.","Len":"167","What we like":"Runs the commands from your Procfile or Docker Compose config e.g. running separate commands to launch your project’s UI and API. Aggregates logs into a single, colorized terminal output. Local web GUI allows log toggle, search & filtering, manage spawned processes and other resources e.g. Docker storage. CLI can control processes, query logs and daemonize.","What we dislike":"Weird, custom open source license. Web docs could do with expanding - CLI has a useful builtin help command though. No OS packages - binaries for Linux and macOS only.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Unleash","Tool/Product/Project":"Unleash","Reviewed":"2021-10-06","Scheduled for":"2021-10-07","URL":"https://www.getunleash.io/","Category":"Developer Tools - Testing frameworks","Type":"Open Source","What is it?":"Open source feature flags.","Len":"125","What we like":"Local evaluation of feature toggles avoids network latency. SDKs for all major languages. Proxy module means it can work even for single page apps. Support for gradual rollout and user segmentation strategies e.g. by user profile fields. Tech debt dashboard tracks use of feature flags and warns if they are unused.","What we dislike":"Unclear how to deploy in a high availability configuration. Limited usage stats (evaluations over the last minute and hour).\n","Interview":"","Sponsored":"FALSE"},{"Company/Org":"CodeSee","Tool/Product/Project":"CodeSee Maps","Reviewed":"2021-09-29","Scheduled for":"2021-09-30","URL":"https://www.codesee.io/","Category":"Developer Tools - Documentation","Type":"SaaS","What is it?":"Code maps as documentation.","Len":"102","What we like":"Highlights dependencies and related code structure. Code maps auto-update with each commit - map diffs posted into GitHub PRs. Can build step-by-step tours for onboarding new devs into the codebase. Auto heat maps by latest activity, creation date or commit count.","What we dislike":"Requires GitHub. Currently only supports dependency resolution for 4 languages (Python, JS, Java, Go).","Interview":"/interviews/codesee-shanea-leven/","Sponsored":"TRUE"},{"Company/Org":"procs","Tool/Product/Project":"procs","Reviewed":"2021-09-29","Scheduled for":"2021-09-30","URL":"https://github.com/dalance/procs","Category":"Misc - Terminal utilities","Type":"Open Source","What is it?":"Process status viewer; replacement for ps.","Len":"116","What we like":"Uses terminal theme colors. Layout makes it easy to read. Tree option shows parent and child processes. Can look into Docker to reveal container name & commands. Watch mode like top. Columns can be configured at run time or in a config file. Can show ports processes are listening on. Cross-platform support.","What we dislike":"macOS and Windows support is experimental (worked fine in our tests). No pager on Windows. Search is case sensitive.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"zoxide","Tool/Product/Project":"zoxide","Reviewed":"2021-09-21","Scheduled for":"2021-09-23","URL":"https://github.com/ajeetdsouza/zoxide","Category":"Misc - Terminal utilities","Type":"Open Source","What is it?":"Smarter cd for your terminal.","Len":"154","What we like":"Ranking algorithm means it usually guesses which path you mean so you can navigate common long paths without typing them all out. Multi-platform options for installing. Includes an fzf-powered interactive mode. Integrations available for Emacs, Ranger, Neovim. Zsh autocomplete available.","What we dislike":"Years of muscle memory using cd means you probably want to alias it to zoxide. Renamed paths can confuse the history - need to edit the DB to update them.","Interview":"","Sponsored":"FALSE"}],"header":["Company/Org","Tool/Product/Project","Reviewed","Scheduled for","URL","Category","Type","What is it?","Len","What we like","Len","What we dislike","Len","Interview","Sponsored"],"range":"'All Tools'!A1:O86"}}]}
