{
    "results": [
        {
            "command": {
                "func": "getData",
                "kwargs": [
                    {
                        "range": "'All Tools'!A:N",
                        "hasHeaderRow": true
                    },
                    null
                ]
            },
            "result": {
                "rawData": [
                    [
                        "Snyk",
                        "Snyk Open Source",
                        "2021-08-05",
                        "2021-08-05",
                        "https://snyk.io/product/open-source-security-management/?utm_medium=Organic-Email&utm_source=consoledev&utm_content=snyk-open-source",
                        "Security - Vulnerability management",
                        "SaaS",
                        "Dependency security monitoring for open source.",
                        "47",
                        "Easy to see security status for everything. Scans full dependency tree revealing your actual security posture e.g. vulns in dependency dependencies. Relative severity scoring helps understand how relevant issues are. Inspects containers & OS packages as well as code. Separates dev dependencies from prod. Multiple options for fixes e.g. via CLI, not just PRs.",
                        "360",
                        "Showing vulnerabilities in dependency dependencies is interesting, but what are you going to do about them? CLI to apply fixes still in beta (Python only).",
                        "155",
                        ""
                    ],
                    [
                        "OSSF",
                        "Security Scorecard",
                        "2021-08-05",
                        "2021-08-05",
                        "https://github.com/ossf/scorecard",
                        "Security - Vulnerability management",
                        "Open Source",
                        "Security health metrics for open source.",
                        "40",
                        "Assessment criteria are objective, consistent and documented so OSS projects can start to adopt them. Makes it easy to assess the security posture of the projects you rely on. CLI output is clear why a check fails. Can scan a GitHub repo or infer it from npm, pypi or rubygem package names. JSON or CSV output means results can be scripted.",
                        "340",
                        "Some assessment criteria (such as looking for commits from >1 GitHub organizations) may be onerous for small, one-person projects. No easy way to integrate into CI/CD yet (on the roadmap).",
                        "188",
                        ""
                    ],
                    [
                        "Liveblocks",
                        "Liveblocks",
                        "2021-07-16",
                        "2021-07-29",
                        "https://liveblocks.io/",
                        "Developer Tools - Frontend framework",
                        "SaaS",
                        "Real-time collaboration API.",
                        "28",
                        "Components to easily add live presence (live cursors, chat and reactions). Abstracts away the backend implementation challenges - networking, performance, presence detection, multi-browser support. Vendored as React / Node packages. Auth hooks to validate user permissions. Examples for raw JS, Next.js, Nuxt.js and React + Firebase.",
                        "333",
                        "Assumes you’re building with web technologies i.e. JS. No mobile support. Still requires implementing authentication. Classic build vs buy - is it a good use of your time to try and build this?",
                        "193",
                        "/interviews/liveblocks-guillaume-salles/"
                    ],
                    [
                        "Livekit",
                        "Livekit",
                        "2021-07-19",
                        "2021-07-29",
                        "https://livekit.io/",
                        "API - Communication",
                        "Open Source",
                        "Open source live video and audio API.",
                        "37",
                        "SDKs for React, JS, iOS and Android to build video / audio without needing to understand WebRTC. Selective Forwarding Unit server makes it easy to scale from P2P to supporting large numbers of participants. Server scales horizontally using Redis as the backend. Automatically supports different connection types (UDP, TCP, TURN) and simulcasting.",
                        "346",
                        "Still need to set up SSL + load balancers. Using a server component defeats the idea of P2P. Your code still needs to deal with issuing access tokens to each participant. Simulcasting only works in the browser/JS SDK.",
                        "217",
                        ""
                    ],
                    [
                        "Polypane",
                        "Polypane",
                        "2021-06-18",
                        "2021-07-22",
                        "https://polypane.app/",
                        "Developer Tools - Browser testing",
                        "Desktop",
                        "Browser testing tool.",
                        "21",
                        "Multiple browser panes side-by-side to test various sizes. Inspect element works across panes simultaneously. Scroll sync helps comparison. Built on Chrome so devtools available. Shows Web Vitals scores. Can trigger media features e.g. prefers-color-scheme, reduced-motion. Debug tools like a11y, CSS injection, disable images, mobile reachability.",
                        "348",
                        "Signup/license key process is a bit fiddly. Quite CPU intensive. You need a very big screen to see all the windows properly.",
                        "124",
                        ""
                    ],
                    [
                        "automerge",
                        "automerge",
                        "2021-06-12",
                        "2021-07-22",
                        "https://github.com/automerge/automerge",
                        "Developer Tools - Backend framework",
                        "Open Source",
                        "Conflict-free JSON-like data structure.",
                        "39",
                        "Built for JS applications to allow read/write to properties whilst avoiding conflicts. Maintains a history of all changes. Network-agnostic but includes a sync protocol for send/receive messages. Custom types for conflict free counters, collaborative text editing and tables. Follows the idea of functional reactive programming.",
                        "328",
                        "Documents are not actually immutable by default - you just code as if they are. Enforcing this can be turned on but has a major performance hit. Implementation is only in JS but versions in Rust, Swift, Python in various stages of development.\n",
                        "244",
                        ""
                    ],
                    [
                        "Tuple",
                        "Tuple",
                        "2021-06-22",
                        "2021-07-15",
                        "https://tuple.app",
                        "Developer Tools - Code collaboration",
                        "Desktop",
                        "Screen sharing optimized for developers.",
                        "40",
                        "Quick start a P2P encrypted call + screen sharing session. Quality settings go up to 5k to make code crisp and easy to read, unlike generic conferencing services. Easy to take control to type, send through keyboard shortcuts, highlight areas of the screen. Live call debug info to see any connection problems. The “ship it” stamp effect is fun.",
                        "344",
                        "Really needs a high quality connection otherwise you can’t reach the higher resolutions and the mouse/keyboard sharing is laggy. macOS only - Linux client on the roadmap for 2021.",
                        "179",
                        "/interviews/tuple-ben-orenstein/"
                    ],
                    [
                        "GitHub",
                        "GitHub Copilot",
                        "2021-07-08",
                        "2021-07-15",
                        "https://copilot.github.com/",
                        "Developer Tools - IDE",
                        "SaaS",
                        "AI pair programming for VS Code.",
                        "32",
                        "Autocomplete is accurate - speeds up work on a line-by-line basis, just like GMail/Google Docs. Understands file context - imports, variable names, etc. Using comments to describe what you want to do then reviewing suggestions is like doing a web search. Time saver for simple, common, but annoying tasks e.g. regexes, test skeletons.",
                        "334",
                        "Not clear if it’s thinking or not - sometimes you wait for nothing to happen. Licensing questions remain unanswered - is the code a derivative of copyrighted material? Doesn’t understand project context.",
                        "203",
                        ""
                    ],
                    [
                        "Hashicorp",
                        "Waypoint",
                        "2021-06-16",
                        "2021-07-08",
                        "https://www.waypointproject.io/",
                        "DevOps - CI/CD",
                        "Open Source",
                        "Build, deploy, and release across platforms.",
                        "44",
                        "Single command to get your code into production. Can track Git repos to auto-deploy. Integrates with AWS, Azure, Google to upload artifacts, configure LBs, DNS, env vars, etc. Stream logs and execute remote commands. Preview URLs for staging. Web dashboard summarizes deploy status. Extensible hooks via plugins.",
                        "312",
                        "Assumes your app is containerized. Need to run / maintain your own Waypoint server - still early so not entirely prod-ready. Preview URLs are public so you must set up authorization or disable them (self-hosting URL service is an option, but complex).",
                        "251",
                        ""
                    ],
                    [
                        "Zellij",
                        "Zellij",
                        "2021-06-14",
                        "2021-07-08",
                        "https://zellij.dev/",
                        "Misc - Terminal emulators",
                        "Open Source",
                        "Terminal workspace manager (tabs + multiplexing).",
                        "49",
                        "Built-in tabs, panes, sessions, resizing, scrollback. Shows (customizable) keybindings to help discovery. “New pane” algorithmically placed in the most optimized position (or use manual splits). Can configure layouts in yaml then auto start them. Single compiled binary. Has a built-in file manager (a clone of ranger). WASM-based plugin system.",
                        "345",
                        "Colors not inherited from existing shell config. Docs are still very limited. Some core shortcuts used by other tools e.g. Ctrl + r in bash (use Zellij lock mode to pass these through). Slightly laggy over remote connections (compared to tmux).",
                        "244",
                        ""
                    ],
                    [
                        "Prestige",
                        "Prestige",
                        "2021-06-17",
                        "2021-07-01",
                        "https://prestigemad.com/",
                        "Developer Tools - API Client",
                        "Open Source",
                        "Browser- and text-based HTTP client.",
                        "36",
                        "Really simple way to execute HTTP commands but can also send more complex requests e.g. headers, file uploads, cookies, JSON. Can write commands in plain text, JS, or define variables in templates. Prettified and syntax-highlighted response parsing. Can save to local browser storage (GitHub and others on roadmap). Open source codebase.",
                        "337",
                        "Requests run through a proxy rather than your browser (due to CORS), but localhost URLs are routed directly. No support for OAuth APIs.",
                        "135",
                        ""
                    ],
                    [
                        "chezmoi",
                        "chezmoi",
                        "2021-06-17",
                        "2021-07-01",
                        "https://www.chezmoi.io/",
                        "Misc - Terminal utilities",
                        "Open Source",
                        "dotfile manager.",
                        "16",
                        "Single compiled binary. No bootstrap requirements - supports many platforms. Can query password manager for secrets and supports encrypted files. Configs can be templated for differences across environments. Can run scripts, including run-once (ideal for cloud IDEs or ephemeral environments). File edit flow similar to git (which is used for versioning).",
                        "355",
                        "You can edit files directly but using the edit flow ensures changes/conflicts are handled properly, which may require retraining muscle memory. Doesn’t handle git subdirectories e.g. Oh My Zsh particularly well (better to use a script to install outside of chezmoi).",
                        "266",
                        ""
                    ],
                    [
                        "IPInfo",
                        "IPInfo",
                        "2021-06-07",
                        "2021-06-24",
                        "https://ipinfo.io",
                        "API - API",
                        "SaaS",
                        "CLI for IP address metadata lookup.",
                        "35",
                        "Lookup IP details such as ASN, location, hostname, abuse contact, tor/VPN/hosting IP categorization. Cross-platform binaries. Colored output. Bulk summarize IPs from a file (or piped in). Bash, zsh, fish auto-completion. SDKs available for major languages.",
                        "256",
                        "Responses not cached. Available via Homebrew on Mac but not Linux or Windows package managers. No man pages.",
                        "108",
                        ""
                    ],
                    [
                        "gitui",
                        "gitui",
                        "2021-06-02",
                        "2021-06-24",
                        "https://github.com/extrawurst/gitui",
                        "Developer Tools - Git tools",
                        "Open Source",
                        "Fast git TUI.",
                        "13",
                        "Focus on high-performance repo parsing using async means the UI is responsive, low memory and low CPU even for the largest of repos. Keyboard control of common tasks e.g. stash, stage, diff review and commit with keybindings highlighted for newer users (or when you forget). Adopts terminal color scheme. Cross-platform packages (Arch, Fedora, Homebrew, Chocolatey, Nix).",
                        "371",
                        "No log search or file history log and does not yet support bare repos (all on the roadmap).",
                        "91",
                        ""
                    ],
                    [
                        "GitLive",
                        "GitLive",
                        "2021-06-02",
                        "2021-06-17",
                        "https://git.live",
                        "Developer Tools - Code collaboration",
                        "Desktop",
                        "Live Git diffs for uncommitted changes.",
                        "39",
                        "Real-time change indicators show where others have made changes to files but not yet committed. Preview live diffs and get warnings about conflicts from other collaborators. Privacy option to stop sharing when required. Built-in video calls and codesharing which works across IDEs - VS Code, JetBrains, Android Studio.",
                        "318",
                        "Requires everyone to use GitLive and one of the supported editors. Uploads code diffs (not the full source) to GitLive servers while changes are uncommitted, deleted once pushed.",
                        "178",
                        "/interviews/gitlive-nick-bransby-williams/"
                    ],
                    [
                        "Runops",
                        "Runops",
                        "2021-06-14",
                        "2021-06-17",
                        "https://runops.io/",
                        "DevOps - Infrastructure automation",
                        "SaaS",
                        "Control access to run commands in production.",
                        "45",
                        "Terminal-based signup/demo. Template / version control production commands - scripts, databases, containers, cloud consoles. CLI or Slack Bot to trigger them without direct prod access. Auth/approval flows before commands execute. Optional self-hosted runner with secrets stored in your own secrets storage. Auto-redaction of sensitive logs. Bastion SSH support.",
                        "362",
                        "Cloud version requires public access to resources e.g. database connection URL, and doesn’t support IP allowlists - self-hosted runner allows private network access. Reliant on Slack for approvals, team management, etc.",
                        "219",
                        ""
                    ],
                    [
                        "Filippo Valsorda",
                        "mkcert",
                        "2021-06-04",
                        "2021-06-10",
                        "https://github.com/FiloSottile/mkcert",
                        "Developer Tools - Local development",
                        "Open Source",
                        "CLI for managing local dev certificates.",
                        "40",
                        "Solves the hassle of configuring SSL for local dev endpoints by configuring and managing a root CA. Means you don’t need to leave testing SSL to staging (or prod!) or store real certs locally. Allows you to generate certs for localhost. Cross platform + support for browser specific root stores.",
                        "295",
                        "You still need to configure your server to use the certs. GitHub binaries built with a slightly older version of Go (1.13) so no Apple Silicon support - use the homebrew version which does have Apple Silicon binaries.",
                        "217",
                        ""
                    ],
                    [
                        "Openbase",
                        "Openbase",
                        "2021-06-03",
                        "2021-06-10",
                        "https://openbase.com",
                        "Developer Tools - Dependency management",
                        "SaaS",
                        "Database of open source packages.",
                        "33",
                        "Packages ranked based on various criteria such as documentation, performance, popularity. Categories for common use cases to help find most used packages. Analyze dependencies and project activity e.g. release cadence, commit frequency.",
                        "236",
                        "Only supports searching JS packages - leaderboards available for Python, Rust, Go, Swift and Java libraries. Some criteria are more subjective than others e.g. are frequent commits good or bad?",
                        "193",
                        ""
                    ],
                    [
                        "gitmoji-cli",
                        "gitmoji-cli",
                        "2021-05-20",
                        "2021-06-03",
                        "https://github.com/carloscuesta/gitmoji-cli",
                        "Developer Tools - Git tools",
                        "Open Source",
                        "CLI to add Gitmoji to commits.",
                        "30",
                        "gitmoji helps identify commits at a glance. CLI sets up a Git commit hook to trigger the interactive CLI to pick a gitmoji for the commit. Text search to find right emoji based on commit purpose. Can be configured to use Conventional Commits scopes.",
                        "249",
                        "By default only renders on GitHub, but you can configure it to use actual emoji characters. Some may consider this polluting the git log, especially if you write your commits properly and use git shortlog in your release notes.",
                        "227",
                        ""
                    ],
                    [
                        "Xonsh",
                        "Xonsh",
                        "2021-03-26",
                        "2021-06-03",
                        "https://xon.sh/",
                        "Developer Tools - Shells",
                        "Open Source",
                        "Python-powered shell.",
                        "21",
                        "Can do arithmetic, import modules, use data types, loops, etc, because everything it receives is interpreted with Python. Tab completion based on man-pages. Community extensions e.g. Powerline, written in Python. Cross-platform.",
                        "228",
                        "Small community of extensions. Not bash compatible, so you have to relearn some syntax. Incompatible with Python virtual environments (has its own replacement called vox).",
                        "171",
                        ""
                    ],
                    [
                        "Big Sky Software",
                        "htmx",
                        "2021-04-27",
                        "2021-05-27",
                        "https://htmx.org",
                        "Developer Tools - Frontend framework",
                        "Open Source",
                        "HTML attribute-based frontend framework.",
                        "40",
                        "Access AJAX, CSS Transitions, WebSockets and SSEs directly in HTML. Any HTML element can issue AJAX requests. Implements the principle of  “locality of behavior” so it’s easier to understand what code is doing. Small (10k min gz), no dependencies.",
                        "247",
                        "Injecting remote responses is a potential security issue: JS can still be executed even with a restrictive CSP, and user-generated content must be escaped. Execution must be denied within specific areas of the DOM. Violates separation of concerns principle.\n",
                        "258",
                        ""
                    ],
                    [
                        "Semgrep",
                        "Semgrep",
                        "2021-05-24",
                        "2021-05-27",
                        "https://semgrep.dev",
                        "Developer Tools - Testing frameworks",
                        "Open Source",
                        "Static analysis tool.",
                        "21",
                        "Open source, runs locally and/or in CI/CD. No DSL - write rules in the language you use and alongside the code they check. Plugins for as-you-code analysis in Vim, VS Code, IntelliJ. Lots of community rules for common languages and frameworks (Django, Flask, Java, Rails). Integrates with CI and can add comments to PRs. Cloud web UI is optional.",
                        "346",
                        "Experimental support for C, Rust, PHP, Lua, C#, Kotlin. No Windows support.",
                        "75",
                        ""
                    ],
                    [
                        "QuestDB",
                        "QuestDB",
                        "2021-05-13",
                        "2021-05-20",
                        "https://questdb.io",
                        "Database - Time series database",
                        "Open Source",
                        "Timeseries database with SQL.",
                        "29",
                        "InfluxDB-compatible ingestion. Postgres-compatible wire API (allows querying with Grafana). Handles out of order inserts in a configurable way even though it uses an append column-based storage model. Official Docker image and Helm chart for dev/prod deploys. ANSI SQL with additional time functions. No GC.",
                        "307",
                        "No built-in replication/clustering. Partitioning is only supported by timestamp (day, month, year) which means you tradeoff easier retention policies and faster calculations/seek times with the potential for hotspots if reads are mostly on recent data.",
                        "252",
                        "/interviews/questdb-vlad-ilyushchenko/"
                    ],
                    [
                        "atuin",
                        "atuin",
                        "2021-05-10",
                        "2021-05-20",
                        "https://github.com/ellie/atuin",
                        "Misc - Terminal utilities",
                        "Open Source",
                        "Shell history search/sync with SQLite.",
                        "38",
                        "Search shell history with CLI or interactive TUI (ctrl+r). Query by date, current directory, string terms. Encrypted sync across machines with log of exit code, session, command. Fun stats e.g. “most used command”. Option to run your own sync server.",
                        "250",
                        "Can’t delete entries from history. Default rebind on up-key takes some getting used to, or disable it in config. Only supports zsh and bash.",
                        "140",
                        "/interviews/atuin-ellie-huxtable/"
                    ],
                    [
                        "Deepnote",
                        "Deepnote",
                        "2021-05-08",
                        "2021-05-13",
                        "https://deepnote.com",
                        "Data Science - Collaboration",
                        "SaaS",
                        "Collaborative Jupyter notebooks.",
                        "32",
                        "Google Docs-style real-time sharing / editing. Detects dependencies, prompts for pip install and updates requirements.txt. Running the Jupyter environment in the cloud saves hassle installing kernels locally. Integrates with git. Public links. Supports Python & R.",
                        "264",
                        "Visualizations are custom HTML embeds when exported to Jupyter notebook format - better to embed something like Plotly in code to ensure portability.",
                        "149",
                        "/interviews/deepnote-jan-matas/"
                    ],
                    [
                        "Skruv",
                        "Skruv",
                        "2021-04-08",
                        "2021-05-13",
                        "https://skruv.io/",
                        "Developer Tools - Frontend framework",
                        "Open Source",
                        "No-build, small JS framework.",
                        "29",
                        "No dependencies. No build step. Very small (~400 LoC vDOM, ~100 LoC state management, ~230 LoC HTML helpers). Works with async components. Web tutorial does a good job explaining how it works (built using itself).",
                        "213",
                        "No router. Great for very simple SPAs, but something like Mithril.js (or Vue. Or Svelte) probably needed for anything of significance (if you don’t mind the build step).",
                        "169",
                        ""
                    ],
                    [
                        "Hookdeck",
                        "Hookdeck",
                        "2021-04-30",
                        "2021-05-06",
                        "https://hookdeck.com",
                        "DevOps - API Management",
                        "SaaS",
                        "Inbound webhook store and forward proxy.",
                        "40",
                        "Saves building your own queuing system - acts as a proxy to store and forward webhooks. Set up throttling and retry rules. Mirror inbound webhooks to multiple destinations, including a local CLI for testing. Alerts on failures - allows you to search & retry failures so you don’t lose any data.",
                        "294",
                        "Assumes your webhook destinations are idempotent with “at least once” delivery. No support for signature verification - will forward all requests (you can configure schema filters), so you need to implement this yourself. No support for custom webhook URL domains.",
                        "264",
                        "/interviews/hookdeck-alex-bouchard/"
                    ],
                    [
                        "act",
                        "act",
                        "2021-03-24",
                        "2021-05-06",
                        "https://github.com/nektos/act",
                        "Developer Tools - Local development",
                        "Open Source",
                        "Run your GitHub Actions locally.",
                        "32",
                        "Local simulation of the GitHub Actions environment using Docker. Much faster than commit/push for testing changes. Supports environment variables and secrets. Can trigger specific events e.g. pull request, push, and jobs within workflows (including skipping steps).",
                        "265",
                        "Only supports Linux runners (host is multi-platform). Full Docker images are quite large (>20GB), but you can try slimmer images with fewer bundled tools.",
                        "154",
                        ""
                    ],
                    [
                        "fselect",
                        "fselect",
                        "2021-04-21",
                        "2021-04-29",
                        "https://github.com/jhspetersson/fselect",
                        "Misc - Terminal utilities",
                        "Open Source",
                        "Find files with SQL-like queries.",
                        "33",
                        "Packages for all platforms (+ Nix, AUR, musl). Uses relaxed SQL to support fields e.g. size, path; operators e.g. AND, gte, like; date queries e.g. created, modified; filename glob and regex. Can use .gitignore and search MP3, MIME and other file attributes. Output in CSV, JSON, HTML.",
                        "285",
                        "Requires the absolute path (~/path doesn’t work), or searches current working directory if no path provided. Be careful to use quotes if you use shell characters such as >",
                        "171",
                        ""
                    ],
                    [
                        "Gruntwork",
                        "git-xargs",
                        "2021-04-27",
                        "2021-04-29",
                        "https://github.com/gruntwork-io/git-xargs",
                        "Developer Tools - Git tools",
                        "Open Source",
                        "Execute commands across multiple git repos.",
                        "43",
                        "Write a script to make a change to a single Git repo, then apply that change across multiple (specified in a list, or entire GitHub Org). Executes in parallel. Can open GitHub PRs with changes. Lots of use cases for otherwise tedious work e.g. name changes, updating dependencies, mass config changes.",
                        "301",
                        "Only supports GitHub PRs, but can push remote branches. Releases only available as binaries, no packages (you can use go get). Sometimes scripting these things actually takes longer than doing it manually.",
                        "205",
                        ""
                    ],
                    [
                        "KeyDB",
                        "KeyDB",
                        "2021-03-08",
                        "2021-04-22",
                        "https://keydb.dev/",
                        "Database - KV store",
                        "Open Source",
                        "A multi-threaded high-performance fork of Redis.",
                        "48",
                        "Drop-in replacement for Redis. Claims x5 speed boost from multi-threading. Adds some extra features like backup to S3 and active replication. Potentially reduces operational complexity by shifting scaling to CPU cores and network throughput rather than requiring clustering.",
                        "274",
                        "Runs the normal Redis event loop on multiple threads which requires locking (low contention, but work ongoing to improve). Expects exclusive use of assigned CPU cores.",
                        "167",
                        "/interviews/keydb-john-sully/"
                    ],
                    [
                        "Ranga Vadhineni",
                        "Thunder Client",
                        "2021-04-06",
                        "2021-04-22",
                        "https://www.thunderclient.io/",
                        "Developer Tools - Local development",
                        "Desktop",
                        "An HTTP client for VS Code.",
                        "27",
                        "Easily build HTTP requests with custom params, auth (basic, bearer, OAuth), headers and body (text, JSON, XML, form, GraphQL). Parses and syntax highlights response, headers and cookies. Can create automated tests with conditions such as response time, status codes, headers, etc.",
                        "280",
                        "All local - no config sync or dynamic loading from config files, but configs can be exported and imported.",
                        "106",
                        ""
                    ],
                    [
                        "Retool",
                        "REST API Generator",
                        "2021-04-09",
                        "2021-04-15",
                        "https://retool.com/api-generator/",
                        "DevOps - API Management",
                        "SaaS",
                        "Build an API to develop against.",
                        "32",
                        "Create a read/write REST API to start building against before your backend is ready. Supports all HTTP verbs. Lots of default field types with sample data e.g. location, emails, avatars, credit cards.",
                        "200",
                        "Limited to 150 rows. Hosted by a third party, so don’t send anything sensitive. Deleted after 30 days of inactivity.",
                        "116",
                        ""
                    ],
                    [
                        "Nelson Elhage",
                        "llama",
                        "2021-04-13",
                        "2021-04-15",
                        "https://github.com/nelhage/llama",
                        "Cloud - Serverless",
                        "Open Source",
                        "CLI for parallelizing commands inside AWS Lambda.",
                        "49",
                        "Makes it easy to burst parallelizable commands into Lambda. Uses Go template language for managing input and output. Supports Docker wrappers to bootstrap environments. Includes a drop-in GCC/clang replacement for outsourcing compilation.",
                        "238",
                        "Lambda is CPU and memory constrained, and the network is a bottleneck, so use cases are constrained to where parallelization makes a big difference (or there is a benefit to freeing local resources).",
                        "199",
                        ""
                    ],
                    [
                        "Typesense",
                        "Typesense",
                        "2021-03-24",
                        "2021-04-08",
                        "https://typesense.org",
                        "Developer Tools - Site Search",
                        "Open Source",
                        "Fast, typo-tolerant search engine.",
                        "34",
                        "Single binary (C++) runs natively on Linux and macOS. Tunable ranking for relevancy score tie-breaks. Sort at query-time without additional indexes. Scoped API keys. InstantSearch.js adapter. REST API with clients for JS, PHP, Python, Ruby. Open source + cloud option.",
                        "268",
                        "Need to build your own index updater mechanism to process new data. API-only means you need to build your own UI/admin. Only supports Latin-based languages.",
                        "156",
                        "/interviews/typesense-jason-bosco/"
                    ],
                    [
                        "Svix",
                        "Svix",
                        "2021-04-05",
                        "2021-04-08",
                        "https://www.svix.com/",
                        "DevOps - API Management",
                        "SaaS",
                        "Webhook infrastructure as a service.",
                        "36",
                        "Offering webhooks is actually more complex than you'd expect. Diahook deals with signing requests, queueing, retries, reliability, auth, E2E encryption, rate limiting, logs and debugging.",
                        "187",
                        "You need to send your events to Diahook, which means you still need to ensure they get there (retries, debugging, etc).",
                        "119",
                        "/interviews/svix-tom-hacohen/"
                    ],
                    [
                        "Temporal",
                        "Temporal",
                        "2021-03-16",
                        "2021-04-01",
                        "https://temporal.io/",
                        "Developer Tools - Workflow management",
                        "Open Source",
                        "Framework for workflow orchestration.",
                        "37",
                        "Deals with the underlying infrastructure for reliable task execution: state management, retries, scaling, fault tolerance. Avoid building and running your own timers / queues - just write the function business logic. Open source server you can run yourself, or use their cloud option (in private beta).",
                        "302",
                        "SDKs are still being built out (currently available for Go, Java, PHP, Ruby). You still need to run / scale your own database (Cassandra, MySQL, or PostgreSQL). ",
                        "161",
                        "/interviews/temporal-manu-srivastava/"
                    ],
                    [
                        "Mirage JS",
                        "Mirage JS",
                        "2021-03-29",
                        "2021-04-01",
                        "https://miragejs.com",
                        "Developer Tools - Testing frameworks",
                        "Open Source",
                        "API mocking library for frontend developers.",
                        "44",
                        "Intercepts all XMLHttpRequest and fetch requests so no code changes required (one additional import). Includes in-memory database for persistence tests. Can simulate slow responses or errors. Built-in ORM handles data relationships, output formatting, serialization.",
                        "266",
                        "Only supports REST APIs out of the box - GraphQL available as an optional plugin (still in development). Runs in the browser, not as a server, so it cannot be used to mock server-side APIs.",
                        "189",
                        ""
                    ],
                    [
                        "git-plan",
                        "git-plan",
                        "2021-03-30",
                        "2021-04-01",
                        "https://github.com/synek/git-plan",
                        "Developer Tools - Git tools",
                        "Open Source",
                        "Git workflow for planning / writing commits in advance.",
                        "55",
                        "Forces you to think about what you are going to work on in advance - writing out a plan probably helps improve your thinking, and also creates better commit messages. If you think of something you need to switch to, you can create a plan whilst it’s still top-of-mind, then come back to it later.",
                        "296",
                        "Unintuitive to begin with, but makes sense once you try it (see blog posts linked in the project readme for guidance). Interactive rebasing is an alternative that doesn’t force you to reverse your workflow.",
                        "206",
                        ""
                    ],
                    [
                        "WayScript",
                        "WayScript",
                        "2021-03-05",
                        "2021-03-25",
                        "https://wayscript.com",
                        "Cloud - PaaS",
                        "SaaS",
                        "Rapid API scripting platform.",
                        "29",
                        "Quickly create step function APIs from lots of pre-built integrations. Cron support. Connect to external data sources and manipulate data. Write real Python, JS, Java, shell script, GraphQL, HTML, and SQL (including using packaged dependencies) as separate steps. Configurable editor e.g. use vim keybindings, tabs vs spaces, etc.",
                        "330",
                        "Can be slow to execute (many seconds) especially with lots of steps. Have to use their browser editor - can’t develop and run code locally (this is on the roadmap).",
                        "164",
                        "/interviews/wayscript-jesse-orshan/"
                    ],
                    [
                        "Buddy",
                        "Buddy",
                        "2021-03-01",
                        "2021-03-25",
                        "https://buddy.works/",
                        "DevOps - CI/CD",
                        "SaaS",
                        "CI/CD.",
                        "6",
                        "Fast execution of steps due to caching. Can retry builds from specific steps and live-debug in a terminal which makes setting up pipelines easier. Can switch between UI or YAML config. Commenting/sharing helps team collaboration. UI has useful features, such as env var autocompletion.",
                        "285",
                        "Ecosystem of official build actions is small relative to GitHub Actions. UI is sometimes confusing due to the number of config options.",
                        "135",
                        ""
                    ],
                    [
                        "ORY",
                        "Kratos",
                        "2021-03-11",
                        "2021-03-18",
                        "https://www.ory.sh/kratos",
                        "Security - Authentication",
                        "Open Source",
                        "Cloud native user management.",
                        "29",
                        "Open source & self hosted: you probably don't want to build all your own user management (signup, login, MFA, FIDO2, etc) but do care about control and ownership. Runs as a compact, single Go binary. JSON Schema data model. Headless; example UI and API SDKs for Python, PHP, Node, Go, Java, Ruby. Scale horizontally.",
                        "316",
                        "Focus on APIs means there is no admin UI. Federation (OAuth2, OpenID) requires a separate project (ORY Hydra). \"Scale horizontally\" still means you need to scale your own RDBMS. Pre-1.0, targeting \"stable\" in 2022.",
                        "214",
                        ""
                    ],
                    [
                        "Chris Walz",
                        "bit",
                        "2021-03-01",
                        "2021-03-18",
                        "https://github.com/chriswalz/bit",
                        "Developer Tools - Git tools",
                        "Open Source",
                        "git CLI.",
                        "8",
                        "Autocomplete and flag suggestions. Commands such as release or sync combine several commands in one to speed up common tasks. Branch autocomplete for checkout. GitHub PR integration. Support for themes. Open source & cross platform.",
                        "232",
                        "Not what you might expect from a cli: you run the bit command, then it suggests subcommands and flags, rather than tab completion. Official OS packages missing on Linux.",
                        "169",
                        "/interviews/bit-chris-walz/"
                    ],
                    [
                        "Bird Eats Bug",
                        "Bird Eats Bug",
                        "2021-03-01",
                        "2021-03-11",
                        "https://birdeatsbug.com",
                        "Developer Tools - Testing frameworks",
                        "Desktop",
                        "Screensharing with technical metadata.",
                        "38",
                        "Captures screenshare and click journey with associated metadata like console and network logs. Local-first; uploadable for sharing (private or public). Quick submit to JIRA, Linear, Trello, GitHub",
                        "196",
                        "Chrome only (works on Microsoft Edge). More integrations needed.",
                        "64",
                        ""
                    ],
                    [
                        "Earthly",
                        "Earthly",
                        "2021-03-04",
                        "2021-03-11",
                        "https://earthly.dev",
                        "DevOps - Containers",
                        "Open Source",
                        "Containerized reproducible builds.",
                        "34",
                        "Runs existing build steps inside a container using your existing CI system (Jenkins, CircleCI, GitHub Actions, etc). This makes builds reproducible locally so they run the same on your laptop as in remote CI. Steps can be parallelized. Dependency caching locally and across repos.",
                        "280",
                        "Assumes you are building an already containerized application. Multi-platform builds are experimental.",
                        "102",
                        "/interviews/earthly-adam-gordon-bell/"
                    ],
                    [
                        "Microsoft",
                        "Playwright",
                        "2021-03-03",
                        "2021-03-04",
                        "https://playwright.dev",
                        "Developer Tools - Testing frameworks",
                        "Open Source",
                        "Automate Chromium, Firefox & Webkit with a single API.",
                        "54",
                        "Single API to launch and script Chromium, Firefox and WebKit. Emulate devices for testing responsiveness. Auto-wait API avoids hard coding timeouts. Extract screenshots, video and debug info. Library for JS, TypeScript, Python, C#, Java. Works on Windows, macOS, Linux.",
                        "269",
                        "Only supports latest browser versions - can’t pick older versions to test against. Browser binaries are quite large so may slow down CI/CD (cache is configurable).",
                        "163",
                        ""
                    ],
                    [
                        "Stoplight",
                        "Stoplight",
                        "2021-03-02",
                        "2021-03-04",
                        "https://stoplight.io",
                        "DevOps - API Management",
                        "SaaS",
                        "API design and development platform.",
                        "36",
                        "Build OpenAPI (v2 Swagger or v3) compliant APIs with auto-generated docs, example code, and mocking. Write docs in Markdown. Save everything (and load existing APIs) from Git. Offline/local dev support with desktop API studio app.",
                        "230",
                        "Limited ability to customize doc output to fit into your own design/brand. Some editor/docs UI bugs in Firefox. It does work without using OpenAPI specs, but most features assume you do.",
                        "186",
                        ""
                    ],
                    [
                        "Raycast",
                        "Raycast",
                        "2021-02-22",
                        "2021-02-25",
                        "https://raycast.com",
                        "Misc - OS",
                        "Desktop",
                        "Quick-launcher for developers.",
                        "30",
                        "Search cloud and local documents. Clipboard history. Manage GitHub PRs, JIRA issues, join Zoom calls, schedule calendar blocks. API and scripting to create your own commands. Tiling window management. Connects directly to remote services to avoid privacy issues.",
                        "262",
                        "macOS only. Shortcuts for sub-commands are difficult to find. File search requires scoping rather than searching everywhere.",
                        "124",
                        "/interviews/raycast-petr-nikolaev/"
                    ],
                    [
                        "DBCLI",
                        "DBCLI",
                        "2021-02-22",
                        "2021-02-25",
                        "https://www.dbcli.com",
                        "Database - Management",
                        "Desktop",
                        "CLIs for databases.",
                        "19",
                        "Autocomplete and syntax highlighted output. Support for Postgres, MySQL, SQLite, MSSQL, Redis, AWS Athena. History, search, vi/Emacs keybindings, saved queries. Open source & cross-platform.",
                        "190",
                        "Only available via pip or brew - official OS packages would make installation easier to integrate with native package management. Installation on Windows is a hassle due to needing Python. Large results don't line-wrap well.",
                        "224",
                        ""
                    ],
                    [
                        "Accurics",
                        "Terrascan",
                        "2021-02-16",
                        "2021-02-18",
                        "https://github.com/accurics/terrascan",
                        "Developer Tools - Testing frameworks",
                        "Open Source",
                        "Static code analyzer for Infrastructure as Code.",
                        "48",
                        "Scans Terraform, k8s, and Helm configs for security and compliance. Supports AWS, Azure, GCP, Kubernetes, GitHub and has lots of sensible policy defaults which can be extended using the Open Policy Agent Rego language. Can be run in CI/CD.",
                        "239",
                        "Docs need work: quickstart didn't work smoothly and default policies are not well explained. Explanations of how to rectify policy violations would help.",
                        "153",
                        ""
                    ],
                    [
                        "Oso",
                        "Oso",
                        "2021-02-15",
                        "2021-02-18",
                        "https://www.osohq.com/",
                        "Security - Authentication",
                        "Open Source",
                        "A system for building application authorization.",
                        "48",
                        "Flexible, declarative language for describing simple or complex access control rules in code. Easy to test policies. Native libraries for NodeJS, Java, Python, Ruby, Go, Rust. Useful tooling: debugger, tracer, and VS Code integration.",
                        "234",
                        "Focused only on authorization, so you need to build your own authentication (signup, login, forgot password, etc).",
                        "114",
                        "/interviews/oso-sam-scott/"
                    ],
                    [
                        "GitPod",
                        "GitPod",
                        "2021-02-09",
                        "2021-02-11",
                        "https://www.gitpod.io",
                        "Developer Tools - IDE",
                        "SaaS",
                        "Dev environments as code and hosted in the cloud.",
                        "49",
                        ".gitpod.yml file in the repo describes the full dev environment so it's version controlled and always up to date. GitPod pre-builds after every commit so the environment is ready when you activate it. VS Code in the browser means you can develop anywhere on any machine. Easily switch workspaces e.g. to review a pull request without disrupting your current environment. Self-hosted version so you can run it all yourself (some features limited to paid license).",
                        "462",
                        "Limited IDE support - VS Code or Theia (based on VS Code) means you have to code in the browser so you can't use your own IDE/editor (support for other IDEs in development). Requires you to be online with good connectivity because everything is remote.",
                        "252",
                        "/interviews/gitpod-christian-weichel/"
                    ],
                    [
                        "asdf",
                        "asdf",
                        "2021-02-04",
                        "2021-02-11",
                        "https://asdf-vm.com/",
                        "Developer Tools - Dependency management",
                        "Open Source",
                        "A CLI to manage language runtimes.",
                        "34",
                        "Makes it easy to switch language runtime versions without messing up the system install (if any). Lots of plugins so it supports pretty much every language. Configs can be defined in a per-project file so it can auto switch based on current working directory. Means you can forget about language specific virtual environments because asdf manages them for you. Has an official GitHub Action.",
                        "391",
                        "Language support is via community plugins so quality is variable. Windows support still in development.",
                        "103",
                        ""
                    ],
                    [
                        "StackHawk",
                        "StackHawk",
                        "2021-02-05",
                        "2021-02-11",
                        "https://www.stackhawk.com/",
                        "Developer Tools - Dependency management",
                        "SaaS",
                        "Black box security scanning for developers.",
                        "43",
                        "An easy way for developers to run a standardized suite of black box tests. Spiders and auto-discovers endpoints so there is almost zero config. Runs inside a container so it can be run anywhere. Web UI highlights and prioritizes all detected vulnerabilities. Can easily be run locally against any local or remote endpoint. Built on top of open source OWASP ZAP. Good quality documentation. Integrations into CI/CD e.g. GitHub Actions, GitLab, CircleCI.",
                        "452",
                        "Assumes you know about OWASP and how to resolve highlighted issues. The nature of black box testing means some OWASP issues are false positives and are not comprehensive e.g. no detection of dependency vulnerabilities. Large example app takes >25min to scan (although our own simple app took <1 min).",
                        "300",
                        "/interviews/stackhawk-scott-gerlach/"
                    ],
                    [
                        "Opstrace",
                        "Opstrace",
                        "2021-02-02",
                        "2021-02-04",
                        "https://opstrace.com",
                        "DevOps - Observability",
                        "Open Source",
                        "A management layer on top of independent open source observability tools.",
                        "73",
                        "Automates deployment of Prometheus, Cortex, and Loki and configures them to store data in your own S3 or GCS buckets. This means you keep control of the data and the price of storage from your existing cloud provider.  Supports multiple tenants e.g. prod vs dev, and deals with scaling them. Existing Prometheus instances can be configured to send data to Opstrace.",
                        "365",
                        "Installation and cluster management are the main differentiator - otherwise it's just packaging open source projects. API uses an Opstrace managed endpoint - custom domains supported only in the commercial version which is hidden behind \"contact us\". If you already have Prometheus, you could just set up Cortex yourself. Only supports AWS and GCP. No Windows support.",
                        "368",
                        ""
                    ],
                    [
                        "Nushell",
                        "Nushell",
                        "2021-02-02",
                        "2021-02-04",
                        "https://www.nushell.sh",
                        "Developer Tools - Shells",
                        "Open Source",
                        "A shell where everything is data.",
                        "33",
                        "The first thing you notice is running `ls` outputs a structured table. All output is actually data, so it is like interacting with a spreadsheet. Nushell applies the Unix philosophy of piping commands but allows for commands like `ls | where size > 1kb`. Supports parsing data like CSV and JSON. You can script your own commands. Cross platform.",
                        "345",
                        "Although it can be run as a command, it is designed to replace your existing shell. It is still in development so may not be stable. You will have to reconfigure everything if you have heavily customized your shell.",
                        "215",
                        ""
                    ],
                    [
                        "EteSync",
                        "Etebase",
                        "2021-02-03",
                        "2021-02-04",
                        "https://www.etebase.com/",
                        "Developer Tools - Backend framework",
                        "Open Source",
                        "E2E encrypted Firebase-like database and SDK.",
                        "45",
                        "Open source end-to-end encryption based on libsodium. SDKs for JS, Python, Java, Kotlin, C/C++, Rust. Handles sync and user sharing e.g. users collaborating on an encrypted doc. Has specialist types for calendars, tasks, and Markdown notes. Supported by a foundation and a European Commission program.",
                        "301",
                        "A cloud service by default but you can run their open source server component. No pricing yet for the commercial cloud version. Large files not supported (on the roadmap). Local cache but no offline storage.",
                        "207",
                        ""
                    ],
                    [
                        "Infracost",
                        "Infracost",
                        "2021-01-27",
                        "2021-01-28",
                        "https://github.com/infracost/infracost",
                        "DevOps - Infrastructure automation",
                        "Open Source",
                        "Cloud cost estimates for Terraform.",
                        "35",
                        "Integrates with CI (GitHub, GitLab, CircleCI, Bitbucket) to provide cost diffs for pull requests. Supports AWS and Google Cloud.",
                        "128",
                        "Uses a Cloud Pricing API provided (for free) by the Infracost project so it requires sending data to it (you can self-host). May be out of date. Only supports AWS and Google Cloud. Other cloud vendors planned.",
                        "209",
                        "/interviews/infracost-ali-khajeh-hosseini/"
                    ],
                    [
                        "LocalStack",
                        "LocalStack",
                        "2021-01-27",
                        "2021-01-28",
                        "https://localstack.cloud/",
                        "Developer Tools - Local development",
                        "Other",
                        "Test/mocking framework replicating AWS APIs locally.",
                        "52",
                        "Deploy a full AWS stack in a local Docker container. Avoid paying for AWS environments for test/dev. Supports key AWS services like DynamoDB, EC2, Kinesis, Lambda, Route53, SNS, SQS. Allows you to inject errors.",
                        "211",
                        "Some APIs require the paid version e.g. CloudFront, Cognito, ElastiCache, Glacier, RDS. Not built by AWS so will always lag behind the real thing. Good for dev but testing probably better done against the actual APIs.",
                        "217",
                        ""
                    ],
                    [
                        "rsync.net",
                        "rclone on rsync.net",
                        "2021-01-27",
                        "2021-01-28",
                        "https://www.rsync.net/products/universal.html",
                        "Cloud - Storage",
                        "Other",
                        "Store immutable backups of cloud accounts.",
                        "42",
                        "rsync.net is a Unix (ZFS) filesystem over SSH but also supports commands like borg, git, rsync, s3cmd, and now rclone. rclone is a separate open source project that exposes many cloud accounts as filesystems e.g. Google Photos, Dropbox, Azure Blob storage. rsync.net connects directly so you can copy from one to the other without downloading/uploading.",
                        "353",
                        "This is truly a filesystem over SSH so you need to know your way around the command line. Documentation is limited and the account manager UI is dated. No support for scheduling execution so you need to handle that yourself e.g. cron, systemd.",
                        "243",
                        "/interviews/rsync-john-kozubik/"
                    ],
                    [
                        "laktak",
                        "extrakto for tmux",
                        "2021-01-22",
                        "2021-01-28",
                        "https://github.com/laktak/extrakto",
                        "Misc - Terminal utilities",
                        "Open Source",
                        "Quickly select, copy/paste, complete text without a mouse.",
                        "58",
                        "The whole idea behind using the command line is to make things faster, usually using the keyboard. This helps with that goal by improving select, copy and paste inside tmux. It works everywhere, even in SSH sessions. Works with clipboards on Linux, macOS, and Windows.",
                        "268",
                        "tmux beta release is required for popups, otherwise this currently uses a new split window.",
                        "91",
                        ""
                    ],
                    [
                        "Seed",
                        "Seed",
                        "2021-01-20",
                        "2021-01-21",
                        "https://seed.run/",
                        "DevOps - CI/CD",
                        "SaaS",
                        "Managed CI/CD pipeline for serverless on AWS.",
                        "45",
                        "Managing lots of individual Lambdas across environments and regions is a pain because of how long it takes to package and deploy, especially with AWS rate limits. Seed hooks into Git and speeds things up by deploying concurrently. Supports Serverless Framework, caching dependencies, and incremental deploys. Built-in Lambda monitoring for errors. Also supports AWS CDK.",
                        "370",
                        "Only supports AWS Serverless i.e. Lambda, so unless you are 100% Lambda then this will be a separate CD pipeline to manage. Doesn't support other tech like containers, or other platforms like Azure/Google. Those with just a few, simple Lambdas may find it overkill.",
                        "265",
                        "/interviews/seed-jay-v/"
                    ],
                    [
                        "Brave",
                        "IPFS Support in Brave",
                        "2021-01-20",
                        "2021-01-21",
                        "https://brave.com/ipfs-support/",
                        "Misc - OS",
                        "Open Source",
                        "Support for accessing content over the decentralized network, IPFS.",
                        "67",
                        "Decentralized filesystems allow access to content without relying on a specific host. This makes them resistent to censorship (or outages, deletion, etc). IPFS can be a pain to run, or you have to use a gateway service. Built-in browser support means users don't have to care, just like with HTTP. Brave is based on Chromium (but better privacy than Chrome) so most sites work fine.",
                        "382",
                        "Brave is still a niche browser, and IPFS is still very early. How much content is hosted on it? Site owners need to upload (pin) their content to IPFS, which isn't necessarily straightforward. Still requires the use of ipfs:// URLs, although DNSLink support for using DNS TXT records is planned.",
                        "295",
                        ""
                    ],
                    [
                        "Yifan Gu",
                        "VMCLI",
                        "2021-01-15",
                        "2021-01-21",
                        "https://github.com/gyf304/vmcli",
                        "Misc - OS",
                        "Open Source",
                        "Utilities for managing VMs on macOS.",
                        "36",
                        "macOS Big Sur includes a new framework for managing VMs. This CLI makes it easy to run VMs without additional software i.e. using the new Virtualization.framework. Means you don't need Virtual Box, VMWare, etc for simple VM tasks.",
                        "230",
                        "Obviously macOS-only. Only basic functionality for using VMs (probably fine for developers).",
                        "92",
                        "/interviews/vmcli-yifan-gu/"
                    ],
                    [
                        "Vantage",
                        "Vantage",
                        "2021-01-13",
                        "2021-01-14",
                        "https://www.vantage.sh/",
                        "DevOps - Infrastructure automation",
                        "SaaS",
                        "AWS Console designed for developers.",
                        "36",
                        "AWS Console UX is not great; Vantage is much cleaner and faster. It connects using a read-only CloudFormation IAM Role and they have detailed documentation about the read-only permissions it requests. \"Views\" nicely segment/group resources, even across accounts and regions, with global search for them all. Cost reporting by view and weekly email reports help you manage budgets better.",
                        "387",
                        "Does not support all AWS products, currently focused on a few key resources e.g. EC2 instances, VPC Subnets, Route53, etc. Currently read-only, which is good for security and because it's a new tool - plans to add more management features in the future. Also AWS-only, but they are working on other cloud providers.",
                        "315",
                        "/interviews/vantage-ben-schaechter/"
                    ],
                    [
                        "Skynet",
                        "Skynet",
                        "2021-01-13",
                        "2021-01-14",
                        "https://siasky.net/",
                        "Cloud - Storage",
                        "Open Source",
                        "Decentralized file storage and CDN.",
                        "35",
                        "Web UI and SDKs for uploading files to a decentralized CDN. Uses a blockchain and rewards users who run nodes with coins which can be exchanged for money. Current average cost = $4.16/TB stored + $1.25/TB transferred.",
                        "217",
                        "Time to first byte 300-500ms may be prohibitatively slow for some use cases. Streaming \"up to 1Gbps\" but what does \"up to\" really mean? Files must be public. Why call it \"Skynet\"?!",
                        "180",
                        ""
                    ],
                    [
                        "James Little",
                        "Stork Search",
                        "2021-01-13",
                        "2021-01-14",
                        "https://stork-search.net/",
                        "Developer Tools - Site Search",
                        "Open Source",
                        "Fast search for static sites.",
                        "29",
                        "Generate the index of your content, which is then downloaded by the visitor's browser and searched using the JS/WASM library \"locally\" - this is what makes it so fast.",
                        "167",
                        "Index must be generated manually. It is specifically designed for static sites, so it would need to be hooked into a build process. Would need extra work if you wanted to index a dynamic site.",
                        "192",
                        "/interviews/stork-search-james-little/"
                    ],
                    [
                        "Starship",
                        "Starship",
                        "2021-01-06",
                        "2021-01-07",
                        "https://starship.rs",
                        "Misc - Terminal utilities",
                        "Open Source",
                        "High-performance, customizable, shell prompt.",
                        "45",
                        "Works with any shell (bash, zsh, fish, PowerShell). Context-sensitive e.g. auto-complete, shows Git info, lots of language specific configs. Written in Rust, which is trendy, and probably fast.",
                        "193",
                        "Another layer on your shell to mess around with. If you use ZSH then Oh My ZSH already does a lot of this, and has lots of good ZSH tweaks.",
                        "139",
                        "/interviews/starship-matan-kushner/"
                    ],
                    [
                        "Wasmer",
                        "Wasmer 1.0",
                        "2021-01-06",
                        "2021-01-07",
                        "https://wasmer.io/",
                        "Developer Tools - Backend framework",
                        "Open Source",
                        "An open-source runtime for executing WebAssembly server-side.",
                        "61",
                        "Allows shared libraries to be sandboxed, compiled, then run standalone or embedded in Rust, C/C++, Python, Go. Pluggable compilers allows optimisation of the final artifacts e.g. LLVM for machine code. Wasmer 1.0 adds a headless mode and cross-compilation.",
                        "256",
                        "The use cases seem limited to untrusted, shared code. If you need cross-platform, native binaries with good performance then why not just use a compiled language like Go or Rust in the first place?",
                        "197",
                        ""
                    ]
                ],
                "formatted": [
                    {
                        "Company/Org": "Snyk",
                        "Tool/Product/Project": "Snyk Open Source",
                        "Reviewed": "2021-08-05",
                        "Scheduled for": "2021-08-05",
                        "URL": "https://snyk.io/product/open-source-security-management/?utm_medium=Organic-Email&utm_source=consoledev&utm_content=snyk-open-source",
                        "Category": "Security - Vulnerability management",
                        "Type": "SaaS",
                        "What is it?": "Dependency security monitoring for open source.",
                        "Len": "155",
                        "What we like": "Easy to see security status for everything. Scans full dependency tree revealing your actual security posture e.g. vulns in dependency dependencies. Relative severity scoring helps understand how relevant issues are. Inspects containers & OS packages as well as code. Separates dev dependencies from prod. Multiple options for fixes e.g. via CLI, not just PRs.",
                        "What we dislike": "Showing vulnerabilities in dependency dependencies is interesting, but what are you going to do about them? CLI to apply fixes still in beta (Python only).",
                        "Interview": ""
                    },
                    {
                        "Company/Org": "OSSF",
                        "Tool/Product/Project": "Security Scorecard",
                        "Reviewed": "2021-08-05",
                        "Scheduled for": "2021-08-05",
                        "URL": "https://github.com/ossf/scorecard",
                        "Category": "Security - Vulnerability management",
                        "Type": "Open Source",
                        "What is it?": "Security health metrics for open source.",
                        "Len": "188",
                        "What we like": "Assessment criteria are objective, consistent and documented so OSS projects can start to adopt them. Makes it easy to assess the security posture of the projects you rely on. CLI output is clear why a check fails. Can scan a GitHub repo or infer it from npm, pypi or rubygem package names. JSON or CSV output means results can be scripted.",
                        "What we dislike": "Some assessment criteria (such as looking for commits from >1 GitHub organizations) may be onerous for small, one-person projects. No easy way to integrate into CI/CD yet (on the roadmap).",
                        "Interview": ""
                    },
                    {
                        "Company/Org": "Liveblocks",
                        "Tool/Product/Project": "Liveblocks",
                        "Reviewed": "2021-07-16",
                        "Scheduled for": "2021-07-29",
                        "URL": "https://liveblocks.io/",
                        "Category": "Developer Tools - Frontend framework",
                        "Type": "SaaS",
                        "What is it?": "Real-time collaboration API.",
                        "Len": "193",
                        "What we like": "Components to easily add live presence (live cursors, chat and reactions). Abstracts away the backend implementation challenges - networking, performance, presence detection, multi-browser support. Vendored as React / Node packages. Auth hooks to validate user permissions. Examples for raw JS, Next.js, Nuxt.js and React + Firebase.",
                        "What we dislike": "Assumes you’re building with web technologies i.e. JS. No mobile support. Still requires implementing authentication. Classic build vs buy - is it a good use of your time to try and build this?",
                        "Interview": "/interviews/liveblocks-guillaume-salles/"
                    },
                    {
                        "Company/Org": "Livekit",
                        "Tool/Product/Project": "Livekit",
                        "Reviewed": "2021-07-19",
                        "Scheduled for": "2021-07-29",
                        "URL": "https://livekit.io/",
                        "Category": "API - Communication",
                        "Type": "Open Source",
                        "What is it?": "Open source live video and audio API.",
                        "Len": "217",
                        "What we like": "SDKs for React, JS, iOS and Android to build video / audio without needing to understand WebRTC. Selective Forwarding Unit server makes it easy to scale from P2P to supporting large numbers of participants. Server scales horizontally using Redis as the backend. Automatically supports different connection types (UDP, TCP, TURN) and simulcasting.",
                        "What we dislike": "Still need to set up SSL + load balancers. Using a server component defeats the idea of P2P. Your code still needs to deal with issuing access tokens to each participant. Simulcasting only works in the browser/JS SDK.",
                        "Interview": ""
                    },
                    {
                        "Company/Org": "Polypane",
                        "Tool/Product/Project": "Polypane",
                        "Reviewed": "2021-06-18",
                        "Scheduled for": "2021-07-22",
                        "URL": "https://polypane.app/",
                        "Category": "Developer Tools - Browser testing",
                        "Type": "Desktop",
                        "What is it?": "Browser testing tool.",
                        "Len": "124",
                        "What we like": "Multiple browser panes side-by-side to test various sizes. Inspect element works across panes simultaneously. Scroll sync helps comparison. Built on Chrome so devtools available. Shows Web Vitals scores. Can trigger media features e.g. prefers-color-scheme, reduced-motion. Debug tools like a11y, CSS injection, disable images, mobile reachability.",
                        "What we dislike": "Signup/license key process is a bit fiddly. Quite CPU intensive. You need a very big screen to see all the windows properly.",
                        "Interview": ""
                    },
                    {
                        "Company/Org": "automerge",
                        "Tool/Product/Project": "automerge",
                        "Reviewed": "2021-06-12",
                        "Scheduled for": "2021-07-22",
                        "URL": "https://github.com/automerge/automerge",
                        "Category": "Developer Tools - Backend framework",
                        "Type": "Open Source",
                        "What is it?": "Conflict-free JSON-like data structure.",
                        "Len": "244",
                        "What we like": "Built for JS applications to allow read/write to properties whilst avoiding conflicts. Maintains a history of all changes. Network-agnostic but includes a sync protocol for send/receive messages. Custom types for conflict free counters, collaborative text editing and tables. Follows the idea of functional reactive programming.",
                        "What we dislike": "Documents are not actually immutable by default - you just code as if they are. Enforcing this can be turned on but has a major performance hit. Implementation is only in JS but versions in Rust, Swift, Python in various stages of development.\n",
                        "Interview": ""
                    },
                    {
                        "Company/Org": "Tuple",
                        "Tool/Product/Project": "Tuple",
                        "Reviewed": "2021-06-22",
                        "Scheduled for": "2021-07-15",
                        "URL": "https://tuple.app",
                        "Category": "Developer Tools - Code collaboration",
                        "Type": "Desktop",
                        "What is it?": "Screen sharing optimized for developers.",
                        "Len": "179",
                        "What we like": "Quick start a P2P encrypted call + screen sharing session. Quality settings go up to 5k to make code crisp and easy to read, unlike generic conferencing services. Easy to take control to type, send through keyboard shortcuts, highlight areas of the screen. Live call debug info to see any connection problems. The “ship it” stamp effect is fun.",
                        "What we dislike": "Really needs a high quality connection otherwise you can’t reach the higher resolutions and the mouse/keyboard sharing is laggy. macOS only - Linux client on the roadmap for 2021.",
                        "Interview": "/interviews/tuple-ben-orenstein/"
                    },
                    {
                        "Company/Org": "GitHub",
                        "Tool/Product/Project": "GitHub Copilot",
                        "Reviewed": "2021-07-08",
                        "Scheduled for": "2021-07-15",
                        "URL": "https://copilot.github.com/",
                        "Category": "Developer Tools - IDE",
                        "Type": "SaaS",
                        "What is it?": "AI pair programming for VS Code.",
                        "Len": "203",
                        "What we like": "Autocomplete is accurate - speeds up work on a line-by-line basis, just like GMail/Google Docs. Understands file context - imports, variable names, etc. Using comments to describe what you want to do then reviewing suggestions is like doing a web search. Time saver for simple, common, but annoying tasks e.g. regexes, test skeletons.",
                        "What we dislike": "Not clear if it’s thinking or not - sometimes you wait for nothing to happen. Licensing questions remain unanswered - is the code a derivative of copyrighted material? Doesn’t understand project context.",
                        "Interview": ""
                    },
                    {
                        "Company/Org": "Hashicorp",
                        "Tool/Product/Project": "Waypoint",
                        "Reviewed": "2021-06-16",
                        "Scheduled for": "2021-07-08",
                        "URL": "https://www.waypointproject.io/",
                        "Category": "DevOps - CI/CD",
                        "Type": "Open Source",
                        "What is it?": "Build, deploy, and release across platforms.",
                        "Len": "251",
                        "What we like": "Single command to get your code into production. Can track Git repos to auto-deploy. Integrates with AWS, Azure, Google to upload artifacts, configure LBs, DNS, env vars, etc. Stream logs and execute remote commands. Preview URLs for staging. Web dashboard summarizes deploy status. Extensible hooks via plugins.",
                        "What we dislike": "Assumes your app is containerized. Need to run / maintain your own Waypoint server - still early so not entirely prod-ready. Preview URLs are public so you must set up authorization or disable them (self-hosting URL service is an option, but complex).",
                        "Interview": ""
                    },
                    {
                        "Company/Org": "Zellij",
                        "Tool/Product/Project": "Zellij",
                        "Reviewed": "2021-06-14",
                        "Scheduled for": "2021-07-08",
                        "URL": "https://zellij.dev/",
                        "Category": "Misc - Terminal emulators",
                        "Type": "Open Source",
                        "What is it?": "Terminal workspace manager (tabs + multiplexing).",
                        "Len": "244",
                        "What we like": "Built-in tabs, panes, sessions, resizing, scrollback. Shows (customizable) keybindings to help discovery. “New pane” algorithmically placed in the most optimized position (or use manual splits). Can configure layouts in yaml then auto start them. Single compiled binary. Has a built-in file manager (a clone of ranger). WASM-based plugin system.",
                        "What we dislike": "Colors not inherited from existing shell config. Docs are still very limited. Some core shortcuts used by other tools e.g. Ctrl + r in bash (use Zellij lock mode to pass these through). Slightly laggy over remote connections (compared to tmux).",
                        "Interview": ""
                    },
                    {
                        "Company/Org": "Prestige",
                        "Tool/Product/Project": "Prestige",
                        "Reviewed": "2021-06-17",
                        "Scheduled for": "2021-07-01",
                        "URL": "https://prestigemad.com/",
                        "Category": "Developer Tools - API Client",
                        "Type": "Open Source",
                        "What is it?": "Browser- and text-based HTTP client.",
                        "Len": "135",
                        "What we like": "Really simple way to execute HTTP commands but can also send more complex requests e.g. headers, file uploads, cookies, JSON. Can write commands in plain text, JS, or define variables in templates. Prettified and syntax-highlighted response parsing. Can save to local browser storage (GitHub and others on roadmap). Open source codebase.",
                        "What we dislike": "Requests run through a proxy rather than your browser (due to CORS), but localhost URLs are routed directly. No support for OAuth APIs.",
                        "Interview": ""
                    },
                    {
                        "Company/Org": "chezmoi",
                        "Tool/Product/Project": "chezmoi",
                        "Reviewed": "2021-06-17",
                        "Scheduled for": "2021-07-01",
                        "URL": "https://www.chezmoi.io/",
                        "Category": "Misc - Terminal utilities",
                        "Type": "Open Source",
                        "What is it?": "dotfile manager.",
                        "Len": "266",
                        "What we like": "Single compiled binary. No bootstrap requirements - supports many platforms. Can query password manager for secrets and supports encrypted files. Configs can be templated for differences across environments. Can run scripts, including run-once (ideal for cloud IDEs or ephemeral environments). File edit flow similar to git (which is used for versioning).",
                        "What we dislike": "You can edit files directly but using the edit flow ensures changes/conflicts are handled properly, which may require retraining muscle memory. Doesn’t handle git subdirectories e.g. Oh My Zsh particularly well (better to use a script to install outside of chezmoi).",
                        "Interview": ""
                    },
                    {
                        "Company/Org": "IPInfo",
                        "Tool/Product/Project": "IPInfo",
                        "Reviewed": "2021-06-07",
                        "Scheduled for": "2021-06-24",
                        "URL": "https://ipinfo.io",
                        "Category": "API - API",
                        "Type": "SaaS",
                        "What is it?": "CLI for IP address metadata lookup.",
                        "Len": "108",
                        "What we like": "Lookup IP details such as ASN, location, hostname, abuse contact, tor/VPN/hosting IP categorization. Cross-platform binaries. Colored output. Bulk summarize IPs from a file (or piped in). Bash, zsh, fish auto-completion. SDKs available for major languages.",
                        "What we dislike": "Responses not cached. Available via Homebrew on Mac but not Linux or Windows package managers. No man pages.",
                        "Interview": ""
                    },
                    {
                        "Company/Org": "gitui",
                        "Tool/Product/Project": "gitui",
                        "Reviewed": "2021-06-02",
                        "Scheduled for": "2021-06-24",
                        "URL": "https://github.com/extrawurst/gitui",
                        "Category": "Developer Tools - Git tools",
                        "Type": "Open Source",
                        "What is it?": "Fast git TUI.",
                        "Len": "91",
                        "What we like": "Focus on high-performance repo parsing using async means the UI is responsive, low memory and low CPU even for the largest of repos. Keyboard control of common tasks e.g. stash, stage, diff review and commit with keybindings highlighted for newer users (or when you forget). Adopts terminal color scheme. Cross-platform packages (Arch, Fedora, Homebrew, Chocolatey, Nix).",
                        "What we dislike": "No log search or file history log and does not yet support bare repos (all on the roadmap).",
                        "Interview": ""
                    },
                    {
                        "Company/Org": "GitLive",
                        "Tool/Product/Project": "GitLive",
                        "Reviewed": "2021-06-02",
                        "Scheduled for": "2021-06-17",
                        "URL": "https://git.live",
                        "Category": "Developer Tools - Code collaboration",
                        "Type": "Desktop",
                        "What is it?": "Live Git diffs for uncommitted changes.",
                        "Len": "178",
                        "What we like": "Real-time change indicators show where others have made changes to files but not yet committed. Preview live diffs and get warnings about conflicts from other collaborators. Privacy option to stop sharing when required. Built-in video calls and codesharing which works across IDEs - VS Code, JetBrains, Android Studio.",
                        "What we dislike": "Requires everyone to use GitLive and one of the supported editors. Uploads code diffs (not the full source) to GitLive servers while changes are uncommitted, deleted once pushed.",
                        "Interview": "/interviews/gitlive-nick-bransby-williams/"
                    },
                    {
                        "Company/Org": "Runops",
                        "Tool/Product/Project": "Runops",
                        "Reviewed": "2021-06-14",
                        "Scheduled for": "2021-06-17",
                        "URL": "https://runops.io/",
                        "Category": "DevOps - Infrastructure automation",
                        "Type": "SaaS",
                        "What is it?": "Control access to run commands in production.",
                        "Len": "219",
                        "What we like": "Terminal-based signup/demo. Template / version control production commands - scripts, databases, containers, cloud consoles. CLI or Slack Bot to trigger them without direct prod access. Auth/approval flows before commands execute. Optional self-hosted runner with secrets stored in your own secrets storage. Auto-redaction of sensitive logs. Bastion SSH support.",
                        "What we dislike": "Cloud version requires public access to resources e.g. database connection URL, and doesn’t support IP allowlists - self-hosted runner allows private network access. Reliant on Slack for approvals, team management, etc.",
                        "Interview": ""
                    },
                    {
                        "Company/Org": "Filippo Valsorda",
                        "Tool/Product/Project": "mkcert",
                        "Reviewed": "2021-06-04",
                        "Scheduled for": "2021-06-10",
                        "URL": "https://github.com/FiloSottile/mkcert",
                        "Category": "Developer Tools - Local development",
                        "Type": "Open Source",
                        "What is it?": "CLI for managing local dev certificates.",
                        "Len": "217",
                        "What we like": "Solves the hassle of configuring SSL for local dev endpoints by configuring and managing a root CA. Means you don’t need to leave testing SSL to staging (or prod!) or store real certs locally. Allows you to generate certs for localhost. Cross platform + support for browser specific root stores.",
                        "What we dislike": "You still need to configure your server to use the certs. GitHub binaries built with a slightly older version of Go (1.13) so no Apple Silicon support - use the homebrew version which does have Apple Silicon binaries.",
                        "Interview": ""
                    },
                    {
                        "Company/Org": "Openbase",
                        "Tool/Product/Project": "Openbase",
                        "Reviewed": "2021-06-03",
                        "Scheduled for": "2021-06-10",
                        "URL": "https://openbase.com",
                        "Category": "Developer Tools - Dependency management",
                        "Type": "SaaS",
                        "What is it?": "Database of open source packages.",
                        "Len": "193",
                        "What we like": "Packages ranked based on various criteria such as documentation, performance, popularity. Categories for common use cases to help find most used packages. Analyze dependencies and project activity e.g. release cadence, commit frequency.",
                        "What we dislike": "Only supports searching JS packages - leaderboards available for Python, Rust, Go, Swift and Java libraries. Some criteria are more subjective than others e.g. are frequent commits good or bad?",
                        "Interview": ""
                    },
                    {
                        "Company/Org": "gitmoji-cli",
                        "Tool/Product/Project": "gitmoji-cli",
                        "Reviewed": "2021-05-20",
                        "Scheduled for": "2021-06-03",
                        "URL": "https://github.com/carloscuesta/gitmoji-cli",
                        "Category": "Developer Tools - Git tools",
                        "Type": "Open Source",
                        "What is it?": "CLI to add Gitmoji to commits.",
                        "Len": "227",
                        "What we like": "gitmoji helps identify commits at a glance. CLI sets up a Git commit hook to trigger the interactive CLI to pick a gitmoji for the commit. Text search to find right emoji based on commit purpose. Can be configured to use Conventional Commits scopes.",
                        "What we dislike": "By default only renders on GitHub, but you can configure it to use actual emoji characters. Some may consider this polluting the git log, especially if you write your commits properly and use git shortlog in your release notes.",
                        "Interview": ""
                    },
                    {
                        "Company/Org": "Xonsh",
                        "Tool/Product/Project": "Xonsh",
                        "Reviewed": "2021-03-26",
                        "Scheduled for": "2021-06-03",
                        "URL": "https://xon.sh/",
                        "Category": "Developer Tools - Shells",
                        "Type": "Open Source",
                        "What is it?": "Python-powered shell.",
                        "Len": "171",
                        "What we like": "Can do arithmetic, import modules, use data types, loops, etc, because everything it receives is interpreted with Python. Tab completion based on man-pages. Community extensions e.g. Powerline, written in Python. Cross-platform.",
                        "What we dislike": "Small community of extensions. Not bash compatible, so you have to relearn some syntax. Incompatible with Python virtual environments (has its own replacement called vox).",
                        "Interview": ""
                    },
                    {
                        "Company/Org": "Big Sky Software",
                        "Tool/Product/Project": "htmx",
                        "Reviewed": "2021-04-27",
                        "Scheduled for": "2021-05-27",
                        "URL": "https://htmx.org",
                        "Category": "Developer Tools - Frontend framework",
                        "Type": "Open Source",
                        "What is it?": "HTML attribute-based frontend framework.",
                        "Len": "258",
                        "What we like": "Access AJAX, CSS Transitions, WebSockets and SSEs directly in HTML. Any HTML element can issue AJAX requests. Implements the principle of  “locality of behavior” so it’s easier to understand what code is doing. Small (10k min gz), no dependencies.",
                        "What we dislike": "Injecting remote responses is a potential security issue: JS can still be executed even with a restrictive CSP, and user-generated content must be escaped. Execution must be denied within specific areas of the DOM. Violates separation of concerns principle.\n",
                        "Interview": ""
                    },
                    {
                        "Company/Org": "Semgrep",
                        "Tool/Product/Project": "Semgrep",
                        "Reviewed": "2021-05-24",
                        "Scheduled for": "2021-05-27",
                        "URL": "https://semgrep.dev",
                        "Category": "Developer Tools - Testing frameworks",
                        "Type": "Open Source",
                        "What is it?": "Static analysis tool.",
                        "Len": "75",
                        "What we like": "Open source, runs locally and/or in CI/CD. No DSL - write rules in the language you use and alongside the code they check. Plugins for as-you-code analysis in Vim, VS Code, IntelliJ. Lots of community rules for common languages and frameworks (Django, Flask, Java, Rails). Integrates with CI and can add comments to PRs. Cloud web UI is optional.",
                        "What we dislike": "Experimental support for C, Rust, PHP, Lua, C#, Kotlin. No Windows support.",
                        "Interview": ""
                    },
                    {
                        "Company/Org": "QuestDB",
                        "Tool/Product/Project": "QuestDB",
                        "Reviewed": "2021-05-13",
                        "Scheduled for": "2021-05-20",
                        "URL": "https://questdb.io",
                        "Category": "Database - Time series database",
                        "Type": "Open Source",
                        "What is it?": "Timeseries database with SQL.",
                        "Len": "252",
                        "What we like": "InfluxDB-compatible ingestion. Postgres-compatible wire API (allows querying with Grafana). Handles out of order inserts in a configurable way even though it uses an append column-based storage model. Official Docker image and Helm chart for dev/prod deploys. ANSI SQL with additional time functions. No GC.",
                        "What we dislike": "No built-in replication/clustering. Partitioning is only supported by timestamp (day, month, year) which means you tradeoff easier retention policies and faster calculations/seek times with the potential for hotspots if reads are mostly on recent data.",
                        "Interview": "/interviews/questdb-vlad-ilyushchenko/"
                    },
                    {
                        "Company/Org": "atuin",
                        "Tool/Product/Project": "atuin",
                        "Reviewed": "2021-05-10",
                        "Scheduled for": "2021-05-20",
                        "URL": "https://github.com/ellie/atuin",
                        "Category": "Misc - Terminal utilities",
                        "Type": "Open Source",
                        "What is it?": "Shell history search/sync with SQLite.",
                        "Len": "140",
                        "What we like": "Search shell history with CLI or interactive TUI (ctrl+r). Query by date, current directory, string terms. Encrypted sync across machines with log of exit code, session, command. Fun stats e.g. “most used command”. Option to run your own sync server.",
                        "What we dislike": "Can’t delete entries from history. Default rebind on up-key takes some getting used to, or disable it in config. Only supports zsh and bash.",
                        "Interview": "/interviews/atuin-ellie-huxtable/"
                    },
                    {
                        "Company/Org": "Deepnote",
                        "Tool/Product/Project": "Deepnote",
                        "Reviewed": "2021-05-08",
                        "Scheduled for": "2021-05-13",
                        "URL": "https://deepnote.com",
                        "Category": "Data Science - Collaboration",
                        "Type": "SaaS",
                        "What is it?": "Collaborative Jupyter notebooks.",
                        "Len": "149",
                        "What we like": "Google Docs-style real-time sharing / editing. Detects dependencies, prompts for pip install and updates requirements.txt. Running the Jupyter environment in the cloud saves hassle installing kernels locally. Integrates with git. Public links. Supports Python & R.",
                        "What we dislike": "Visualizations are custom HTML embeds when exported to Jupyter notebook format - better to embed something like Plotly in code to ensure portability.",
                        "Interview": "/interviews/deepnote-jan-matas/"
                    },
                    {
                        "Company/Org": "Skruv",
                        "Tool/Product/Project": "Skruv",
                        "Reviewed": "2021-04-08",
                        "Scheduled for": "2021-05-13",
                        "URL": "https://skruv.io/",
                        "Category": "Developer Tools - Frontend framework",
                        "Type": "Open Source",
                        "What is it?": "No-build, small JS framework.",
                        "Len": "169",
                        "What we like": "No dependencies. No build step. Very small (~400 LoC vDOM, ~100 LoC state management, ~230 LoC HTML helpers). Works with async components. Web tutorial does a good job explaining how it works (built using itself).",
                        "What we dislike": "No router. Great for very simple SPAs, but something like Mithril.js (or Vue. Or Svelte) probably needed for anything of significance (if you don’t mind the build step).",
                        "Interview": ""
                    },
                    {
                        "Company/Org": "Hookdeck",
                        "Tool/Product/Project": "Hookdeck",
                        "Reviewed": "2021-04-30",
                        "Scheduled for": "2021-05-06",
                        "URL": "https://hookdeck.com",
                        "Category": "DevOps - API Management",
                        "Type": "SaaS",
                        "What is it?": "Inbound webhook store and forward proxy.",
                        "Len": "264",
                        "What we like": "Saves building your own queuing system - acts as a proxy to store and forward webhooks. Set up throttling and retry rules. Mirror inbound webhooks to multiple destinations, including a local CLI for testing. Alerts on failures - allows you to search & retry failures so you don’t lose any data.",
                        "What we dislike": "Assumes your webhook destinations are idempotent with “at least once” delivery. No support for signature verification - will forward all requests (you can configure schema filters), so you need to implement this yourself. No support for custom webhook URL domains.",
                        "Interview": "/interviews/hookdeck-alex-bouchard/"
                    },
                    {
                        "Company/Org": "act",
                        "Tool/Product/Project": "act",
                        "Reviewed": "2021-03-24",
                        "Scheduled for": "2021-05-06",
                        "URL": "https://github.com/nektos/act",
                        "Category": "Developer Tools - Local development",
                        "Type": "Open Source",
                        "What is it?": "Run your GitHub Actions locally.",
                        "Len": "154",
                        "What we like": "Local simulation of the GitHub Actions environment using Docker. Much faster than commit/push for testing changes. Supports environment variables and secrets. Can trigger specific events e.g. pull request, push, and jobs within workflows (including skipping steps).",
                        "What we dislike": "Only supports Linux runners (host is multi-platform). Full Docker images are quite large (>20GB), but you can try slimmer images with fewer bundled tools.",
                        "Interview": ""
                    },
                    {
                        "Company/Org": "fselect",
                        "Tool/Product/Project": "fselect",
                        "Reviewed": "2021-04-21",
                        "Scheduled for": "2021-04-29",
                        "URL": "https://github.com/jhspetersson/fselect",
                        "Category": "Misc - Terminal utilities",
                        "Type": "Open Source",
                        "What is it?": "Find files with SQL-like queries.",
                        "Len": "171",
                        "What we like": "Packages for all platforms (+ Nix, AUR, musl). Uses relaxed SQL to support fields e.g. size, path; operators e.g. AND, gte, like; date queries e.g. created, modified; filename glob and regex. Can use .gitignore and search MP3, MIME and other file attributes. Output in CSV, JSON, HTML.",
                        "What we dislike": "Requires the absolute path (~/path doesn’t work), or searches current working directory if no path provided. Be careful to use quotes if you use shell characters such as >",
                        "Interview": ""
                    },
                    {
                        "Company/Org": "Gruntwork",
                        "Tool/Product/Project": "git-xargs",
                        "Reviewed": "2021-04-27",
                        "Scheduled for": "2021-04-29",
                        "URL": "https://github.com/gruntwork-io/git-xargs",
                        "Category": "Developer Tools - Git tools",
                        "Type": "Open Source",
                        "What is it?": "Execute commands across multiple git repos.",
                        "Len": "205",
                        "What we like": "Write a script to make a change to a single Git repo, then apply that change across multiple (specified in a list, or entire GitHub Org). Executes in parallel. Can open GitHub PRs with changes. Lots of use cases for otherwise tedious work e.g. name changes, updating dependencies, mass config changes.",
                        "What we dislike": "Only supports GitHub PRs, but can push remote branches. Releases only available as binaries, no packages (you can use go get). Sometimes scripting these things actually takes longer than doing it manually.",
                        "Interview": ""
                    },
                    {
                        "Company/Org": "KeyDB",
                        "Tool/Product/Project": "KeyDB",
                        "Reviewed": "2021-03-08",
                        "Scheduled for": "2021-04-22",
                        "URL": "https://keydb.dev/",
                        "Category": "Database - KV store",
                        "Type": "Open Source",
                        "What is it?": "A multi-threaded high-performance fork of Redis.",
                        "Len": "167",
                        "What we like": "Drop-in replacement for Redis. Claims x5 speed boost from multi-threading. Adds some extra features like backup to S3 and active replication. Potentially reduces operational complexity by shifting scaling to CPU cores and network throughput rather than requiring clustering.",
                        "What we dislike": "Runs the normal Redis event loop on multiple threads which requires locking (low contention, but work ongoing to improve). Expects exclusive use of assigned CPU cores.",
                        "Interview": "/interviews/keydb-john-sully/"
                    },
                    {
                        "Company/Org": "Ranga Vadhineni",
                        "Tool/Product/Project": "Thunder Client",
                        "Reviewed": "2021-04-06",
                        "Scheduled for": "2021-04-22",
                        "URL": "https://www.thunderclient.io/",
                        "Category": "Developer Tools - Local development",
                        "Type": "Desktop",
                        "What is it?": "An HTTP client for VS Code.",
                        "Len": "106",
                        "What we like": "Easily build HTTP requests with custom params, auth (basic, bearer, OAuth), headers and body (text, JSON, XML, form, GraphQL). Parses and syntax highlights response, headers and cookies. Can create automated tests with conditions such as response time, status codes, headers, etc.",
                        "What we dislike": "All local - no config sync or dynamic loading from config files, but configs can be exported and imported.",
                        "Interview": ""
                    },
                    {
                        "Company/Org": "Retool",
                        "Tool/Product/Project": "REST API Generator",
                        "Reviewed": "2021-04-09",
                        "Scheduled for": "2021-04-15",
                        "URL": "https://retool.com/api-generator/",
                        "Category": "DevOps - API Management",
                        "Type": "SaaS",
                        "What is it?": "Build an API to develop against.",
                        "Len": "116",
                        "What we like": "Create a read/write REST API to start building against before your backend is ready. Supports all HTTP verbs. Lots of default field types with sample data e.g. location, emails, avatars, credit cards.",
                        "What we dislike": "Limited to 150 rows. Hosted by a third party, so don’t send anything sensitive. Deleted after 30 days of inactivity.",
                        "Interview": ""
                    },
                    {
                        "Company/Org": "Nelson Elhage",
                        "Tool/Product/Project": "llama",
                        "Reviewed": "2021-04-13",
                        "Scheduled for": "2021-04-15",
                        "URL": "https://github.com/nelhage/llama",
                        "Category": "Cloud - Serverless",
                        "Type": "Open Source",
                        "What is it?": "CLI for parallelizing commands inside AWS Lambda.",
                        "Len": "199",
                        "What we like": "Makes it easy to burst parallelizable commands into Lambda. Uses Go template language for managing input and output. Supports Docker wrappers to bootstrap environments. Includes a drop-in GCC/clang replacement for outsourcing compilation.",
                        "What we dislike": "Lambda is CPU and memory constrained, and the network is a bottleneck, so use cases are constrained to where parallelization makes a big difference (or there is a benefit to freeing local resources).",
                        "Interview": ""
                    },
                    {
                        "Company/Org": "Typesense",
                        "Tool/Product/Project": "Typesense",
                        "Reviewed": "2021-03-24",
                        "Scheduled for": "2021-04-08",
                        "URL": "https://typesense.org",
                        "Category": "Developer Tools - Site Search",
                        "Type": "Open Source",
                        "What is it?": "Fast, typo-tolerant search engine.",
                        "Len": "156",
                        "What we like": "Single binary (C++) runs natively on Linux and macOS. Tunable ranking for relevancy score tie-breaks. Sort at query-time without additional indexes. Scoped API keys. InstantSearch.js adapter. REST API with clients for JS, PHP, Python, Ruby. Open source + cloud option.",
                        "What we dislike": "Need to build your own index updater mechanism to process new data. API-only means you need to build your own UI/admin. Only supports Latin-based languages.",
                        "Interview": "/interviews/typesense-jason-bosco/"
                    },
                    {
                        "Company/Org": "Svix",
                        "Tool/Product/Project": "Svix",
                        "Reviewed": "2021-04-05",
                        "Scheduled for": "2021-04-08",
                        "URL": "https://www.svix.com/",
                        "Category": "DevOps - API Management",
                        "Type": "SaaS",
                        "What is it?": "Webhook infrastructure as a service.",
                        "Len": "119",
                        "What we like": "Offering webhooks is actually more complex than you'd expect. Diahook deals with signing requests, queueing, retries, reliability, auth, E2E encryption, rate limiting, logs and debugging.",
                        "What we dislike": "You need to send your events to Diahook, which means you still need to ensure they get there (retries, debugging, etc).",
                        "Interview": "/interviews/svix-tom-hacohen/"
                    },
                    {
                        "Company/Org": "Temporal",
                        "Tool/Product/Project": "Temporal",
                        "Reviewed": "2021-03-16",
                        "Scheduled for": "2021-04-01",
                        "URL": "https://temporal.io/",
                        "Category": "Developer Tools - Workflow management",
                        "Type": "Open Source",
                        "What is it?": "Framework for workflow orchestration.",
                        "Len": "161",
                        "What we like": "Deals with the underlying infrastructure for reliable task execution: state management, retries, scaling, fault tolerance. Avoid building and running your own timers / queues - just write the function business logic. Open source server you can run yourself, or use their cloud option (in private beta).",
                        "What we dislike": "SDKs are still being built out (currently available for Go, Java, PHP, Ruby). You still need to run / scale your own database (Cassandra, MySQL, or PostgreSQL). ",
                        "Interview": "/interviews/temporal-manu-srivastava/"
                    },
                    {
                        "Company/Org": "Mirage JS",
                        "Tool/Product/Project": "Mirage JS",
                        "Reviewed": "2021-03-29",
                        "Scheduled for": "2021-04-01",
                        "URL": "https://miragejs.com",
                        "Category": "Developer Tools - Testing frameworks",
                        "Type": "Open Source",
                        "What is it?": "API mocking library for frontend developers.",
                        "Len": "189",
                        "What we like": "Intercepts all XMLHttpRequest and fetch requests so no code changes required (one additional import). Includes in-memory database for persistence tests. Can simulate slow responses or errors. Built-in ORM handles data relationships, output formatting, serialization.",
                        "What we dislike": "Only supports REST APIs out of the box - GraphQL available as an optional plugin (still in development). Runs in the browser, not as a server, so it cannot be used to mock server-side APIs.",
                        "Interview": ""
                    },
                    {
                        "Company/Org": "git-plan",
                        "Tool/Product/Project": "git-plan",
                        "Reviewed": "2021-03-30",
                        "Scheduled for": "2021-04-01",
                        "URL": "https://github.com/synek/git-plan",
                        "Category": "Developer Tools - Git tools",
                        "Type": "Open Source",
                        "What is it?": "Git workflow for planning / writing commits in advance.",
                        "Len": "206",
                        "What we like": "Forces you to think about what you are going to work on in advance - writing out a plan probably helps improve your thinking, and also creates better commit messages. If you think of something you need to switch to, you can create a plan whilst it’s still top-of-mind, then come back to it later.",
                        "What we dislike": "Unintuitive to begin with, but makes sense once you try it (see blog posts linked in the project readme for guidance). Interactive rebasing is an alternative that doesn’t force you to reverse your workflow.",
                        "Interview": ""
                    },
                    {
                        "Company/Org": "WayScript",
                        "Tool/Product/Project": "WayScript",
                        "Reviewed": "2021-03-05",
                        "Scheduled for": "2021-03-25",
                        "URL": "https://wayscript.com",
                        "Category": "Cloud - PaaS",
                        "Type": "SaaS",
                        "What is it?": "Rapid API scripting platform.",
                        "Len": "164",
                        "What we like": "Quickly create step function APIs from lots of pre-built integrations. Cron support. Connect to external data sources and manipulate data. Write real Python, JS, Java, shell script, GraphQL, HTML, and SQL (including using packaged dependencies) as separate steps. Configurable editor e.g. use vim keybindings, tabs vs spaces, etc.",
                        "What we dislike": "Can be slow to execute (many seconds) especially with lots of steps. Have to use their browser editor - can’t develop and run code locally (this is on the roadmap).",
                        "Interview": "/interviews/wayscript-jesse-orshan/"
                    },
                    {
                        "Company/Org": "Buddy",
                        "Tool/Product/Project": "Buddy",
                        "Reviewed": "2021-03-01",
                        "Scheduled for": "2021-03-25",
                        "URL": "https://buddy.works/",
                        "Category": "DevOps - CI/CD",
                        "Type": "SaaS",
                        "What is it?": "CI/CD.",
                        "Len": "135",
                        "What we like": "Fast execution of steps due to caching. Can retry builds from specific steps and live-debug in a terminal which makes setting up pipelines easier. Can switch between UI or YAML config. Commenting/sharing helps team collaboration. UI has useful features, such as env var autocompletion.",
                        "What we dislike": "Ecosystem of official build actions is small relative to GitHub Actions. UI is sometimes confusing due to the number of config options.",
                        "Interview": ""
                    },
                    {
                        "Company/Org": "ORY",
                        "Tool/Product/Project": "Kratos",
                        "Reviewed": "2021-03-11",
                        "Scheduled for": "2021-03-18",
                        "URL": "https://www.ory.sh/kratos",
                        "Category": "Security - Authentication",
                        "Type": "Open Source",
                        "What is it?": "Cloud native user management.",
                        "Len": "214",
                        "What we like": "Open source & self hosted: you probably don't want to build all your own user management (signup, login, MFA, FIDO2, etc) but do care about control and ownership. Runs as a compact, single Go binary. JSON Schema data model. Headless; example UI and API SDKs for Python, PHP, Node, Go, Java, Ruby. Scale horizontally.",
                        "What we dislike": "Focus on APIs means there is no admin UI. Federation (OAuth2, OpenID) requires a separate project (ORY Hydra). \"Scale horizontally\" still means you need to scale your own RDBMS. Pre-1.0, targeting \"stable\" in 2022.",
                        "Interview": ""
                    },
                    {
                        "Company/Org": "Chris Walz",
                        "Tool/Product/Project": "bit",
                        "Reviewed": "2021-03-01",
                        "Scheduled for": "2021-03-18",
                        "URL": "https://github.com/chriswalz/bit",
                        "Category": "Developer Tools - Git tools",
                        "Type": "Open Source",
                        "What is it?": "git CLI.",
                        "Len": "169",
                        "What we like": "Autocomplete and flag suggestions. Commands such as release or sync combine several commands in one to speed up common tasks. Branch autocomplete for checkout. GitHub PR integration. Support for themes. Open source & cross platform.",
                        "What we dislike": "Not what you might expect from a cli: you run the bit command, then it suggests subcommands and flags, rather than tab completion. Official OS packages missing on Linux.",
                        "Interview": "/interviews/bit-chris-walz/"
                    },
                    {
                        "Company/Org": "Bird Eats Bug",
                        "Tool/Product/Project": "Bird Eats Bug",
                        "Reviewed": "2021-03-01",
                        "Scheduled for": "2021-03-11",
                        "URL": "https://birdeatsbug.com",
                        "Category": "Developer Tools - Testing frameworks",
                        "Type": "Desktop",
                        "What is it?": "Screensharing with technical metadata.",
                        "Len": "64",
                        "What we like": "Captures screenshare and click journey with associated metadata like console and network logs. Local-first; uploadable for sharing (private or public). Quick submit to JIRA, Linear, Trello, GitHub",
                        "What we dislike": "Chrome only (works on Microsoft Edge). More integrations needed.",
                        "Interview": ""
                    },
                    {
                        "Company/Org": "Earthly",
                        "Tool/Product/Project": "Earthly",
                        "Reviewed": "2021-03-04",
                        "Scheduled for": "2021-03-11",
                        "URL": "https://earthly.dev",
                        "Category": "DevOps - Containers",
                        "Type": "Open Source",
                        "What is it?": "Containerized reproducible builds.",
                        "Len": "102",
                        "What we like": "Runs existing build steps inside a container using your existing CI system (Jenkins, CircleCI, GitHub Actions, etc). This makes builds reproducible locally so they run the same on your laptop as in remote CI. Steps can be parallelized. Dependency caching locally and across repos.",
                        "What we dislike": "Assumes you are building an already containerized application. Multi-platform builds are experimental.",
                        "Interview": "/interviews/earthly-adam-gordon-bell/"
                    },
                    {
                        "Company/Org": "Microsoft",
                        "Tool/Product/Project": "Playwright",
                        "Reviewed": "2021-03-03",
                        "Scheduled for": "2021-03-04",
                        "URL": "https://playwright.dev",
                        "Category": "Developer Tools - Testing frameworks",
                        "Type": "Open Source",
                        "What is it?": "Automate Chromium, Firefox & Webkit with a single API.",
                        "Len": "163",
                        "What we like": "Single API to launch and script Chromium, Firefox and WebKit. Emulate devices for testing responsiveness. Auto-wait API avoids hard coding timeouts. Extract screenshots, video and debug info. Library for JS, TypeScript, Python, C#, Java. Works on Windows, macOS, Linux.",
                        "What we dislike": "Only supports latest browser versions - can’t pick older versions to test against. Browser binaries are quite large so may slow down CI/CD (cache is configurable).",
                        "Interview": ""
                    },
                    {
                        "Company/Org": "Stoplight",
                        "Tool/Product/Project": "Stoplight",
                        "Reviewed": "2021-03-02",
                        "Scheduled for": "2021-03-04",
                        "URL": "https://stoplight.io",
                        "Category": "DevOps - API Management",
                        "Type": "SaaS",
                        "What is it?": "API design and development platform.",
                        "Len": "186",
                        "What we like": "Build OpenAPI (v2 Swagger or v3) compliant APIs with auto-generated docs, example code, and mocking. Write docs in Markdown. Save everything (and load existing APIs) from Git. Offline/local dev support with desktop API studio app.",
                        "What we dislike": "Limited ability to customize doc output to fit into your own design/brand. Some editor/docs UI bugs in Firefox. It does work without using OpenAPI specs, but most features assume you do.",
                        "Interview": ""
                    },
                    {
                        "Company/Org": "Raycast",
                        "Tool/Product/Project": "Raycast",
                        "Reviewed": "2021-02-22",
                        "Scheduled for": "2021-02-25",
                        "URL": "https://raycast.com",
                        "Category": "Misc - OS",
                        "Type": "Desktop",
                        "What is it?": "Quick-launcher for developers.",
                        "Len": "124",
                        "What we like": "Search cloud and local documents. Clipboard history. Manage GitHub PRs, JIRA issues, join Zoom calls, schedule calendar blocks. API and scripting to create your own commands. Tiling window management. Connects directly to remote services to avoid privacy issues.",
                        "What we dislike": "macOS only. Shortcuts for sub-commands are difficult to find. File search requires scoping rather than searching everywhere.",
                        "Interview": "/interviews/raycast-petr-nikolaev/"
                    },
                    {
                        "Company/Org": "DBCLI",
                        "Tool/Product/Project": "DBCLI",
                        "Reviewed": "2021-02-22",
                        "Scheduled for": "2021-02-25",
                        "URL": "https://www.dbcli.com",
                        "Category": "Database - Management",
                        "Type": "Desktop",
                        "What is it?": "CLIs for databases.",
                        "Len": "224",
                        "What we like": "Autocomplete and syntax highlighted output. Support for Postgres, MySQL, SQLite, MSSQL, Redis, AWS Athena. History, search, vi/Emacs keybindings, saved queries. Open source & cross-platform.",
                        "What we dislike": "Only available via pip or brew - official OS packages would make installation easier to integrate with native package management. Installation on Windows is a hassle due to needing Python. Large results don't line-wrap well.",
                        "Interview": ""
                    },
                    {
                        "Company/Org": "Accurics",
                        "Tool/Product/Project": "Terrascan",
                        "Reviewed": "2021-02-16",
                        "Scheduled for": "2021-02-18",
                        "URL": "https://github.com/accurics/terrascan",
                        "Category": "Developer Tools - Testing frameworks",
                        "Type": "Open Source",
                        "What is it?": "Static code analyzer for Infrastructure as Code.",
                        "Len": "153",
                        "What we like": "Scans Terraform, k8s, and Helm configs for security and compliance. Supports AWS, Azure, GCP, Kubernetes, GitHub and has lots of sensible policy defaults which can be extended using the Open Policy Agent Rego language. Can be run in CI/CD.",
                        "What we dislike": "Docs need work: quickstart didn't work smoothly and default policies are not well explained. Explanations of how to rectify policy violations would help.",
                        "Interview": ""
                    },
                    {
                        "Company/Org": "Oso",
                        "Tool/Product/Project": "Oso",
                        "Reviewed": "2021-02-15",
                        "Scheduled for": "2021-02-18",
                        "URL": "https://www.osohq.com/",
                        "Category": "Security - Authentication",
                        "Type": "Open Source",
                        "What is it?": "A system for building application authorization.",
                        "Len": "114",
                        "What we like": "Flexible, declarative language for describing simple or complex access control rules in code. Easy to test policies. Native libraries for NodeJS, Java, Python, Ruby, Go, Rust. Useful tooling: debugger, tracer, and VS Code integration.",
                        "What we dislike": "Focused only on authorization, so you need to build your own authentication (signup, login, forgot password, etc).",
                        "Interview": "/interviews/oso-sam-scott/"
                    },
                    {
                        "Company/Org": "GitPod",
                        "Tool/Product/Project": "GitPod",
                        "Reviewed": "2021-02-09",
                        "Scheduled for": "2021-02-11",
                        "URL": "https://www.gitpod.io",
                        "Category": "Developer Tools - IDE",
                        "Type": "SaaS",
                        "What is it?": "Dev environments as code and hosted in the cloud.",
                        "Len": "252",
                        "What we like": ".gitpod.yml file in the repo describes the full dev environment so it's version controlled and always up to date. GitPod pre-builds after every commit so the environment is ready when you activate it. VS Code in the browser means you can develop anywhere on any machine. Easily switch workspaces e.g. to review a pull request without disrupting your current environment. Self-hosted version so you can run it all yourself (some features limited to paid license).",
                        "What we dislike": "Limited IDE support - VS Code or Theia (based on VS Code) means you have to code in the browser so you can't use your own IDE/editor (support for other IDEs in development). Requires you to be online with good connectivity because everything is remote.",
                        "Interview": "/interviews/gitpod-christian-weichel/"
                    },
                    {
                        "Company/Org": "asdf",
                        "Tool/Product/Project": "asdf",
                        "Reviewed": "2021-02-04",
                        "Scheduled for": "2021-02-11",
                        "URL": "https://asdf-vm.com/",
                        "Category": "Developer Tools - Dependency management",
                        "Type": "Open Source",
                        "What is it?": "A CLI to manage language runtimes.",
                        "Len": "103",
                        "What we like": "Makes it easy to switch language runtime versions without messing up the system install (if any). Lots of plugins so it supports pretty much every language. Configs can be defined in a per-project file so it can auto switch based on current working directory. Means you can forget about language specific virtual environments because asdf manages them for you. Has an official GitHub Action.",
                        "What we dislike": "Language support is via community plugins so quality is variable. Windows support still in development.",
                        "Interview": ""
                    },
                    {
                        "Company/Org": "StackHawk",
                        "Tool/Product/Project": "StackHawk",
                        "Reviewed": "2021-02-05",
                        "Scheduled for": "2021-02-11",
                        "URL": "https://www.stackhawk.com/",
                        "Category": "Developer Tools - Dependency management",
                        "Type": "SaaS",
                        "What is it?": "Black box security scanning for developers.",
                        "Len": "300",
                        "What we like": "An easy way for developers to run a standardized suite of black box tests. Spiders and auto-discovers endpoints so there is almost zero config. Runs inside a container so it can be run anywhere. Web UI highlights and prioritizes all detected vulnerabilities. Can easily be run locally against any local or remote endpoint. Built on top of open source OWASP ZAP. Good quality documentation. Integrations into CI/CD e.g. GitHub Actions, GitLab, CircleCI.",
                        "What we dislike": "Assumes you know about OWASP and how to resolve highlighted issues. The nature of black box testing means some OWASP issues are false positives and are not comprehensive e.g. no detection of dependency vulnerabilities. Large example app takes >25min to scan (although our own simple app took <1 min).",
                        "Interview": "/interviews/stackhawk-scott-gerlach/"
                    },
                    {
                        "Company/Org": "Opstrace",
                        "Tool/Product/Project": "Opstrace",
                        "Reviewed": "2021-02-02",
                        "Scheduled for": "2021-02-04",
                        "URL": "https://opstrace.com",
                        "Category": "DevOps - Observability",
                        "Type": "Open Source",
                        "What is it?": "A management layer on top of independent open source observability tools.",
                        "Len": "368",
                        "What we like": "Automates deployment of Prometheus, Cortex, and Loki and configures them to store data in your own S3 or GCS buckets. This means you keep control of the data and the price of storage from your existing cloud provider.  Supports multiple tenants e.g. prod vs dev, and deals with scaling them. Existing Prometheus instances can be configured to send data to Opstrace.",
                        "What we dislike": "Installation and cluster management are the main differentiator - otherwise it's just packaging open source projects. API uses an Opstrace managed endpoint - custom domains supported only in the commercial version which is hidden behind \"contact us\". If you already have Prometheus, you could just set up Cortex yourself. Only supports AWS and GCP. No Windows support.",
                        "Interview": ""
                    },
                    {
                        "Company/Org": "Nushell",
                        "Tool/Product/Project": "Nushell",
                        "Reviewed": "2021-02-02",
                        "Scheduled for": "2021-02-04",
                        "URL": "https://www.nushell.sh",
                        "Category": "Developer Tools - Shells",
                        "Type": "Open Source",
                        "What is it?": "A shell where everything is data.",
                        "Len": "215",
                        "What we like": "The first thing you notice is running `ls` outputs a structured table. All output is actually data, so it is like interacting with a spreadsheet. Nushell applies the Unix philosophy of piping commands but allows for commands like `ls | where size > 1kb`. Supports parsing data like CSV and JSON. You can script your own commands. Cross platform.",
                        "What we dislike": "Although it can be run as a command, it is designed to replace your existing shell. It is still in development so may not be stable. You will have to reconfigure everything if you have heavily customized your shell.",
                        "Interview": ""
                    },
                    {
                        "Company/Org": "EteSync",
                        "Tool/Product/Project": "Etebase",
                        "Reviewed": "2021-02-03",
                        "Scheduled for": "2021-02-04",
                        "URL": "https://www.etebase.com/",
                        "Category": "Developer Tools - Backend framework",
                        "Type": "Open Source",
                        "What is it?": "E2E encrypted Firebase-like database and SDK.",
                        "Len": "207",
                        "What we like": "Open source end-to-end encryption based on libsodium. SDKs for JS, Python, Java, Kotlin, C/C++, Rust. Handles sync and user sharing e.g. users collaborating on an encrypted doc. Has specialist types for calendars, tasks, and Markdown notes. Supported by a foundation and a European Commission program.",
                        "What we dislike": "A cloud service by default but you can run their open source server component. No pricing yet for the commercial cloud version. Large files not supported (on the roadmap). Local cache but no offline storage.",
                        "Interview": ""
                    },
                    {
                        "Company/Org": "Infracost",
                        "Tool/Product/Project": "Infracost",
                        "Reviewed": "2021-01-27",
                        "Scheduled for": "2021-01-28",
                        "URL": "https://github.com/infracost/infracost",
                        "Category": "DevOps - Infrastructure automation",
                        "Type": "Open Source",
                        "What is it?": "Cloud cost estimates for Terraform.",
                        "Len": "209",
                        "What we like": "Integrates with CI (GitHub, GitLab, CircleCI, Bitbucket) to provide cost diffs for pull requests. Supports AWS and Google Cloud.",
                        "What we dislike": "Uses a Cloud Pricing API provided (for free) by the Infracost project so it requires sending data to it (you can self-host). May be out of date. Only supports AWS and Google Cloud. Other cloud vendors planned.",
                        "Interview": "/interviews/infracost-ali-khajeh-hosseini/"
                    },
                    {
                        "Company/Org": "LocalStack",
                        "Tool/Product/Project": "LocalStack",
                        "Reviewed": "2021-01-27",
                        "Scheduled for": "2021-01-28",
                        "URL": "https://localstack.cloud/",
                        "Category": "Developer Tools - Local development",
                        "Type": "Other",
                        "What is it?": "Test/mocking framework replicating AWS APIs locally.",
                        "Len": "217",
                        "What we like": "Deploy a full AWS stack in a local Docker container. Avoid paying for AWS environments for test/dev. Supports key AWS services like DynamoDB, EC2, Kinesis, Lambda, Route53, SNS, SQS. Allows you to inject errors.",
                        "What we dislike": "Some APIs require the paid version e.g. CloudFront, Cognito, ElastiCache, Glacier, RDS. Not built by AWS so will always lag behind the real thing. Good for dev but testing probably better done against the actual APIs.",
                        "Interview": ""
                    },
                    {
                        "Company/Org": "rsync.net",
                        "Tool/Product/Project": "rclone on rsync.net",
                        "Reviewed": "2021-01-27",
                        "Scheduled for": "2021-01-28",
                        "URL": "https://www.rsync.net/products/universal.html",
                        "Category": "Cloud - Storage",
                        "Type": "Other",
                        "What is it?": "Store immutable backups of cloud accounts.",
                        "Len": "243",
                        "What we like": "rsync.net is a Unix (ZFS) filesystem over SSH but also supports commands like borg, git, rsync, s3cmd, and now rclone. rclone is a separate open source project that exposes many cloud accounts as filesystems e.g. Google Photos, Dropbox, Azure Blob storage. rsync.net connects directly so you can copy from one to the other without downloading/uploading.",
                        "What we dislike": "This is truly a filesystem over SSH so you need to know your way around the command line. Documentation is limited and the account manager UI is dated. No support for scheduling execution so you need to handle that yourself e.g. cron, systemd.",
                        "Interview": "/interviews/rsync-john-kozubik/"
                    },
                    {
                        "Company/Org": "laktak",
                        "Tool/Product/Project": "extrakto for tmux",
                        "Reviewed": "2021-01-22",
                        "Scheduled for": "2021-01-28",
                        "URL": "https://github.com/laktak/extrakto",
                        "Category": "Misc - Terminal utilities",
                        "Type": "Open Source",
                        "What is it?": "Quickly select, copy/paste, complete text without a mouse.",
                        "Len": "91",
                        "What we like": "The whole idea behind using the command line is to make things faster, usually using the keyboard. This helps with that goal by improving select, copy and paste inside tmux. It works everywhere, even in SSH sessions. Works with clipboards on Linux, macOS, and Windows.",
                        "What we dislike": "tmux beta release is required for popups, otherwise this currently uses a new split window.",
                        "Interview": ""
                    },
                    {
                        "Company/Org": "Seed",
                        "Tool/Product/Project": "Seed",
                        "Reviewed": "2021-01-20",
                        "Scheduled for": "2021-01-21",
                        "URL": "https://seed.run/",
                        "Category": "DevOps - CI/CD",
                        "Type": "SaaS",
                        "What is it?": "Managed CI/CD pipeline for serverless on AWS.",
                        "Len": "265",
                        "What we like": "Managing lots of individual Lambdas across environments and regions is a pain because of how long it takes to package and deploy, especially with AWS rate limits. Seed hooks into Git and speeds things up by deploying concurrently. Supports Serverless Framework, caching dependencies, and incremental deploys. Built-in Lambda monitoring for errors. Also supports AWS CDK.",
                        "What we dislike": "Only supports AWS Serverless i.e. Lambda, so unless you are 100% Lambda then this will be a separate CD pipeline to manage. Doesn't support other tech like containers, or other platforms like Azure/Google. Those with just a few, simple Lambdas may find it overkill.",
                        "Interview": "/interviews/seed-jay-v/"
                    },
                    {
                        "Company/Org": "Brave",
                        "Tool/Product/Project": "IPFS Support in Brave",
                        "Reviewed": "2021-01-20",
                        "Scheduled for": "2021-01-21",
                        "URL": "https://brave.com/ipfs-support/",
                        "Category": "Misc - OS",
                        "Type": "Open Source",
                        "What is it?": "Support for accessing content over the decentralized network, IPFS.",
                        "Len": "295",
                        "What we like": "Decentralized filesystems allow access to content without relying on a specific host. This makes them resistent to censorship (or outages, deletion, etc). IPFS can be a pain to run, or you have to use a gateway service. Built-in browser support means users don't have to care, just like with HTTP. Brave is based on Chromium (but better privacy than Chrome) so most sites work fine.",
                        "What we dislike": "Brave is still a niche browser, and IPFS is still very early. How much content is hosted on it? Site owners need to upload (pin) their content to IPFS, which isn't necessarily straightforward. Still requires the use of ipfs:// URLs, although DNSLink support for using DNS TXT records is planned.",
                        "Interview": ""
                    },
                    {
                        "Company/Org": "Yifan Gu",
                        "Tool/Product/Project": "VMCLI",
                        "Reviewed": "2021-01-15",
                        "Scheduled for": "2021-01-21",
                        "URL": "https://github.com/gyf304/vmcli",
                        "Category": "Misc - OS",
                        "Type": "Open Source",
                        "What is it?": "Utilities for managing VMs on macOS.",
                        "Len": "92",
                        "What we like": "macOS Big Sur includes a new framework for managing VMs. This CLI makes it easy to run VMs without additional software i.e. using the new Virtualization.framework. Means you don't need Virtual Box, VMWare, etc for simple VM tasks.",
                        "What we dislike": "Obviously macOS-only. Only basic functionality for using VMs (probably fine for developers).",
                        "Interview": "/interviews/vmcli-yifan-gu/"
                    },
                    {
                        "Company/Org": "Vantage",
                        "Tool/Product/Project": "Vantage",
                        "Reviewed": "2021-01-13",
                        "Scheduled for": "2021-01-14",
                        "URL": "https://www.vantage.sh/",
                        "Category": "DevOps - Infrastructure automation",
                        "Type": "SaaS",
                        "What is it?": "AWS Console designed for developers.",
                        "Len": "315",
                        "What we like": "AWS Console UX is not great; Vantage is much cleaner and faster. It connects using a read-only CloudFormation IAM Role and they have detailed documentation about the read-only permissions it requests. \"Views\" nicely segment/group resources, even across accounts and regions, with global search for them all. Cost reporting by view and weekly email reports help you manage budgets better.",
                        "What we dislike": "Does not support all AWS products, currently focused on a few key resources e.g. EC2 instances, VPC Subnets, Route53, etc. Currently read-only, which is good for security and because it's a new tool - plans to add more management features in the future. Also AWS-only, but they are working on other cloud providers.",
                        "Interview": "/interviews/vantage-ben-schaechter/"
                    },
                    {
                        "Company/Org": "Skynet",
                        "Tool/Product/Project": "Skynet",
                        "Reviewed": "2021-01-13",
                        "Scheduled for": "2021-01-14",
                        "URL": "https://siasky.net/",
                        "Category": "Cloud - Storage",
                        "Type": "Open Source",
                        "What is it?": "Decentralized file storage and CDN.",
                        "Len": "180",
                        "What we like": "Web UI and SDKs for uploading files to a decentralized CDN. Uses a blockchain and rewards users who run nodes with coins which can be exchanged for money. Current average cost = $4.16/TB stored + $1.25/TB transferred.",
                        "What we dislike": "Time to first byte 300-500ms may be prohibitatively slow for some use cases. Streaming \"up to 1Gbps\" but what does \"up to\" really mean? Files must be public. Why call it \"Skynet\"?!",
                        "Interview": ""
                    },
                    {
                        "Company/Org": "James Little",
                        "Tool/Product/Project": "Stork Search",
                        "Reviewed": "2021-01-13",
                        "Scheduled for": "2021-01-14",
                        "URL": "https://stork-search.net/",
                        "Category": "Developer Tools - Site Search",
                        "Type": "Open Source",
                        "What is it?": "Fast search for static sites.",
                        "Len": "192",
                        "What we like": "Generate the index of your content, which is then downloaded by the visitor's browser and searched using the JS/WASM library \"locally\" - this is what makes it so fast.",
                        "What we dislike": "Index must be generated manually. It is specifically designed for static sites, so it would need to be hooked into a build process. Would need extra work if you wanted to index a dynamic site.",
                        "Interview": "/interviews/stork-search-james-little/"
                    },
                    {
                        "Company/Org": "Starship",
                        "Tool/Product/Project": "Starship",
                        "Reviewed": "2021-01-06",
                        "Scheduled for": "2021-01-07",
                        "URL": "https://starship.rs",
                        "Category": "Misc - Terminal utilities",
                        "Type": "Open Source",
                        "What is it?": "High-performance, customizable, shell prompt.",
                        "Len": "139",
                        "What we like": "Works with any shell (bash, zsh, fish, PowerShell). Context-sensitive e.g. auto-complete, shows Git info, lots of language specific configs. Written in Rust, which is trendy, and probably fast.",
                        "What we dislike": "Another layer on your shell to mess around with. If you use ZSH then Oh My ZSH already does a lot of this, and has lots of good ZSH tweaks.",
                        "Interview": "/interviews/starship-matan-kushner/"
                    },
                    {
                        "Company/Org": "Wasmer",
                        "Tool/Product/Project": "Wasmer 1.0",
                        "Reviewed": "2021-01-06",
                        "Scheduled for": "2021-01-07",
                        "URL": "https://wasmer.io/",
                        "Category": "Developer Tools - Backend framework",
                        "Type": "Open Source",
                        "What is it?": "An open-source runtime for executing WebAssembly server-side.",
                        "Len": "197",
                        "What we like": "Allows shared libraries to be sandboxed, compiled, then run standalone or embedded in Rust, C/C++, Python, Go. Pluggable compilers allows optimisation of the final artifacts e.g. LLVM for machine code. Wasmer 1.0 adds a headless mode and cross-compilation.",
                        "What we dislike": "The use cases seem limited to untrusted, shared code. If you need cross-platform, native binaries with good performance then why not just use a compiled language like Go or Rust in the first place?",
                        "Interview": ""
                    }
                ],
                "header": [
                    "Company/Org",
                    "Tool/Product/Project",
                    "Reviewed",
                    "Scheduled for",
                    "URL",
                    "Category",
                    "Type",
                    "What is it?",
                    "Len",
                    "What we like",
                    "Len",
                    "What we dislike",
                    "Len",
                    "Interview"
                ],
                "range": "'All Tools'!A1:N70"
            }
        }
    ]
}