{"results":[{"command":{"func":"getData","kwargs":[{"range":"'All Tools'!A:O","hasHeaderRow":true},null]},"result":{"rawData":[["Djinn","Djinn","2023-02-28","2023-03-02","https://djinn.tonic.ai/?signup","Data Science - ML","SaaS","Fake production data for ML.","28","Enables privacy compliant training of ML models on realistic fake data. Connects to your prod database via SQL, transforms (fakes) the data, then trains your model. Provides a report after training to confirm how realistic the trained data was. Supports tabular and event driven models. Export to ipynb. Cloud or self-hosted.","325","No dark mode. Pretty hefty minimum requirements for self-hosting, but ML training is compute & GPU intensive.","109","/interviews/tonic-ander-steel/","TRUE"],["GoReplay","GoReplay","2023-02-28","2023-03-02","https://goreplay.org/","Developer Tools - Testing frameworks","Open Source","Debug with production traffic.","30","Records production network traffic for reproducing issues later. Stores traffic on disk, S3, Kafka, ElasticSearch, etc. Middleware supports sanitizing sensitive data, emitting metrics, etc. Speed up replay for load testing on real traffic. Transparently captures traffic without affecting it (it’s not a proxy). Open source (some features are paid).","349","Requires sudo by default, but can run as a non-root user or by forwarding traffic to it. Windows is not officially supported.","125","","FALSE"],["NoteSH","NoteSH","2023-02-28","2023-03-02","https://github.com/Cvaniak/NoteSH","Misc - Terminal utilities","Open Source","Sticky notes in your terminal.","30","Sticky notes board for your terminal. Works with mouse or keyboard-only. Move, resize both sticky notes and the “board” they’re stuck to. Control over the border and background colors. Notes are saved across sessions and stored in a local JSON file. Open source.","262","No static binary - installed via pip/Python. Main body entry text field doesn’t expand, which makes editing a bit awkward.","122","","FALSE"],["Sym","Sym","2023-02-22","2023-02-23","https://symops.com/","DevOps - Infrastructure automation","SaaS","Access management as code.","26","Link resources in Terraform. Define access rules and workflows in Python. Supports simple approve/deny rules with approvals managed through Slack. But also allows sophisticated rules with routing to teams, auto approval based on who is on call, remove access or de-escalate privileges on events e.g. after going off-call or after a time. Full audit logs.","354","Requires use of Terraform e.g. no support for AWS CDK. Only supports writing rules in Python.","93","","TRUE"],["Tokei","Tokei","2023-02-22","2023-02-23","https://github.com/XAMPPRocky/tokei","Misc - Terminal utilities","Open Source","Code statistics.","16","Counts lines of code very quickly (millions of lines per second) to output stats for lines, code lines, comments, and blanks. Breaks out counts per language. Understands language specific syntax and supports basically every language. Single static (Rust) binary and can be also imported as a library.","300","No stable release since Jan 2021, but does have recent commit history.","70","","FALSE"],["rtx","rtx","2023-02-22","2023-02-23","https://github.com/jdxcode/rtx","Developer Tools - Dependency management","Open Source","Local runtime manager.","22","CLI and shell plugin to auto-switch runtime versions based on per-directory configuration. Reads tool versions file(s) to determine which runtime to install and link to. Supports Bash, Zsh, Fish, Xonsh. Supports asdf plugins. Designed for performance by not using shims (~120ms overhead in asdf) instead updating PATH to directly call runtimes.","344","No Windows support. Can conflict with direnv.","45","","FALSE"],["OpsLevel","OpsLevel","2023-02-15","2023-02-16","https://www.opslevel.com/?utm_source=consoledev&utm_medium=ppc","Developer Tools - Dependency management","SaaS","Developer portal.","17","Catalog and manage all your internal repos, tools, and services. Allows developers self-service access to provision infrastructure, call APIs, and understand ownership. Useful integrations e.g. CI/CD to view deployments, observability for metrics and SLOs, incident management to escalate on-call issues, etc. Pulls in Markdown docs from the repo automatically.","361","No dark mode. Service config can be in an opslevel.yml file in each service repo, but actions and checks cannot - they must be configured via the OpsLevel UI.","158","","TRUE"],["tbls","tbls","2023-02-15","2023-02-16","https://github.com/k1LoW/tbls","Database - Management","Open Source","Auto document databases.","24","Single binary outputs Markdown documentation of your whole database (PG, MySQL, MariaDB, SQLite, BigQuery, & others) with one command. Configurable output format (Markdown, DOT, Mermaid, JSON, even Excel). Can diagram relationships. Includes linting function e.g. require comments. Can diff actual vs documented.","312","It’s a documentation tool, not for migrations or actually creating the tables from scratch from the docs. Limited support for stored procedures and functions.","158","","FALSE"],["Unovis","Unovis","2023-02-15","2023-02-16","https://unovis.dev/","Developer Tools - Frontend framework","Open Source","Data visualization library.","27","Web library for plotting SVG charts, maps, network graphs. Modular and framework-independent - works with React, Angular, Svelte, TS. Easily customizable plots e.g. axis, labels, ticks, and styling using CSS variables. Supports events for mouseover and mouseout. Includes a dark theme for all components. ","305","Legend is a separate component. Offers more control, but then must be configured separately from the graph component.","117","","FALSE"],["UseCSV","UseCSV","2023-02-08","2023-02-09","https://usecsv.com/","Developer Tools - Frontend framework","SaaS","Data import component.","22","Drop-in component for CSV/Excel import rather than building your own - React, Vue, Angular, or JS. Themeable. Can validate fields e.g. email, phone, number. Imported data is sent as JSON via webhook or JS callback. Webhook defaults to batches of 1,000 rows to allow you to process them - waits for a response before continuing.","327","Need to use the JS callback if you want to keep everything on your own servers.","79","","TRUE"],["Bottom","Bottom","2023-02-08","2023-02-09","https://clementtsang.github.io/bottom/0.8.0/","Misc - Terminal utilities","Open Source","Terminal system monitor.","24","Single static (Rust) binary that displays a real-time system monitor dashboard in the terminal. Supports widgets for CPU, memory, battery, processes, disk, network. Can expand widgets and navigate using the keyboard or mouse. Configurable via a file, including widget layout. Theme inherits from the terminal or can be customized.","330","Limited number of widgets. Keybindings not customizable.","56","","FALSE"],["Kysely","Kysely","2023-02-08","2023-02-09","https://github.com/koskimas/kysely","Database - Management","Open Source","Typesafe SQL for TypeScript.","28","Prevents mistakes by providing types for SQL queries. Understands fields types, joins, subqueries, aliases, and other advanced SQL features. Also supports dialects from databases like Planetscale, D1, AWS, etc. Enables autocomplete in your IDE. Migrations can also be written in TypeScript.","290","Only works with Postgres, MySQL & SQLite. A third-party project is needed if you want to auto-generate schema definitions.","122","","FALSE"],["CloudQuery","CloudQuery","2023-02-01","2023-02-02","https://www.cloudquery.io/","DevOps - Infrastructure automation","Open Source","Query your infrastructure.","26","ELT-like sync from source(s) to destination(s). Sources can be APIs e.g. AWS or GCP resources, SaaS e.g., HubSpot, PagerDuty, or infra e.g. Terraform, Vercel. Destinations can be databases e.g. Postgres, SQLite, or cloud e.g. S3. Full sync or incremental changes. Typed fields. Option to maintain old records or remove them. Open source.","337","Concurrency may need to be tweaked to avoid rate limits when syncing resources, but this will increase sync times. Incremental sync only supports local state.","158","","TRUE"],["Modern Errors","Modern Errors","2023-02-01","2023-02-02","https://github.com/ehmicky/modern-errors","Developer Tools - Frontend framework","Open Source","Proper errors for JS/TS.","24","Library to provide structured errors in JS/TS. Set props on errors with typed fields. Wrap, aggregate, normalize errors. Core library provides base functionality which can be extended via plugins. Official plugins for specialist cases: CLI (colorized, pretty print, verbosity levels), HTTP (structured HTTP responses), clean stack traces, and others. Open source.","363","JS/TS only. Be sure to configure TS to output ES modules, not CommonJS.","71","","FALSE"],["Llama","Llama","2023-02-01","2023-02-02","https://github.com/antonmedv/llama","Misc - Terminal utilities","Open Source","Terminal file browser.","22","Minimalist CLI designed just to make it easier to navigate directories i.e. a replacement for `cd` and `ls`. Fuzzy search makes it navigating through the directory tree very fast. Shortcuts to preview, delete files, and exit with or with navigating to the directory. Prebuilt binaries for Mac, Linux, Windows. Open source.","322","Requires a workaround to work properly in PowerShell. Have to trigger fuzzy search on every directory change.","109","","FALSE"],["Retool","Retool","2023-01-22","2023-01-26","https://retool.com/?utm_source=sponsor&utm_medium=newsletter&utm_campaign=consoledev","Developer Tools - UI Builder","SaaS","Internal tool builder.","22","Impressive level of UI flexibility and customization - simple drag & drop to writing custom JS & React with external dependency support. Auto-generates UIs from database schemas including those tedious features like sorting, pagination, filtering & search. Real browser devtools-like debugger. Can also build native mobile apps and automated data pipelines & workflows.","369","Themable, but no true dark mode. Remotely querying databases over the internet has inherent latency challenges (you can self-host Retool or use their cloud database).","166","","TRUE"],["Canary Tokens","Canary Tokens","2023-01-22","2023-01-26","https://canarytokens.org/generate","Security - Vulnerability management","SaaS","Breach detection honeypot tokens.","33","Generate honeypot files (Word, Excel, PDF, executables) and tokens (AWS) which send alerts when triggered e.g. when a file is opened or the API credentials are used. Also supports DNS record, MySQL dump and other types of honeypot tokens. Email or webhook URL notifications. Provides another layer of detection e.g. from malware scraping credentials from laptops. Free service.","377","Token types are more-or-less sufficient, but somewhat limited e.g. only supports AWS tokens (Slack tokens were deprecated).","123","","FALSE"],["YouPlot","YouPlot","2023-01-22","2023-01-26","https://github.com/red-data-tools/YouPlot","Misc - Terminal utilities","Open Source","Terminal graphs.","16","Easily take input from stdin or a specified file then plot a graph in the terminal. Supports bar, line, scatter, box plots, histograms and density plots. Minimal setup needed - assumes first column is x axis and second column is y axis, but this is configurable. Can handle real-time data. Uses default terminal colors. Open source.","332","Does not support time series. No static binary - installed via Ruby gem.","72","","FALSE"],["Swimm","Swimm","2023-01-18","2023-01-19","https://swimm.io/","Developer Tools - Documentation","SaaS","Continuous documentation.","25","Enables code to live where it belongs - alongside code (in Markdown). Auto-syncs as you refactor, rename, move code around. Comments on PRs when docs break. Supports Mermaid syntax for diagramming. IDE extensions (VS Code, JetBrains) reveal docs in-context with code. Editor supports dark mode.","294","Need to edit the docs using their editor (or the Markdown directly). In-IDE doc authoring is on the roadmap.","108","/interviews/swimm-gilad-navot/","TRUE"],["ov","ov","2023-01-18","2023-01-19","https://github.com/noborus/ov","Misc - Terminal utilities","Open Source","Rich terminal pager.","20","Replaces `less`, `more`, or `tail -f` with more features for parsing text - section delimiters, search, mark position, color highlights, and parsing of columnar text. Mouse support with proper select + copy to clipboard. Keyboard shortcuts. Guides for replacing the pager in other CLIs e.g. psql, git, mysql, procs.","315","Reads the entire file into memory. Default keybindings are different from `less`, so if you rely on them it’s not a drop-in replacement.","136","","FALSE"],["Mailing","Mailing","2023-01-18","2023-01-19","https://www.mailing.run/","Developer Tools - Frontend framework","Open Source","Build emails in React.","22","Provides a dev environment for creating email templates in React - local dev server with previews and a built-in sender for dynamic rendering at runtime. Supports MJML for creating responsive emails that are compatible across clients. Sending API wraps Nodemailer, which has lots of useful features. Open source.","312","Unclear whether it runs properly on Windows (there’s an open GitHub issue about this).","86","","FALSE"],["Zigi","Zigi","2023-01-11","2023-01-12","https://www.zigi.ai/team-leader","Developer Tools - Workflow management","SaaS","Dev team assistant.","19","Provides team and task management workflows within Slack. Understands team load to provide warnings when the team might not complete tasks within a sprint. Shows whether team members are overloaded with tasks, including tasks outside the sprint or assigned to others.","267","Only supports workflows using Slack, JIRA, and GitHub.","54","","TRUE"],["Clipboard","Clipboard","2023-01-11","2023-01-12","https://github.com/Slackadays/Clipboard","Misc - Terminal utilities","Open Source","Terminal clipboard manager.","27","Simple commands to cut, copy and paste. Supports pipe in or out and can read from and write to files (the whole file can be in the clipboard). Use multiple clipboards and show/clear the contents of all. Clipboards exist as temporary files which can be mounted to shared drives to use across systems. Can also make clipboards persistent instead of just temporary.","362","No support for GUI clipboard manager on Wayland (but supports X11, Windows and macOS system clipboards). Installation defaults to compiling source, but you can download binaries if you prefer.","192","","FALSE"],["Devfile","Devfile","2023-01-11","2023-01-12","https://devfile.io/","DevOps - Containers","Open Source","Containerized dev environment config.","37","Well-documented open standard for defining containerized development environments. Supported by several tools for consistent environments locally and in the cloud. Allows the environment to be versioned alongside the code. Can define resource usage limits, environment vars, endpoints. Samples provided in the open registry.","324","Very k8s centric even though the spec can be used generically. Another standard (see xkcd 927).","95","","FALSE"],["lnav","lnav","2023-01-04","2023-01-05","https://lnav.org/","Misc - Terminal utilities","Open Source","Log file viewer.","16","Point at a directory and it auto-detects file formats, parses, colorizes, merges, and displays them in your terminal. Can pretty print structured data e.g. JSON. Search as you type also streams in new log lines. Sessions can be restored. Query and filter the logs with SQL, which includes “virtual tables” to allow for comments, tags, and bookmarking.","351","Official downloads don’t include Arm binaries (although the macOS version via Homebrew is compiled for Apple Silicon). Does not inherit the terminal theme - need to configure custom colors separately.","200","","FALSE"],["SketchyBar","SketchyBar","2023-01-04","2023-01-05","https://github.com/FelixKratz/SketchyBar","Misc - OS","Open Source","Scriptable macOS status bar.","28","Fully customizable - fonts, colors, positions, notch size, animations. Can subscribe to general events e.g. space change as well as OS notification events e.g. Spotify track changed, to trigger scripts. Supports graphing arbitrary values. Items can be linked to spaces. Can pull in items from the macOS status bar e.g. Control Center or WiFi.","342","Config file is a bit fiddly to work with. Community plugins could be more structured - currently just config files + scripts shared in a GitHub discussion thread.","162","","FALSE"],["Tremor","Tremor","2023-01-04","2023-01-05","https://www.tremor.so/","Developer Tools - Frontend framework","Open Source","React dashboard components.","27","Makes it really easy to create good-looking blocks for dashboards. Lots of components from graphs to cards, callouts, tables, and toggles. Each component has an API reference. Includes basic application layout and shells. Components are responsive. Open source.","261","You can choose from 22 different color palettes, but not create custom colors. No dark mode.","92","","FALSE"],["wtfutil","wtfutil","2022-12-14","2022-12-15","https://wtfutil.com/","Misc - Terminal utilities","Open Source","Terminal dashboard.","19","Build a custom dashboard within your terminal. Lots of modules out of the box - IP info, clocks, system status, feed reader, Hacker News feed, GitHub, various monitoring tools, etc. Create custom modules in Go or use a simple command runner module. Customize layout via config file. Cross-platform & open source.","312","Long config files can be a bit annoying to work with. Some stability issues reported on Windows and if there is no internet connection.","135","","FALSE"],["rqlite","rqlite","2022-12-14","2022-12-15","https://github.com/rqlite/rqlite","Database - Relational database","Open Source","Lightweight distributed SQL database.","37","Makes it easy to deploy a replicated cluster of SQLite backed database nodes. Writes distributed to a quorum or they fail. Provides HTTP API, CLI, and client libraries for Go, Python, Node, Java. Runs in-memory, but backed by on-disk Raft logs to avoid data loss risk. Supports full-text search, JSON documents, encryption, hot backups.","336","You must use the HTTP API (directly or via client libraries) to get all the functionality. Writes scale vertically - only reads scale horizontally. 2GB database size limit (switch to on-disk to avoid this, but with a write-performance tradeoff).","245","","FALSE"],["Inngest","Inngest","2022-12-14","2022-12-15","https://www.inngest.com/","Cloud - Serverless","SaaS","Serverless background jobs.","27","Run a serverless function as a background job, in response to an event, on a schedule, or as a webhook. Supports JS and TS with framework integrations for NextJS, Express, Cloudflare Pages & RedwoodJS. Supports multi-step functions. Local dev server. Functions run on your own platform. Open core (paid cloud platform).","319","Functions written in JS/TS-only (but you can trigger events from any language). AWS Lambda is not yet supported. You need to register functions with Inngest after every deploy (which can be automated).","201","","FALSE"],["Finch","Finch","2022-12-07","2022-12-08","https://github.com/runfinch/finch","DevOps - Containers","Open Source","Local container management CLI.","31","Easy to remember commands for building and running containers without having to install/learn multiple tools. Can pull from container registries or build locally (creating an OCI image from a Dockerfile). Supports specifying the platform for running/building for different architectures. Acts as a layer on top of nerdctl so it is effectively Docker compatible, but uses containerd and BuildKit.","395","macOS only (Windows & Linux are on the roadmap). Docs are limited, so you need to work out the commands from the nerdctl docs.","126","","FALSE"],["Spacelift","Spacelift","2022-12-07","2022-12-08","https://spacelift.io/","DevOps - CI/CD","SaaS","CI/CD for IaaC.","15","Understands infrastructure state to allow parallelized runs and collaboration on infrastructure as code changes. Supports Terraform, Pulumi, Cloudformation, and k8s. Integrates into existing workflows e.g. pull requests. Policies allow RBAC and approval flows, defined using Open Policy Agent. Drift detection. Product has some personality e.g. subtle space references in log output.","383","The docs are well written, but there is a steep learning curve and a UI with lots of components to work out.","108","","FALSE"],["humanlog","humanlog","2022-12-07","2022-12-08","https://github.com/aybabtme/humanlog","DevOps - Log management","Open Source","Log parser CLI.","15","Reads logs from stdin and pipes them back to stdout formatted and easier to read. Also adds colors. Options to skip log keys, ignore keys that are the same as the previous entry, and truncate values. Binaries for macOS, Linux, and Windows.","239","Only formats logs in JSON or logfmt - everything else is ignored. No ARM binaries.","82","","FALSE"],["Metrist","Metrist","2022-11-30","2022-12-01","https://metrist.io/","DevOps - Observability","SaaS","Monitor your cloud dependencies.","32","Monitors not just service status pages, but also synthetic tests against APIs to check things like creating an S3 bucket, upload objects, access them, etc. Supports cloud (AWS, GCP, Azure) and SaaS e.g. GitHub, Cloudflare, Google Drive. Degraded (average latency has increased) or down (not responding) alerts. Optional agent to test from within your own account.","363","The Metrist agent can auto discover API calls using eBPF on the OS level. This allows unknown APIs to be monitored, but has some limitations on the traffic it can inspect e.g. outgoing TLS/SSL calls, but only on Linux if they use OpenSSL (dynamically linked).","259","/interviews/metrist-ryan-duffield/","TRUE"],["Nx","Nx","2022-11-30","2022-12-01","https://nx.dev/","DevOps - CI/CD","Open Source","Fast build system.","18","Smart caching and tasks distributed across multiple build agents significantly improves build time. Only runs build tasks with changes. Remote caches can be shared. Migration functionality can keep all workspace dependencies up to date for everyone. Built-in task executors support linting, testing, dev servers, etc.","317","All the examples, docs, core plugins etc, assume you’re working in the JS/TS ecosystem, but it is actually a general purpose build system.","138","","FALSE"],["Hurl","Hurl","2022-11-30","2022-12-01","https://hurl.dev/","API - API","Open Source","HTTP requests & tests with plain text.","38","Define and execute HTTP requests in plain text. Config format makes it easy for anyone to understand and manage. Supports headers, query params, form submissions, APIs, CSRF tokens. Can assert responses for testing e.g. content, headers, JSON body, endpoint performance. Runs as a single binary CLI. Open source.","312","Uses curl underneath, but doesn’t fully support/expose all the features/options. Hurl syntax is custom, so text editors will struggle to highlight and provide autocomplete.","172","","FALSE"],["GoAccess","GoAccess","2022-11-23","2022-11-24","https://goaccess.io/","DevOps - Log management","Open Source","Real time log analyzer.","23","CLI or web UI for real time visualization of logs. Supports most log formats and includes predefined config for AWS CloudFront, S3 & load balancers, Apache, Nginx, GCS, Squid, IIS, Caddy. Can export to JSON or CSV. Single binary - point it at one or many log files and it runs. Packages for all major platforms. Open source.","324","Has limited built-in filtering, but is designed to be composable like any good Unix tool, so you can pipe output through grep, sed, awk, etc. ","142","","FALSE"],["Blink Code","Blink Code","2022-11-23","2022-11-24","https://docs.blink.sh/advanced/code","Developer Tools - IDE","Open Source","VS Code for iOS.","16","iPad optimized version of VS Code integrated into iOS conventions. Can connect to remote environments like Codespaces or SSH to execute code. Blink is a mobile terminal so Blink Code utilizes all of its functionality like using Mosh for reliable connections, customizable shell, keyboard shortcuts etc. Open source.","315","Needs a large iPad to work well. Great for quick mobile edits, or perhaps when traveling, but full development on an iPad feels like too much of a contortion when a full desktop is so much more flexible","202","","FALSE"],["ntfy","ntfy","2022-11-23","2022-11-24","https://ntfy.sh/","API - Communication","Open Source","Send yourself push notifications.","33","Install the app (Android or iOS) and POST to the API to send yourself a notification. Can be a very simple message or include custom titles, priority (Android only), scheduled delivery, action buttons, attachments, icons. Also supports email and a CLI for notifications. Free hosted by the author, or open source so you can run your own private server.","352","Topics are open with read/write access by anyone - access control is supported and you can run your own server to protect it further.","133","","FALSE"],["Saleor","Saleor","2022-11-14","2022-11-17","https://saleor.io/","API - API","Open Source","Open source headless commerce API.","34","Follows 12-factor architecture. Separation of concerns with API backend (Python + GraphQL), admin dashboard, and storefront UI (TS + React) all separate projects/instances. Includes GraphQL Playground to make it easy to test API queries. CLI and SDK for custom storefront implementation, or use NextJS template. Open source or run on their cloud.","346","Storefront and dashboard are static, but the backend APIs need to be managed for scalability. You need to manage your own task runner for background tasks.","155","","TRUE"],["Partytown","Partytown","2022-11-14","2022-11-17","https://partytown.builder.io/","Developer Tools - Dependency management","Open Source","Run scripts in a web worker.","28","Offloads scripts from the main thread to a separate web worker. Allows third-party scripts to be sandboxed and throttled so the main thread can be dedicated to code you control. Easy to enable on any script via a custom attribute, but known to work well with analytics e.g. Google Tag Manager and support e.g. Intercom. Integrates with major frameworks. Open source.","366","Network tab shows lots of proxied requests, which makes it a bit noisy. Not suitable for UI intensive scripts due to DOM throttling. preventDefault() doesn’t work.","163","","FALSE"],["websocketd","websocketd","2022-11-14","2022-11-17","https://github.com/joewalnes/websocketd","DevOps - Web server","Open Source","Anything as a web socket.","25","All your code needs to do is write to stdout and read from stdin. websocketd deals with managing the websocket endpoint. This means you can add websockets to any application in any language. Single binary runs on all platforms - minimal dependencies (written in Go). Includes WebSocket developer console. Open source.","317","Designed as a quick and simple way to get websockets working - each connection opens a new process, which may not work well at scale.","133","","FALSE"],["SonarLint","SonarLint","2022-11-09","2022-11-10","https://www.sonarsource.com/products/sonarlint/?utm_medium=paid&utm_source=consoledev&utm_campaign=sonarlint&utm_content=newsletter","Developer Tools - IDE","Desktop","IDE code quality suggestions.","29","Provides in-line code quality analysis in your IDE as you code. Supports VS Code, JetBrains, Eclipse, Visual Studio. Language specific rules with in-editor docs make it easy to avoid problems e.g. deprecated APIs, complex definitions, useless try/catch branches, etc. Team rules sync. Extensions are open source. ","313","Supports common languages like JS, TS, Python, C, C++, Ruby, Java, PHP, HTML but is missing support for the likes of CSS, Rust and Go.","134","/interviews/sonarsource-olivier-gaudin/","TRUE"],["quicktype","quicktype","2022-11-09","2022-11-10","https://quicktype.io/","API - API","Open Source","Typesafe code from JSON.","24","Web app or CLI to generate typesafe code from JSON, GraphQL or TypeScript. Supports output in lots of languages e.g. Go, Java, Ruby, TypeScript, Elm, Python, Rust. Can parse from files, schemas, or URLs. Also generates a basic client library. Extensions for VS Code, XCode, Visual Studio. Open source.","301","IDE extensions haven’t been updated for a few years.","52","","FALSE"],["mle","mle","2022-11-09","2022-11-10","https://github.com/adsr/mle","Developer Tools - Text editors","Open Source","Terminal text editor.","21","Minimalist approach - small codebase and focus on simplicity by calling out to shell commands for extra functionality e.g. grep. Supports fuzzy search, syntax highlighting, split views, auto indent. Can be scripted and run in headless mode to run edit commands and output the result. Runs on all platforms with official packages. Open source.","342","Default keybindings are somewhat intuitive e.g. Ctrl+S for save, but don’t take advantage of the muscle memory from other terminal editors. Help docs are limited.","162","","FALSE"],["Speakeasy","Speakeasy","2022-11-02","2022-11-03","https://www.speakeasyapi.dev/","DevOps - API Management","SaaS","Developer experience for APIs.","30","Provides endpoint discovery and request monitoring via middleware, which makes it easy to integrate into an existing API. Records API requests for debugging - can be replayed from the dashboard or via a Postman download. API spec drift detection with alerting. Easily create a dashboard for API users to login and review their usage. Sensitive fields can be masked. Cloud or self-hosted. ","388","API integration and instrumentation SDKs only available for Go, Typescript, Java. Self-service API key rotation not yet supported.","130","/interviews/speakeasy-sagar-batchu/","TRUE"],["Robot Framework","Robot Framework","2022-11-02","2022-11-03","https://robotframework.org/","Developer Tools - Testing frameworks","Open Source","Automation as code.","19","Makes it easy to create tests for web, mobile, email, etc. Layered on top of Python so tests can be coded and then set up using the custom Robot syntax. Flexible configuration and tagging makes it easy to vary tests and associated data. Detailed reports show the full execution log for debugging. Community plugins e.g. for Selenium, databases, REST APIs. Open source.","368","Yet another custom language to learn. May just be easier to write tests in the same language / framework as your actual codebase.","129","","FALSE"],["GoatCounter","GoatCounter","2022-11-02","2022-11-03","https://www.goatcounter.com/","DevOps - Observability","Open Source","Lightweight web analytics.","26","Very lightweight stats for your website: visitors, top pages, referrers, etc. Includes automatic bot detection and campaign stats. Tracking JS is very small (3.5 kB) and has the option to use a pixel, trigger from server middleware or import raw logs. Doesn’t track users with IDs. Open source and can be self hosted (written in Go and uses either SQLite or Postgres)","367","It is very lightweight, so if you’re used to Google Analytics you may be disappointed - but do you really need all that data? No dark mode.","139","","FALSE"],["Convex","Convex","2022-10-26","2022-10-27","https://www.convex.dev/","Developer Tools - Backend framework","Open Source","Reactive backend as a service.","30","Makes it easy to build a live-updating web app with a document database. Strictly-typed fully relational schemas defined in code (optional, but recommended). Data mutations are automatically reflected and re-rendered. Built-in dashboard and logging. Can deploy to a hosting provider like Netlify or Vercel, and Convex handles the backend.","338","TypeScript only. All functions must be deterministic, so you need to call external functions to call third-party APIs e.g. Stripe, Vercel functions, etc. Convex provides a client to share the state with those functions.","219","","FALSE"],["Dash","Dash","2022-10-26","2022-10-27","https://kapeli.com/dash","Developer Tools - Documentation","Desktop","Offline documentation.","22","Desktop app for searching and browsing technical docs. Large number of available docsets for languages, frameworks, apps, libraries, and packages. Cheatsheets and user contributed docs, including an offline Stack Overflow. Integrates with editors like VS Code, JetBrains, Vim. Add your own private and shared annotations, which can be shared within teams. Quick launch keyboard shortcut.","387","macOS only - see Zeal, a free, open source alternative for Windows and Linux that uses the same docsets. Images in some docsets still require internet access, e.g. Stack Overflow.","179","","FALSE"],["DuckDB","DuckDB","2022-10-26","2022-10-27","https://duckdb.org/","Database - Relational database","Open Source","In-process SQL database.","24","Designed for very fast data analysis, particularly where whole tables or large joins are involved. Simple to operate - no dependencies and nothing to install because it runs in the host process, thereby increasing performance. Supports complex SQL queries. Fast loading of data from CSV, Parquet, Postgres, SQLite, read/write data from S3.","339","Not designed for high volume transactional queries or where the database needs to be written to from multiple processes.","120","","FALSE"],["Signadot","Signadot","2022-10-19","2022-10-20","https://www.signadot.com/","Developer Tools - Testing frameworks","SaaS","Ephemeral test environments.","28","API, SDK, and CLI for creating sandboxed test environments inside your own infrastructure (or locally). Create parameterized templates with dependencies and fine-grained customizations to test changes to one or many services. Spin up environments from integration tests and CI. Supports resource creation e.g. databases or message queues.","338","Requires Kubernetes. Limited number of resource plugins - MariaDB, Amazon SQS, and RabbitMQ - you need to create your own for anything else.","140","/interviews/signadot-arjun-iyer/","TRUE"],["PopSQL","PopSQL","2022-10-19","2022-10-20","https://popsql.com/","Database - Management","Desktop","Collaborative SQL editor.","25","Set up connections and SQL queries to databases like MySQL, Postgres, BigQuery, MongoDB, etc. Auto-complete query editor with results browser that can visualize and export data. Desktop app or web interface. Queries can be private, shared, or public. Build dashboards and templated UIs to allow others to easily execute queries safely.","335","Desktop app not built for Apple Silicon (works via Rosetta 2 translation, but it becomes a bit laggy). Option for direct connections avoids their cloud service, but also means they can’t be used via their web app version i.e. desktop only.","239","","FALSE"],["jc","jc","2022-10-19","2022-10-20","https://github.com/kellyjonbrazil/jc","Misc - Terminal utilities","Open Source","Convert command output to JSON.","31","Pipe the output of a command to get a JSON translation. Or, run in reverse to have jc execute the command and pick the parser automatically. Supports parsing files e.g. YAML, CSV, /etc/hosts. Colorizes output by default. Supports streaming e.g. commands like ping which provide continual output. Tool and parsers open source. Also available as a Python package.","361","When piping you need to specify the parser - there are lots of options, but not every command is supported.","107","","FALSE"],["Semgrep Supply Chain","Semgrep Supply Chain","2022-10-12","2022-10-13","https://semgrep.dev/products/semgrep-supply-chain?utm_source=console.dev&utm_medium=email&utm_campaign=ssc-launch","Developer Tools - Dependency management","SaaS","Find reachable vulnerable dependencies.","39","Analyzes your code to determine not just if you have a vulnerable dependency, but also whether your usage triggers the vulnerability. Helps triage dependency security alerts based on vulnerability reachability, rather than just a version comparison. Run via CLI or CI. Can comment on PRs, alert via Slack/email, and optionally propose auto-fixes.","346","Only analyzes usage of direct dependencies - can still alert on vulnerabilities in transitive or indirect dependencies, but does not yet support detection of their usage relevancy.","180","/interviews/semgrep-adam-berman/","TRUE"],["LocatorJS","LocatorJS","2022-10-12","2022-10-13","https://www.locatorjs.com/","Developer Tools - Browser testing","Open Source","Reveal React components.","24","Highlights React components in your browser so you can click to go directly to their source code. Understands NODE_ENV so runs only in dev. Works for most modern frameworks out of the box (React, NextJS, Preact, Solid, Vue, Svelte). Use as a dependency or as a browser extension (all browsers supported). Configurable open path to launch your editor.","350","Modern React frameworks are supported, but some additional setup is needed with custom webpack configs or Babel. Setting the config in two places can initially be confusing.","173","","FALSE"],["pg_activity","pg_activity","2022-10-12","2022-10-13","https://github.com/dalibo/pg_activity","Database - Management","Open Source","Real time PG monitor.","21","Displays Postgres stats and queries in a real time terminal interface. Toggle running, waiting, blocking queries. Includes system info (CPU, memory, query counters) and on a per query level. Query table can be sorted and refresh paused. Has a special flag for optimized RDS support.","282","Minimum refresh rate of 0.5s is too infrequent to show fast queries, but those are probably not the ones you’re interested in anyway. Requires superuser to get all the data, but falls back to display what it can without superuser.","230","","FALSE"],["Coherence","Coherence","2022-10-05","2022-10-06","https://www.withcoherence.com/","DevOps - Infrastructure automation","SaaS","Integrated dev platform.","24","Manage CI/CD, seed data, dev preview environments, and prod infrastructure from a single config file. Makes it easy to spin up new feature branches with duplicate infrastructure in separate cloud projects. Provides VS Code web instances for cloud-based dev against fully configured environments. Supports custom VS Code/vim/emacs configs.","338","Cloud support limited to AWS and GCP. Assumes you’re using GitHub - GitLab + Bitbucket support on the roadmap.","110","","TRUE"],["Open Props","Open Props","2022-10-05","2022-10-06","https://open-props.style/","Developer Tools - Frontend framework","Open Source","Open CSS vars.","14","Framework agnostic CSS variables with minimalist styling for all HTML elements. Includes dark+light mode. Supports CSS, PostCSS, JSON, or props as Javascript. Covers colors, gradients, typography, animations, media queries, and masks. Available via NPM, CDN, or CLI. Open source.","279","Docs don’t provide quick “get started” examples, although the GitHub repo has example commands for generating output e.g. PostCSS files or minimized bundles.","157","","FALSE"],["La Terminal","La Terminal","2022-10-05","2022-10-06","https://xibbon.com/","Misc - Terminal emulators","Other","SSH client for iOS.","19","Native (Swift) terminal emulation and SSH client for iPhone/iPad. Generate device specific keys stored in the secure enclave (or sync keys + settings over iCloud). Store a series of commands as snippets for easy execution. Built-in session keepalive via an agent or Tmux. Lots of themes. Env vars. PowerShell for Windows hosts.","327","Obviously iPhone/iPad only. You can choose the theme, but not customize it.","75","","FALSE"],["Helios","Helios","2022-09-28","2022-09-29","https://gethelios.dev/","DevOps - Observability","SaaS","Cloud observability & traces.","29","Augments OpenTelemetry to integrate logs and remote calls. Traces are visualized step by step, which makes it easier to understand the flow. Splits out each remote call e.g. HTTP or Kafka to show all parameters and attributes. Generates replication code for each call to reproduce issues. Integrates with CI to provide build failure visibility.","344","Limited number of official SDKs (Go, Java, .NET, JS, Node, Python, Ruby) - for anything else you can manually connect to an existing OpenTelemetry collector.","157","/interviews/helios-eli-cohen/","TRUE"],["Sampler","Sampler","2022-09-28","2022-09-29","https://sampler.dev/","Misc - Terminal utilities","Open Source","Shell command dashboard.","24","Visualizes the output of continuously executed shell commands. Build a dashboard of charts, sparklines, barcharts, gauges, text, and ascii components. Managed via a config file. Perform conditional actions e.g. terminal bell or exec command. Can connect to databases, Docker, and SSH. Open source.","297","No stable release since 2019, but seems to be under active development.","71","","FALSE"],["Neat","Neat","2022-09-28","2022-09-29","https://neat.run/","Developer Tools - Git tools","Desktop","Desktop GitHub & Linear notifications.","38","Menu bar app to show notifications from GitHub and Linear. Keyboard shortcuts for all actions (including a global keybinding to show the UI). Preview full notification without marking as read. Mute options to filter by user, repo, notification type.","249","Simply replacing a flood of emails with notifications is not recommended - make sure to use the filters and whether you actually want a desktop notification.","157","","FALSE"],["Ably","Ably","2022-09-21","2022-09-22","https://ably.com/?utm_campaign=GLB-22Q3Q4-Console.dev&utm_source=ConsoleDev","DevOps - Message queue","SaaS","Realtime as a service.","22","Single API/SDK for pub/sub, queues, and streaming. Handles global distribution, scaling, and availability with latency-based routing. Client connection recovery with replay and queuing for disconnected clients. Official SDKs for most major languages & compatible with MQTT, AMQP, STOMP, REST, SSE, XHR, JSONP, Kafka, SQS, webhooks, and other integrations.","355","Beware of the default rate limits - 50/msg/sec per client and 100/msg/sec globally (increased by upgrading the pricing plan). Peak connection and bandwidth limits also apply.","174","/interviews/ably-matthew-oriordan/","TRUE"],["Sizzy","Sizzy","2022-09-21","2022-09-22","https://sizzy.co/","Developer Tools - Testing frameworks","Desktop","Web dev browser.","16","Web testing with full devtools on multiple devices. Simulate slow/mobile network connections, OS chrome, responsiveness, color schemes, locale, with cursor, nav, input, and scroll sync. Test OG social previews (Twitter, FB, Google, Slack), override fonts and styles. Take screenshots, gifs and videos as if on the device.","321","Primarily for UI viewport testing - it does not actually simulate the native browser engines. The underlying renderer is Chromium.","130","","FALSE"],["Gitleaks","Gitleaks","2022-09-21","2022-09-22","https://gitleaks.io/","Security - Secrets management","Open Source","Detect secrets in code.","23","Simple CLI which analyzes code for secrets. Can run on standalone directories or files as well as Git repos. Scanning repos includes the full history - a baseline can be set to scan from, excluding prior commits. Official GitHub action. Open source.","249","Most useful when combined with the pre-commit hook rather than manual scanning, which must be set up separately (really a Git limitation, but worth mentioning).","160","","FALSE"],["RevenueCat","RevenueCat","2022-09-14","2022-09-15","https://www.revenuecat.com/?utm_source=console_dev&utm_medium=referral&utm_campaign=sept_22","Developer Tools - Backend framework","SaaS","App subscription management.","28","Provides a single user ID for purchases & subscriptions across app platforms (Apple, Google Play, Amazon, Stripe/web). Single subscription backend & mobile SDKs with analytics e.g. customer count, MRR calculation. Event webhooks and data/ETL integrations with third-parties like S3, Firebase, Intercom, Slack to take actions on subscription events.","348","Web SDK is via REST endpoints - no Python, Go, TypeScript SDKs. A/B testing of product/pricing options in private beta.","119","/interviews/revenuecat-jacob-eiting/","TRUE"],["dotenv Vault","dotenv Vault","2022-09-14","2022-09-15","https://www.dotenv.org/","Developer Tools - Local development","SaaS","Sync .env files.","16","Secure Git-like method of syncing .env secrets. Team access with permissions per environment makes it easy to give access to different resources. Direct sync with infra e.g. Vercel, Netlify, GitHub, AWS, or dotenv CLI. Version history for secret values allows for rollbacks. VS Code extension.","293","Only the JS/TS library is official - libraries for other languages are available, but developed by third parties.","113","","FALSE"],["Tabby","Tabby","2022-09-14","2022-09-15","https://tabby.sh/","Misc - Terminal emulators","Open Source","Terminal emulator.","18","Full terminal emulator with built-in SSH client. Configure themes, fonts, scrollback, bell, and shortcuts. Built-in tabs and splits (which are remembered with session history on restart). Quake mode global shortcut to show/hide terminal. Notify on process completion. Cross-platform + web client (beta). Open source.","316","Can be laggy, especially on startup. Memory intensive. ","55","","FALSE"],["Rowy","Rowy","2022-09-07","2022-09-08","https://www.rowy.io/","Database - Management","Open Source","UI + functions for Firestore.","29","Drop-in spreadsheet-like UI for Firestore. Typed fields e.g. dates, checkboxes, uploads, Markdown, JSON. Supports cloud functions workflows on field changes. Integrates with SendGrid, BigQuery, Twilio. Can pull in data from HTTP endpoints or import CSVs. Table/field-level RBAC. Dark mode. Open source.","302","Only runs on Firestore (Postgres & MongoDB on the roadmap) which means it only supports GCP. Actions managed by Rowy can’t use npm - have to use Google’s callable functions instead.","181","/interviews/rowy-harini-janakiraman/","TRUE"],["Pagefind","Pagefind","2022-09-07","2022-09-08","https://pagefind.app/","Developer Tools - Site Search","Open Source","Static search library.","22","Fulltext search without any backend infrastructure - indexes the output of static site build process i.e. the HTML. Integrate with your site using a provided UI component or with the JS API. Supports string or array filters and search across multiple sites. Static binary with no dynamic dependencies.","301","Compatibility issues with WASM and Content Security Policies means you need to set script-src to ‘unsafe-eval’ for full browser support (mainly lagging on Safari).","163","","FALSE"],["Plumber","Plumber","2022-09-07","2022-09-08","https://github.com/batchcorp/plumber","DevOps - Message queue","Open Source","Message queue CLI.","18","Inspect, tail, write to, or redirect events in message queues. Supports a wide variety of queues e.g. Kafka, RabbitMQ, SQS, NSQ, GCP Pub/Sub. Pipe messages into the queue. Can decode various message formats in real-time e.g. protobuf, JSON, etc. Single binary for macOS, Windows, Linux.","286","Limited docs for getting started e.g. connecting to backends requires passing IDs via CLI options or manually setting different environment variables. The --help flag provides useful details.","191","","FALSE"],["just","just","2022-08-31","2022-09-01","https://just.systems/man/en/","Misc - Terminal utilities","Open Source","Command runner.","15","Easy, but flexible CLI for running scripts as commands, which are stored in a `justfile` i.e. per project/directory. Commands can take arguments and load .env files. Write commands in arbitrary languages e.g. JS, Python, Ruby. Editor plugins for Vim, VS Code, JetBrains, etc. Proper error handling. Works on Mac, Linux, Windows.","328","Assumes existence of `sh` on all platforms, but can be set to use something different e.g. PowerShell.","102","","FALSE"],["SnapShooter","SnapShooter","2022-08-31","2022-09-01","https://snapshooter.com/","DevOps - Infrastructure automation","SaaS","Server, database, app backups.","30","Run independent backups that would otherwise be a pain to deal with e.g. offsite AWS, GCP, DO volumes, MySQL, MongoDB, Postgres databases. Serverless backup runner or hosted on your own instances. Bring your own storage e.g. S3 (or any compatible), Google Drive, Dropbox. Can also backup apps like WordPress and repos from GitHub.","330","Encryption is a premium feature. Missing support for some managed database features e.g. serverless export on Google Cloud SQL to avoid degrading the primary instance.","167","","FALSE"],["k9s","k9s","2022-08-31","2022-09-01","https://k9scli.io/","DevOps - Containers","Open Source","k8s management TUI.","19","Real-time view of your k8s cluster in a TUI. Provides a high level view of deployments, sets, pods, jobs, volumes, CPU, memory, etc. Drill-down views with more details and related resource usage. Log streaming view. Run commands e.g. scale, shell, kill. Keybindings, plugins, themes. Works on Mac, Linux, Windows.","313","Generally expects the latest version of k8s and sufficient RBAC permissions, otherwise it may not work properly. Log output is quite raw and difficult to read.","159","","FALSE"],["CodeSee","CodeSee","2022-08-24","2022-08-25","https://www.codesee.io/","Developer Tools - Documentation","SaaS","Code visibility.","16","Generates visualizations of code relationships to help understand how the codebase works. Create visual tours of code to help onboard new engineers or document functionality. Maps are posted to pull requests like a visual diff of what was changed and can be used to tour the changes in logical order. Maps auto-update with commits.","331","No dark mode. Only supports JS, TS, Python, Java, Go.","53","/interviews/codesee-josh-leven/","TRUE"],["Crunchy Data","Postgres Playground","2022-08-24","2022-08-25","https://www.crunchydata.com/developers/playground/psql-basics","Database - Relational database","Other","Postgres in the browser.","24","A full Postgres instance compiled to WASM and running in your browser. Provided as an ephemeral playground which makes it easy to test commands and learn how things work. Several tutorials provided, including for features like partitioning and PostGIS. Interact via psql CLI.","275","No persistence. Browser sandboxing prevents any other connection method.","72","","FALSE"],["direnv","direnv","2022-08-24","2022-08-25","https://direnv.net/","Developer Tools - Local development","Open Source","Auto load env vars.","19","Hooks into your shell to auto-load/unload environment variables when you cd into a directory. Loads a simple .envrc file in each directory. First-run in each dir asks for permission to mitigate malicious execution. The .envrc file can just be a list of exports, but it is also a bash script which allows you to execute other code. A useful stdlib of utility functions is provided.","380","Aliases and functions not exportable due to how direnv loads the environment from a sub-process back into the original shell.","125","","FALSE"],["Eraser","Eraser","2022-08-17","2022-08-18","https://www.tryeraser.com/","Developer Tools - Code collaboration","SaaS","Whiteboards for developers.","27","Combines markdown notes with a collaborative whiteboard. Developer specific components such as code blocks, browser frames, tech related icons, and sequence and entity relationship diagrams defined in code. Notes can link to specific areas of canvas. Keyboard commands for most actions. Signup not required.","307","No dark mode. Images can be exported with a solid or transparent background, but the solid background is not configurable (it’s always white).","142","","TRUE"],["Grafana OnCall","Grafana OnCall","2022-08-17","2022-08-18","https://grafana.com/products/oncall/","DevOps - Observability","Open Source","On call management.","19","Can manage schedules from whichever calendar you already use e.g. Google Calendar. Ingests alerts from a wide range of sources including Grafana, Prometheus, AWS, New Relic, Datadog. Handles rotations, overrides, upcoming shift notifications, and escalations. Configs can be managed in Terraform. Open source.","309","Limited chat integrations (Slack, Telegram, MS Teams). More advanced features e.g. auto-create Zoom bridge & Slack room, take incident notes, timeline reports are in a separate product that is in private preview.","212","","FALSE"],["Hono","Hono","2022-08-17","2022-08-18","https://honojs.dev/","Cloud - Serverless","Open Source","Serverless worker framework.","28","Supports Cloudflare Workers, Deno, Bun, Fastly, plus anything else that supports Web Standard API, which makes it simple to use and (mostly) works cross-platform. Built-in middleware for auth, cache, CORS, JSX, logs, JWT, JSON and static assets. Written in TS so you get proper types. Open source.","297","There are some minor differences between platforms, such as the JWT middleware not being supported on Bun.","106","","FALSE"],["Steadybit","Steadybit","2022-08-10","2022-08-11","https://steadybit.com/","DevOps - Infrastructure automation","SaaS","Chaos engineering platform.","27","Automate chaos testing in k8s, Docker, and Linux environments. Run experiments such as shut down instance or pod, simulate packet loss, drop DNS requests, and stress CPU. Control what is affected by attributes such as cloud zone, pod name, % of containers, etc. Simulate rippling outages across multiple applications. Trigger and monitor tests via CI/CD.","354","Weak spot analysis not supported on GCP. Windows hosts are not supported.","73","","TRUE"],["ClinicJS","ClinicJS","2022-08-10","2022-08-11","https://clinicjs.org/","DevOps - Observability","Open Source","NodeJS performance tools.","25","Provides a suite of tools for creating flame graphs, profiling CPU, GC, memory allocation, and async calls. Docs do a good job of walking through what the output means and how to solve common problems. Visualizes how async calls chain together and where time is spent. Open source.","281","NodeJS only. Not supposed to run in production, so doesn’t help with prod-related issues.","89","","FALSE"],["Nano ID","Nano ID","2022-08-10","2022-08-11","https://github.com/ai/nanoid","Developer Tools - Local development","Open Source","Tiny, URL friendly IDs.","23","Easier to work with than UUIDs e.g. you can double click and copy them from a URL. Uses more (configurable) characters than UUID so the ID size can be reduced (also configurable). Faster to generate than UUID. Collision probability can be calculated based on config values so you can trade off usability for chance of collision. Available for lots of languages.","361","If you need to (effectively) guarantee uniqueness then UUID is better. Can’t take advantage of specialist database types e.g. UUID in Postgres.","143","","FALSE"],["Stellate","Stellate","2022-08-03","2022-08-04","https://stellate.co/","Cloud - CDN","SaaS","GraphQL caching & analytics.","28","Config is defined in a TS|JS|YML file in your code repo. Query caching is automatic, but can be made smarter by syncing the schema (via CLI or CI). Fine-grained cache rules per type or field. Cache invalidation can be based on TTL or mutations. Supports query batching without any server-side changes.","301","There are some size limits to be aware of e.g. 40KB maximum query size and 10MB response cache limit. Empty responses are also not cached. No support for rate limits.","166","/interviews/stellate-max-stoiber/","FALSE"],["multi-gitter","multi-gitter","2022-08-03","2022-08-04","https://github.com/lindell/multi-gitter","Developer Tools - Git tools","Open Source","Run scripts across Git repos.","29","Simple CLI to run scripts across multiple Git repos or all repos in an org. Can run a shell script or run code through a runtime e.g. Python or node. Clones the repo, runs the script, then submits a PR with the changes. Can run against branches. All configurable e.g. PR title and description. Open source.","306","Requires some kind of Git host - GitHub, GitLab, Gitea, BitBucket.","66","","FALSE"],["Remix","Remix","2022-08-03","2022-08-04","https://remix.run/","Developer Tools - Frontend framework","Open Source","Frontend framework.","19","Builds on standard web APIs e.g. Fetch and Form rather than custom implementations. Clear separation between client and server with strong preference for server-side rendering. Progressive enhancement - JS not required. Performance focused by only reloading what has changed. TypeScript by default. Accessibility built in.","322","Some libraries / modules don’t work where they assume they run in the browser or a full Node environment. There are workarounds, but this can be a constraint.","158","","FALSE"],["Teleport","Teleport","2022-07-27","2022-07-28","https://goteleport.com/","Security - Authentication","Open Source","Remote access management.","25","New passwordless feature enables WebAuthn e.g. Apple TouchID, FIDO keys, etc, to authenticate users. Users can be provisioned on demand e.g. assuming a particular role with restricted permissions. “Just in time” access requests via tickets (JIRA) or chat (Slack) for approval flows. All this helps implement concept of least privileged access. Open source. ","357","Windows Hello only supports Web UI, not terminal access. Teleport Connect local GUI offers an easy way to access all resources, but is Mac only.","144","/interviews/teleport-isaiah-becker-mayer/","TRUE"],["CotEditor","CotEditor","2022-07-27","2022-07-28","https://coteditor.com/","Developer Tools - Text editors","Open Source","Plain-text editor for macOS.","28","Very lightweight and minimalist. Syntax highlighting for lots of formats. Basic content parsing e.g. highlighting matching braces. Supports splits. Has themes, or just uses macOS default look. Text editing features like outline, snippets, smart substitutions. Implemented in Swift and open source.","297","Default font is Helvetica - nice for plain text, but feels strange for code.","76","","FALSE"]],"formatted":[{"Company/Org":"Djinn","Tool/Product/Project":"Djinn","Reviewed":"2023-02-28","Scheduled for":"2023-03-02","URL":"https://djinn.tonic.ai/?signup","Category":"Data Science - ML","Type":"SaaS","What is it?":"Fake production data for ML.","Len":"109","What we like":"Enables privacy compliant training of ML models on realistic fake data. Connects to your prod database via SQL, transforms (fakes) the data, then trains your model. Provides a report after training to confirm how realistic the trained data was. Supports tabular and event driven models. Export to ipynb. Cloud or self-hosted.","What we dislike":"No dark mode. Pretty hefty minimum requirements for self-hosting, but ML training is compute & GPU intensive.","Interview":"/interviews/tonic-ander-steel/","Sponsored":"TRUE"},{"Company/Org":"GoReplay","Tool/Product/Project":"GoReplay","Reviewed":"2023-02-28","Scheduled for":"2023-03-02","URL":"https://goreplay.org/","Category":"Developer Tools - Testing frameworks","Type":"Open Source","What is it?":"Debug with production traffic.","Len":"125","What we like":"Records production network traffic for reproducing issues later. Stores traffic on disk, S3, Kafka, ElasticSearch, etc. Middleware supports sanitizing sensitive data, emitting metrics, etc. Speed up replay for load testing on real traffic. Transparently captures traffic without affecting it (it’s not a proxy). Open source (some features are paid).","What we dislike":"Requires sudo by default, but can run as a non-root user or by forwarding traffic to it. Windows is not officially supported.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"NoteSH","Tool/Product/Project":"NoteSH","Reviewed":"2023-02-28","Scheduled for":"2023-03-02","URL":"https://github.com/Cvaniak/NoteSH","Category":"Misc - Terminal utilities","Type":"Open Source","What is it?":"Sticky notes in your terminal.","Len":"122","What we like":"Sticky notes board for your terminal. Works with mouse or keyboard-only. Move, resize both sticky notes and the “board” they’re stuck to. Control over the border and background colors. Notes are saved across sessions and stored in a local JSON file. Open source.","What we dislike":"No static binary - installed via pip/Python. Main body entry text field doesn’t expand, which makes editing a bit awkward.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Sym","Tool/Product/Project":"Sym","Reviewed":"2023-02-22","Scheduled for":"2023-02-23","URL":"https://symops.com/","Category":"DevOps - Infrastructure automation","Type":"SaaS","What is it?":"Access management as code.","Len":"93","What we like":"Link resources in Terraform. Define access rules and workflows in Python. Supports simple approve/deny rules with approvals managed through Slack. But also allows sophisticated rules with routing to teams, auto approval based on who is on call, remove access or de-escalate privileges on events e.g. after going off-call or after a time. Full audit logs.","What we dislike":"Requires use of Terraform e.g. no support for AWS CDK. Only supports writing rules in Python.","Interview":"","Sponsored":"TRUE"},{"Company/Org":"Tokei","Tool/Product/Project":"Tokei","Reviewed":"2023-02-22","Scheduled for":"2023-02-23","URL":"https://github.com/XAMPPRocky/tokei","Category":"Misc - Terminal utilities","Type":"Open Source","What is it?":"Code statistics.","Len":"70","What we like":"Counts lines of code very quickly (millions of lines per second) to output stats for lines, code lines, comments, and blanks. Breaks out counts per language. Understands language specific syntax and supports basically every language. Single static (Rust) binary and can be also imported as a library.","What we dislike":"No stable release since Jan 2021, but does have recent commit history.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"rtx","Tool/Product/Project":"rtx","Reviewed":"2023-02-22","Scheduled for":"2023-02-23","URL":"https://github.com/jdxcode/rtx","Category":"Developer Tools - Dependency management","Type":"Open Source","What is it?":"Local runtime manager.","Len":"45","What we like":"CLI and shell plugin to auto-switch runtime versions based on per-directory configuration. Reads tool versions file(s) to determine which runtime to install and link to. Supports Bash, Zsh, Fish, Xonsh. Supports asdf plugins. Designed for performance by not using shims (~120ms overhead in asdf) instead updating PATH to directly call runtimes.","What we dislike":"No Windows support. Can conflict with direnv.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"OpsLevel","Tool/Product/Project":"OpsLevel","Reviewed":"2023-02-15","Scheduled for":"2023-02-16","URL":"https://www.opslevel.com/?utm_source=consoledev&utm_medium=ppc","Category":"Developer Tools - Dependency management","Type":"SaaS","What is it?":"Developer portal.","Len":"158","What we like":"Catalog and manage all your internal repos, tools, and services. Allows developers self-service access to provision infrastructure, call APIs, and understand ownership. Useful integrations e.g. CI/CD to view deployments, observability for metrics and SLOs, incident management to escalate on-call issues, etc. Pulls in Markdown docs from the repo automatically.","What we dislike":"No dark mode. Service config can be in an opslevel.yml file in each service repo, but actions and checks cannot - they must be configured via the OpsLevel UI.","Interview":"","Sponsored":"TRUE"},{"Company/Org":"tbls","Tool/Product/Project":"tbls","Reviewed":"2023-02-15","Scheduled for":"2023-02-16","URL":"https://github.com/k1LoW/tbls","Category":"Database - Management","Type":"Open Source","What is it?":"Auto document databases.","Len":"158","What we like":"Single binary outputs Markdown documentation of your whole database (PG, MySQL, MariaDB, SQLite, BigQuery, & others) with one command. Configurable output format (Markdown, DOT, Mermaid, JSON, even Excel). Can diagram relationships. Includes linting function e.g. require comments. Can diff actual vs documented.","What we dislike":"It’s a documentation tool, not for migrations or actually creating the tables from scratch from the docs. Limited support for stored procedures and functions.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Unovis","Tool/Product/Project":"Unovis","Reviewed":"2023-02-15","Scheduled for":"2023-02-16","URL":"https://unovis.dev/","Category":"Developer Tools - Frontend framework","Type":"Open Source","What is it?":"Data visualization library.","Len":"117","What we like":"Web library for plotting SVG charts, maps, network graphs. Modular and framework-independent - works with React, Angular, Svelte, TS. Easily customizable plots e.g. axis, labels, ticks, and styling using CSS variables. Supports events for mouseover and mouseout. Includes a dark theme for all components. ","What we dislike":"Legend is a separate component. Offers more control, but then must be configured separately from the graph component.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"UseCSV","Tool/Product/Project":"UseCSV","Reviewed":"2023-02-08","Scheduled for":"2023-02-09","URL":"https://usecsv.com/","Category":"Developer Tools - Frontend framework","Type":"SaaS","What is it?":"Data import component.","Len":"79","What we like":"Drop-in component for CSV/Excel import rather than building your own - React, Vue, Angular, or JS. Themeable. Can validate fields e.g. email, phone, number. Imported data is sent as JSON via webhook or JS callback. Webhook defaults to batches of 1,000 rows to allow you to process them - waits for a response before continuing.","What we dislike":"Need to use the JS callback if you want to keep everything on your own servers.","Interview":"","Sponsored":"TRUE"},{"Company/Org":"Bottom","Tool/Product/Project":"Bottom","Reviewed":"2023-02-08","Scheduled for":"2023-02-09","URL":"https://clementtsang.github.io/bottom/0.8.0/","Category":"Misc - Terminal utilities","Type":"Open Source","What is it?":"Terminal system monitor.","Len":"56","What we like":"Single static (Rust) binary that displays a real-time system monitor dashboard in the terminal. Supports widgets for CPU, memory, battery, processes, disk, network. Can expand widgets and navigate using the keyboard or mouse. Configurable via a file, including widget layout. Theme inherits from the terminal or can be customized.","What we dislike":"Limited number of widgets. Keybindings not customizable.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Kysely","Tool/Product/Project":"Kysely","Reviewed":"2023-02-08","Scheduled for":"2023-02-09","URL":"https://github.com/koskimas/kysely","Category":"Database - Management","Type":"Open Source","What is it?":"Typesafe SQL for TypeScript.","Len":"122","What we like":"Prevents mistakes by providing types for SQL queries. Understands fields types, joins, subqueries, aliases, and other advanced SQL features. Also supports dialects from databases like Planetscale, D1, AWS, etc. Enables autocomplete in your IDE. Migrations can also be written in TypeScript.","What we dislike":"Only works with Postgres, MySQL & SQLite. A third-party project is needed if you want to auto-generate schema definitions.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"CloudQuery","Tool/Product/Project":"CloudQuery","Reviewed":"2023-02-01","Scheduled for":"2023-02-02","URL":"https://www.cloudquery.io/","Category":"DevOps - Infrastructure automation","Type":"Open Source","What is it?":"Query your infrastructure.","Len":"158","What we like":"ELT-like sync from source(s) to destination(s). Sources can be APIs e.g. AWS or GCP resources, SaaS e.g., HubSpot, PagerDuty, or infra e.g. Terraform, Vercel. Destinations can be databases e.g. Postgres, SQLite, or cloud e.g. S3. Full sync or incremental changes. Typed fields. Option to maintain old records or remove them. Open source.","What we dislike":"Concurrency may need to be tweaked to avoid rate limits when syncing resources, but this will increase sync times. Incremental sync only supports local state.","Interview":"","Sponsored":"TRUE"},{"Company/Org":"Modern Errors","Tool/Product/Project":"Modern Errors","Reviewed":"2023-02-01","Scheduled for":"2023-02-02","URL":"https://github.com/ehmicky/modern-errors","Category":"Developer Tools - Frontend framework","Type":"Open Source","What is it?":"Proper errors for JS/TS.","Len":"71","What we like":"Library to provide structured errors in JS/TS. Set props on errors with typed fields. Wrap, aggregate, normalize errors. Core library provides base functionality which can be extended via plugins. Official plugins for specialist cases: CLI (colorized, pretty print, verbosity levels), HTTP (structured HTTP responses), clean stack traces, and others. Open source.","What we dislike":"JS/TS only. Be sure to configure TS to output ES modules, not CommonJS.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Llama","Tool/Product/Project":"Llama","Reviewed":"2023-02-01","Scheduled for":"2023-02-02","URL":"https://github.com/antonmedv/llama","Category":"Misc - Terminal utilities","Type":"Open Source","What is it?":"Terminal file browser.","Len":"109","What we like":"Minimalist CLI designed just to make it easier to navigate directories i.e. a replacement for `cd` and `ls`. Fuzzy search makes it navigating through the directory tree very fast. Shortcuts to preview, delete files, and exit with or with navigating to the directory. Prebuilt binaries for Mac, Linux, Windows. Open source.","What we dislike":"Requires a workaround to work properly in PowerShell. Have to trigger fuzzy search on every directory change.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Retool","Tool/Product/Project":"Retool","Reviewed":"2023-01-22","Scheduled for":"2023-01-26","URL":"https://retool.com/?utm_source=sponsor&utm_medium=newsletter&utm_campaign=consoledev","Category":"Developer Tools - UI Builder","Type":"SaaS","What is it?":"Internal tool builder.","Len":"166","What we like":"Impressive level of UI flexibility and customization - simple drag & drop to writing custom JS & React with external dependency support. Auto-generates UIs from database schemas including those tedious features like sorting, pagination, filtering & search. Real browser devtools-like debugger. Can also build native mobile apps and automated data pipelines & workflows.","What we dislike":"Themable, but no true dark mode. Remotely querying databases over the internet has inherent latency challenges (you can self-host Retool or use their cloud database).","Interview":"","Sponsored":"TRUE"},{"Company/Org":"Canary Tokens","Tool/Product/Project":"Canary Tokens","Reviewed":"2023-01-22","Scheduled for":"2023-01-26","URL":"https://canarytokens.org/generate","Category":"Security - Vulnerability management","Type":"SaaS","What is it?":"Breach detection honeypot tokens.","Len":"123","What we like":"Generate honeypot files (Word, Excel, PDF, executables) and tokens (AWS) which send alerts when triggered e.g. when a file is opened or the API credentials are used. Also supports DNS record, MySQL dump and other types of honeypot tokens. Email or webhook URL notifications. Provides another layer of detection e.g. from malware scraping credentials from laptops. Free service.","What we dislike":"Token types are more-or-less sufficient, but somewhat limited e.g. only supports AWS tokens (Slack tokens were deprecated).","Interview":"","Sponsored":"FALSE"},{"Company/Org":"YouPlot","Tool/Product/Project":"YouPlot","Reviewed":"2023-01-22","Scheduled for":"2023-01-26","URL":"https://github.com/red-data-tools/YouPlot","Category":"Misc - Terminal utilities","Type":"Open Source","What is it?":"Terminal graphs.","Len":"72","What we like":"Easily take input from stdin or a specified file then plot a graph in the terminal. Supports bar, line, scatter, box plots, histograms and density plots. Minimal setup needed - assumes first column is x axis and second column is y axis, but this is configurable. Can handle real-time data. Uses default terminal colors. Open source.","What we dislike":"Does not support time series. No static binary - installed via Ruby gem.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Swimm","Tool/Product/Project":"Swimm","Reviewed":"2023-01-18","Scheduled for":"2023-01-19","URL":"https://swimm.io/","Category":"Developer Tools - Documentation","Type":"SaaS","What is it?":"Continuous documentation.","Len":"108","What we like":"Enables code to live where it belongs - alongside code (in Markdown). Auto-syncs as you refactor, rename, move code around. Comments on PRs when docs break. Supports Mermaid syntax for diagramming. IDE extensions (VS Code, JetBrains) reveal docs in-context with code. Editor supports dark mode.","What we dislike":"Need to edit the docs using their editor (or the Markdown directly). In-IDE doc authoring is on the roadmap.","Interview":"/interviews/swimm-gilad-navot/","Sponsored":"TRUE"},{"Company/Org":"ov","Tool/Product/Project":"ov","Reviewed":"2023-01-18","Scheduled for":"2023-01-19","URL":"https://github.com/noborus/ov","Category":"Misc - Terminal utilities","Type":"Open Source","What is it?":"Rich terminal pager.","Len":"136","What we like":"Replaces `less`, `more`, or `tail -f` with more features for parsing text - section delimiters, search, mark position, color highlights, and parsing of columnar text. Mouse support with proper select + copy to clipboard. Keyboard shortcuts. Guides for replacing the pager in other CLIs e.g. psql, git, mysql, procs.","What we dislike":"Reads the entire file into memory. Default keybindings are different from `less`, so if you rely on them it’s not a drop-in replacement.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Mailing","Tool/Product/Project":"Mailing","Reviewed":"2023-01-18","Scheduled for":"2023-01-19","URL":"https://www.mailing.run/","Category":"Developer Tools - Frontend framework","Type":"Open Source","What is it?":"Build emails in React.","Len":"86","What we like":"Provides a dev environment for creating email templates in React - local dev server with previews and a built-in sender for dynamic rendering at runtime. Supports MJML for creating responsive emails that are compatible across clients. Sending API wraps Nodemailer, which has lots of useful features. Open source.","What we dislike":"Unclear whether it runs properly on Windows (there’s an open GitHub issue about this).","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Zigi","Tool/Product/Project":"Zigi","Reviewed":"2023-01-11","Scheduled for":"2023-01-12","URL":"https://www.zigi.ai/team-leader","Category":"Developer Tools - Workflow management","Type":"SaaS","What is it?":"Dev team assistant.","Len":"54","What we like":"Provides team and task management workflows within Slack. Understands team load to provide warnings when the team might not complete tasks within a sprint. Shows whether team members are overloaded with tasks, including tasks outside the sprint or assigned to others.","What we dislike":"Only supports workflows using Slack, JIRA, and GitHub.","Interview":"","Sponsored":"TRUE"},{"Company/Org":"Clipboard","Tool/Product/Project":"Clipboard","Reviewed":"2023-01-11","Scheduled for":"2023-01-12","URL":"https://github.com/Slackadays/Clipboard","Category":"Misc - Terminal utilities","Type":"Open Source","What is it?":"Terminal clipboard manager.","Len":"192","What we like":"Simple commands to cut, copy and paste. Supports pipe in or out and can read from and write to files (the whole file can be in the clipboard). Use multiple clipboards and show/clear the contents of all. Clipboards exist as temporary files which can be mounted to shared drives to use across systems. Can also make clipboards persistent instead of just temporary.","What we dislike":"No support for GUI clipboard manager on Wayland (but supports X11, Windows and macOS system clipboards). Installation defaults to compiling source, but you can download binaries if you prefer.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Devfile","Tool/Product/Project":"Devfile","Reviewed":"2023-01-11","Scheduled for":"2023-01-12","URL":"https://devfile.io/","Category":"DevOps - Containers","Type":"Open Source","What is it?":"Containerized dev environment config.","Len":"95","What we like":"Well-documented open standard for defining containerized development environments. Supported by several tools for consistent environments locally and in the cloud. Allows the environment to be versioned alongside the code. Can define resource usage limits, environment vars, endpoints. Samples provided in the open registry.","What we dislike":"Very k8s centric even though the spec can be used generically. Another standard (see xkcd 927).","Interview":"","Sponsored":"FALSE"},{"Company/Org":"lnav","Tool/Product/Project":"lnav","Reviewed":"2023-01-04","Scheduled for":"2023-01-05","URL":"https://lnav.org/","Category":"Misc - Terminal utilities","Type":"Open Source","What is it?":"Log file viewer.","Len":"200","What we like":"Point at a directory and it auto-detects file formats, parses, colorizes, merges, and displays them in your terminal. Can pretty print structured data e.g. JSON. Search as you type also streams in new log lines. Sessions can be restored. Query and filter the logs with SQL, which includes “virtual tables” to allow for comments, tags, and bookmarking.","What we dislike":"Official downloads don’t include Arm binaries (although the macOS version via Homebrew is compiled for Apple Silicon). Does not inherit the terminal theme - need to configure custom colors separately.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"SketchyBar","Tool/Product/Project":"SketchyBar","Reviewed":"2023-01-04","Scheduled for":"2023-01-05","URL":"https://github.com/FelixKratz/SketchyBar","Category":"Misc - OS","Type":"Open Source","What is it?":"Scriptable macOS status bar.","Len":"162","What we like":"Fully customizable - fonts, colors, positions, notch size, animations. Can subscribe to general events e.g. space change as well as OS notification events e.g. Spotify track changed, to trigger scripts. Supports graphing arbitrary values. Items can be linked to spaces. Can pull in items from the macOS status bar e.g. Control Center or WiFi.","What we dislike":"Config file is a bit fiddly to work with. Community plugins could be more structured - currently just config files + scripts shared in a GitHub discussion thread.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Tremor","Tool/Product/Project":"Tremor","Reviewed":"2023-01-04","Scheduled for":"2023-01-05","URL":"https://www.tremor.so/","Category":"Developer Tools - Frontend framework","Type":"Open Source","What is it?":"React dashboard components.","Len":"92","What we like":"Makes it really easy to create good-looking blocks for dashboards. Lots of components from graphs to cards, callouts, tables, and toggles. Each component has an API reference. Includes basic application layout and shells. Components are responsive. Open source.","What we dislike":"You can choose from 22 different color palettes, but not create custom colors. No dark mode.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"wtfutil","Tool/Product/Project":"wtfutil","Reviewed":"2022-12-14","Scheduled for":"2022-12-15","URL":"https://wtfutil.com/","Category":"Misc - Terminal utilities","Type":"Open Source","What is it?":"Terminal dashboard.","Len":"135","What we like":"Build a custom dashboard within your terminal. Lots of modules out of the box - IP info, clocks, system status, feed reader, Hacker News feed, GitHub, various monitoring tools, etc. Create custom modules in Go or use a simple command runner module. Customize layout via config file. Cross-platform & open source.","What we dislike":"Long config files can be a bit annoying to work with. Some stability issues reported on Windows and if there is no internet connection.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"rqlite","Tool/Product/Project":"rqlite","Reviewed":"2022-12-14","Scheduled for":"2022-12-15","URL":"https://github.com/rqlite/rqlite","Category":"Database - Relational database","Type":"Open Source","What is it?":"Lightweight distributed SQL database.","Len":"245","What we like":"Makes it easy to deploy a replicated cluster of SQLite backed database nodes. Writes distributed to a quorum or they fail. Provides HTTP API, CLI, and client libraries for Go, Python, Node, Java. Runs in-memory, but backed by on-disk Raft logs to avoid data loss risk. Supports full-text search, JSON documents, encryption, hot backups.","What we dislike":"You must use the HTTP API (directly or via client libraries) to get all the functionality. Writes scale vertically - only reads scale horizontally. 2GB database size limit (switch to on-disk to avoid this, but with a write-performance tradeoff).","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Inngest","Tool/Product/Project":"Inngest","Reviewed":"2022-12-14","Scheduled for":"2022-12-15","URL":"https://www.inngest.com/","Category":"Cloud - Serverless","Type":"SaaS","What is it?":"Serverless background jobs.","Len":"201","What we like":"Run a serverless function as a background job, in response to an event, on a schedule, or as a webhook. Supports JS and TS with framework integrations for NextJS, Express, Cloudflare Pages & RedwoodJS. Supports multi-step functions. Local dev server. Functions run on your own platform. Open core (paid cloud platform).","What we dislike":"Functions written in JS/TS-only (but you can trigger events from any language). AWS Lambda is not yet supported. You need to register functions with Inngest after every deploy (which can be automated).","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Finch","Tool/Product/Project":"Finch","Reviewed":"2022-12-07","Scheduled for":"2022-12-08","URL":"https://github.com/runfinch/finch","Category":"DevOps - Containers","Type":"Open Source","What is it?":"Local container management CLI.","Len":"126","What we like":"Easy to remember commands for building and running containers without having to install/learn multiple tools. Can pull from container registries or build locally (creating an OCI image from a Dockerfile). Supports specifying the platform for running/building for different architectures. Acts as a layer on top of nerdctl so it is effectively Docker compatible, but uses containerd and BuildKit.","What we dislike":"macOS only (Windows & Linux are on the roadmap). Docs are limited, so you need to work out the commands from the nerdctl docs.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Spacelift","Tool/Product/Project":"Spacelift","Reviewed":"2022-12-07","Scheduled for":"2022-12-08","URL":"https://spacelift.io/","Category":"DevOps - CI/CD","Type":"SaaS","What is it?":"CI/CD for IaaC.","Len":"108","What we like":"Understands infrastructure state to allow parallelized runs and collaboration on infrastructure as code changes. Supports Terraform, Pulumi, Cloudformation, and k8s. Integrates into existing workflows e.g. pull requests. Policies allow RBAC and approval flows, defined using Open Policy Agent. Drift detection. Product has some personality e.g. subtle space references in log output.","What we dislike":"The docs are well written, but there is a steep learning curve and a UI with lots of components to work out.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"humanlog","Tool/Product/Project":"humanlog","Reviewed":"2022-12-07","Scheduled for":"2022-12-08","URL":"https://github.com/aybabtme/humanlog","Category":"DevOps - Log management","Type":"Open Source","What is it?":"Log parser CLI.","Len":"82","What we like":"Reads logs from stdin and pipes them back to stdout formatted and easier to read. Also adds colors. Options to skip log keys, ignore keys that are the same as the previous entry, and truncate values. Binaries for macOS, Linux, and Windows.","What we dislike":"Only formats logs in JSON or logfmt - everything else is ignored. No ARM binaries.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Metrist","Tool/Product/Project":"Metrist","Reviewed":"2022-11-30","Scheduled for":"2022-12-01","URL":"https://metrist.io/","Category":"DevOps - Observability","Type":"SaaS","What is it?":"Monitor your cloud dependencies.","Len":"259","What we like":"Monitors not just service status pages, but also synthetic tests against APIs to check things like creating an S3 bucket, upload objects, access them, etc. Supports cloud (AWS, GCP, Azure) and SaaS e.g. GitHub, Cloudflare, Google Drive. Degraded (average latency has increased) or down (not responding) alerts. Optional agent to test from within your own account.","What we dislike":"The Metrist agent can auto discover API calls using eBPF on the OS level. This allows unknown APIs to be monitored, but has some limitations on the traffic it can inspect e.g. outgoing TLS/SSL calls, but only on Linux if they use OpenSSL (dynamically linked).","Interview":"/interviews/metrist-ryan-duffield/","Sponsored":"TRUE"},{"Company/Org":"Nx","Tool/Product/Project":"Nx","Reviewed":"2022-11-30","Scheduled for":"2022-12-01","URL":"https://nx.dev/","Category":"DevOps - CI/CD","Type":"Open Source","What is it?":"Fast build system.","Len":"138","What we like":"Smart caching and tasks distributed across multiple build agents significantly improves build time. Only runs build tasks with changes. Remote caches can be shared. Migration functionality can keep all workspace dependencies up to date for everyone. Built-in task executors support linting, testing, dev servers, etc.","What we dislike":"All the examples, docs, core plugins etc, assume you’re working in the JS/TS ecosystem, but it is actually a general purpose build system.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Hurl","Tool/Product/Project":"Hurl","Reviewed":"2022-11-30","Scheduled for":"2022-12-01","URL":"https://hurl.dev/","Category":"API - API","Type":"Open Source","What is it?":"HTTP requests & tests with plain text.","Len":"172","What we like":"Define and execute HTTP requests in plain text. Config format makes it easy for anyone to understand and manage. Supports headers, query params, form submissions, APIs, CSRF tokens. Can assert responses for testing e.g. content, headers, JSON body, endpoint performance. Runs as a single binary CLI. Open source.","What we dislike":"Uses curl underneath, but doesn’t fully support/expose all the features/options. Hurl syntax is custom, so text editors will struggle to highlight and provide autocomplete.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"GoAccess","Tool/Product/Project":"GoAccess","Reviewed":"2022-11-23","Scheduled for":"2022-11-24","URL":"https://goaccess.io/","Category":"DevOps - Log management","Type":"Open Source","What is it?":"Real time log analyzer.","Len":"142","What we like":"CLI or web UI for real time visualization of logs. Supports most log formats and includes predefined config for AWS CloudFront, S3 & load balancers, Apache, Nginx, GCS, Squid, IIS, Caddy. Can export to JSON or CSV. Single binary - point it at one or many log files and it runs. Packages for all major platforms. Open source.","What we dislike":"Has limited built-in filtering, but is designed to be composable like any good Unix tool, so you can pipe output through grep, sed, awk, etc. ","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Blink Code","Tool/Product/Project":"Blink Code","Reviewed":"2022-11-23","Scheduled for":"2022-11-24","URL":"https://docs.blink.sh/advanced/code","Category":"Developer Tools - IDE","Type":"Open Source","What is it?":"VS Code for iOS.","Len":"202","What we like":"iPad optimized version of VS Code integrated into iOS conventions. Can connect to remote environments like Codespaces or SSH to execute code. Blink is a mobile terminal so Blink Code utilizes all of its functionality like using Mosh for reliable connections, customizable shell, keyboard shortcuts etc. Open source.","What we dislike":"Needs a large iPad to work well. Great for quick mobile edits, or perhaps when traveling, but full development on an iPad feels like too much of a contortion when a full desktop is so much more flexible","Interview":"","Sponsored":"FALSE"},{"Company/Org":"ntfy","Tool/Product/Project":"ntfy","Reviewed":"2022-11-23","Scheduled for":"2022-11-24","URL":"https://ntfy.sh/","Category":"API - Communication","Type":"Open Source","What is it?":"Send yourself push notifications.","Len":"133","What we like":"Install the app (Android or iOS) and POST to the API to send yourself a notification. Can be a very simple message or include custom titles, priority (Android only), scheduled delivery, action buttons, attachments, icons. Also supports email and a CLI for notifications. Free hosted by the author, or open source so you can run your own private server.","What we dislike":"Topics are open with read/write access by anyone - access control is supported and you can run your own server to protect it further.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Saleor","Tool/Product/Project":"Saleor","Reviewed":"2022-11-14","Scheduled for":"2022-11-17","URL":"https://saleor.io/","Category":"API - API","Type":"Open Source","What is it?":"Open source headless commerce API.","Len":"155","What we like":"Follows 12-factor architecture. Separation of concerns with API backend (Python + GraphQL), admin dashboard, and storefront UI (TS + React) all separate projects/instances. Includes GraphQL Playground to make it easy to test API queries. CLI and SDK for custom storefront implementation, or use NextJS template. Open source or run on their cloud.","What we dislike":"Storefront and dashboard are static, but the backend APIs need to be managed for scalability. You need to manage your own task runner for background tasks.","Interview":"","Sponsored":"TRUE"},{"Company/Org":"Partytown","Tool/Product/Project":"Partytown","Reviewed":"2022-11-14","Scheduled for":"2022-11-17","URL":"https://partytown.builder.io/","Category":"Developer Tools - Dependency management","Type":"Open Source","What is it?":"Run scripts in a web worker.","Len":"163","What we like":"Offloads scripts from the main thread to a separate web worker. Allows third-party scripts to be sandboxed and throttled so the main thread can be dedicated to code you control. Easy to enable on any script via a custom attribute, but known to work well with analytics e.g. Google Tag Manager and support e.g. Intercom. Integrates with major frameworks. Open source.","What we dislike":"Network tab shows lots of proxied requests, which makes it a bit noisy. Not suitable for UI intensive scripts due to DOM throttling. preventDefault() doesn’t work.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"websocketd","Tool/Product/Project":"websocketd","Reviewed":"2022-11-14","Scheduled for":"2022-11-17","URL":"https://github.com/joewalnes/websocketd","Category":"DevOps - Web server","Type":"Open Source","What is it?":"Anything as a web socket.","Len":"133","What we like":"All your code needs to do is write to stdout and read from stdin. websocketd deals with managing the websocket endpoint. This means you can add websockets to any application in any language. Single binary runs on all platforms - minimal dependencies (written in Go). Includes WebSocket developer console. Open source.","What we dislike":"Designed as a quick and simple way to get websockets working - each connection opens a new process, which may not work well at scale.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"SonarLint","Tool/Product/Project":"SonarLint","Reviewed":"2022-11-09","Scheduled for":"2022-11-10","URL":"https://www.sonarsource.com/products/sonarlint/?utm_medium=paid&utm_source=consoledev&utm_campaign=sonarlint&utm_content=newsletter","Category":"Developer Tools - IDE","Type":"Desktop","What is it?":"IDE code quality suggestions.","Len":"134","What we like":"Provides in-line code quality analysis in your IDE as you code. Supports VS Code, JetBrains, Eclipse, Visual Studio. Language specific rules with in-editor docs make it easy to avoid problems e.g. deprecated APIs, complex definitions, useless try/catch branches, etc. Team rules sync. Extensions are open source. ","What we dislike":"Supports common languages like JS, TS, Python, C, C++, Ruby, Java, PHP, HTML but is missing support for the likes of CSS, Rust and Go.","Interview":"/interviews/sonarsource-olivier-gaudin/","Sponsored":"TRUE"},{"Company/Org":"quicktype","Tool/Product/Project":"quicktype","Reviewed":"2022-11-09","Scheduled for":"2022-11-10","URL":"https://quicktype.io/","Category":"API - API","Type":"Open Source","What is it?":"Typesafe code from JSON.","Len":"52","What we like":"Web app or CLI to generate typesafe code from JSON, GraphQL or TypeScript. Supports output in lots of languages e.g. Go, Java, Ruby, TypeScript, Elm, Python, Rust. Can parse from files, schemas, or URLs. Also generates a basic client library. Extensions for VS Code, XCode, Visual Studio. Open source.","What we dislike":"IDE extensions haven’t been updated for a few years.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"mle","Tool/Product/Project":"mle","Reviewed":"2022-11-09","Scheduled for":"2022-11-10","URL":"https://github.com/adsr/mle","Category":"Developer Tools - Text editors","Type":"Open Source","What is it?":"Terminal text editor.","Len":"162","What we like":"Minimalist approach - small codebase and focus on simplicity by calling out to shell commands for extra functionality e.g. grep. Supports fuzzy search, syntax highlighting, split views, auto indent. Can be scripted and run in headless mode to run edit commands and output the result. Runs on all platforms with official packages. Open source.","What we dislike":"Default keybindings are somewhat intuitive e.g. Ctrl+S for save, but don’t take advantage of the muscle memory from other terminal editors. Help docs are limited.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Speakeasy","Tool/Product/Project":"Speakeasy","Reviewed":"2022-11-02","Scheduled for":"2022-11-03","URL":"https://www.speakeasyapi.dev/","Category":"DevOps - API Management","Type":"SaaS","What is it?":"Developer experience for APIs.","Len":"130","What we like":"Provides endpoint discovery and request monitoring via middleware, which makes it easy to integrate into an existing API. Records API requests for debugging - can be replayed from the dashboard or via a Postman download. API spec drift detection with alerting. Easily create a dashboard for API users to login and review their usage. Sensitive fields can be masked. Cloud or self-hosted. ","What we dislike":"API integration and instrumentation SDKs only available for Go, Typescript, Java. Self-service API key rotation not yet supported.","Interview":"/interviews/speakeasy-sagar-batchu/","Sponsored":"TRUE"},{"Company/Org":"Robot Framework","Tool/Product/Project":"Robot Framework","Reviewed":"2022-11-02","Scheduled for":"2022-11-03","URL":"https://robotframework.org/","Category":"Developer Tools - Testing frameworks","Type":"Open Source","What is it?":"Automation as code.","Len":"129","What we like":"Makes it easy to create tests for web, mobile, email, etc. Layered on top of Python so tests can be coded and then set up using the custom Robot syntax. Flexible configuration and tagging makes it easy to vary tests and associated data. Detailed reports show the full execution log for debugging. Community plugins e.g. for Selenium, databases, REST APIs. Open source.","What we dislike":"Yet another custom language to learn. May just be easier to write tests in the same language / framework as your actual codebase.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"GoatCounter","Tool/Product/Project":"GoatCounter","Reviewed":"2022-11-02","Scheduled for":"2022-11-03","URL":"https://www.goatcounter.com/","Category":"DevOps - Observability","Type":"Open Source","What is it?":"Lightweight web analytics.","Len":"139","What we like":"Very lightweight stats for your website: visitors, top pages, referrers, etc. Includes automatic bot detection and campaign stats. Tracking JS is very small (3.5 kB) and has the option to use a pixel, trigger from server middleware or import raw logs. Doesn’t track users with IDs. Open source and can be self hosted (written in Go and uses either SQLite or Postgres)","What we dislike":"It is very lightweight, so if you’re used to Google Analytics you may be disappointed - but do you really need all that data? No dark mode.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Convex","Tool/Product/Project":"Convex","Reviewed":"2022-10-26","Scheduled for":"2022-10-27","URL":"https://www.convex.dev/","Category":"Developer Tools - Backend framework","Type":"Open Source","What is it?":"Reactive backend as a service.","Len":"219","What we like":"Makes it easy to build a live-updating web app with a document database. Strictly-typed fully relational schemas defined in code (optional, but recommended). Data mutations are automatically reflected and re-rendered. Built-in dashboard and logging. Can deploy to a hosting provider like Netlify or Vercel, and Convex handles the backend.","What we dislike":"TypeScript only. All functions must be deterministic, so you need to call external functions to call third-party APIs e.g. Stripe, Vercel functions, etc. Convex provides a client to share the state with those functions.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Dash","Tool/Product/Project":"Dash","Reviewed":"2022-10-26","Scheduled for":"2022-10-27","URL":"https://kapeli.com/dash","Category":"Developer Tools - Documentation","Type":"Desktop","What is it?":"Offline documentation.","Len":"179","What we like":"Desktop app for searching and browsing technical docs. Large number of available docsets for languages, frameworks, apps, libraries, and packages. Cheatsheets and user contributed docs, including an offline Stack Overflow. Integrates with editors like VS Code, JetBrains, Vim. Add your own private and shared annotations, which can be shared within teams. Quick launch keyboard shortcut.","What we dislike":"macOS only - see Zeal, a free, open source alternative for Windows and Linux that uses the same docsets. Images in some docsets still require internet access, e.g. Stack Overflow.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"DuckDB","Tool/Product/Project":"DuckDB","Reviewed":"2022-10-26","Scheduled for":"2022-10-27","URL":"https://duckdb.org/","Category":"Database - Relational database","Type":"Open Source","What is it?":"In-process SQL database.","Len":"120","What we like":"Designed for very fast data analysis, particularly where whole tables or large joins are involved. Simple to operate - no dependencies and nothing to install because it runs in the host process, thereby increasing performance. Supports complex SQL queries. Fast loading of data from CSV, Parquet, Postgres, SQLite, read/write data from S3.","What we dislike":"Not designed for high volume transactional queries or where the database needs to be written to from multiple processes.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Signadot","Tool/Product/Project":"Signadot","Reviewed":"2022-10-19","Scheduled for":"2022-10-20","URL":"https://www.signadot.com/","Category":"Developer Tools - Testing frameworks","Type":"SaaS","What is it?":"Ephemeral test environments.","Len":"140","What we like":"API, SDK, and CLI for creating sandboxed test environments inside your own infrastructure (or locally). Create parameterized templates with dependencies and fine-grained customizations to test changes to one or many services. Spin up environments from integration tests and CI. Supports resource creation e.g. databases or message queues.","What we dislike":"Requires Kubernetes. Limited number of resource plugins - MariaDB, Amazon SQS, and RabbitMQ - you need to create your own for anything else.","Interview":"/interviews/signadot-arjun-iyer/","Sponsored":"TRUE"},{"Company/Org":"PopSQL","Tool/Product/Project":"PopSQL","Reviewed":"2022-10-19","Scheduled for":"2022-10-20","URL":"https://popsql.com/","Category":"Database - Management","Type":"Desktop","What is it?":"Collaborative SQL editor.","Len":"239","What we like":"Set up connections and SQL queries to databases like MySQL, Postgres, BigQuery, MongoDB, etc. Auto-complete query editor with results browser that can visualize and export data. Desktop app or web interface. Queries can be private, shared, or public. Build dashboards and templated UIs to allow others to easily execute queries safely.","What we dislike":"Desktop app not built for Apple Silicon (works via Rosetta 2 translation, but it becomes a bit laggy). Option for direct connections avoids their cloud service, but also means they can’t be used via their web app version i.e. desktop only.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"jc","Tool/Product/Project":"jc","Reviewed":"2022-10-19","Scheduled for":"2022-10-20","URL":"https://github.com/kellyjonbrazil/jc","Category":"Misc - Terminal utilities","Type":"Open Source","What is it?":"Convert command output to JSON.","Len":"107","What we like":"Pipe the output of a command to get a JSON translation. Or, run in reverse to have jc execute the command and pick the parser automatically. Supports parsing files e.g. YAML, CSV, /etc/hosts. Colorizes output by default. Supports streaming e.g. commands like ping which provide continual output. Tool and parsers open source. Also available as a Python package.","What we dislike":"When piping you need to specify the parser - there are lots of options, but not every command is supported.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Semgrep Supply Chain","Tool/Product/Project":"Semgrep Supply Chain","Reviewed":"2022-10-12","Scheduled for":"2022-10-13","URL":"https://semgrep.dev/products/semgrep-supply-chain?utm_source=console.dev&utm_medium=email&utm_campaign=ssc-launch","Category":"Developer Tools - Dependency management","Type":"SaaS","What is it?":"Find reachable vulnerable dependencies.","Len":"180","What we like":"Analyzes your code to determine not just if you have a vulnerable dependency, but also whether your usage triggers the vulnerability. Helps triage dependency security alerts based on vulnerability reachability, rather than just a version comparison. Run via CLI or CI. Can comment on PRs, alert via Slack/email, and optionally propose auto-fixes.","What we dislike":"Only analyzes usage of direct dependencies - can still alert on vulnerabilities in transitive or indirect dependencies, but does not yet support detection of their usage relevancy.","Interview":"/interviews/semgrep-adam-berman/","Sponsored":"TRUE"},{"Company/Org":"LocatorJS","Tool/Product/Project":"LocatorJS","Reviewed":"2022-10-12","Scheduled for":"2022-10-13","URL":"https://www.locatorjs.com/","Category":"Developer Tools - Browser testing","Type":"Open Source","What is it?":"Reveal React components.","Len":"173","What we like":"Highlights React components in your browser so you can click to go directly to their source code. Understands NODE_ENV so runs only in dev. Works for most modern frameworks out of the box (React, NextJS, Preact, Solid, Vue, Svelte). Use as a dependency or as a browser extension (all browsers supported). Configurable open path to launch your editor.","What we dislike":"Modern React frameworks are supported, but some additional setup is needed with custom webpack configs or Babel. Setting the config in two places can initially be confusing.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"pg_activity","Tool/Product/Project":"pg_activity","Reviewed":"2022-10-12","Scheduled for":"2022-10-13","URL":"https://github.com/dalibo/pg_activity","Category":"Database - Management","Type":"Open Source","What is it?":"Real time PG monitor.","Len":"230","What we like":"Displays Postgres stats and queries in a real time terminal interface. Toggle running, waiting, blocking queries. Includes system info (CPU, memory, query counters) and on a per query level. Query table can be sorted and refresh paused. Has a special flag for optimized RDS support.","What we dislike":"Minimum refresh rate of 0.5s is too infrequent to show fast queries, but those are probably not the ones you’re interested in anyway. Requires superuser to get all the data, but falls back to display what it can without superuser.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Coherence","Tool/Product/Project":"Coherence","Reviewed":"2022-10-05","Scheduled for":"2022-10-06","URL":"https://www.withcoherence.com/","Category":"DevOps - Infrastructure automation","Type":"SaaS","What is it?":"Integrated dev platform.","Len":"110","What we like":"Manage CI/CD, seed data, dev preview environments, and prod infrastructure from a single config file. Makes it easy to spin up new feature branches with duplicate infrastructure in separate cloud projects. Provides VS Code web instances for cloud-based dev against fully configured environments. Supports custom VS Code/vim/emacs configs.","What we dislike":"Cloud support limited to AWS and GCP. Assumes you’re using GitHub - GitLab + Bitbucket support on the roadmap.","Interview":"","Sponsored":"TRUE"},{"Company/Org":"Open Props","Tool/Product/Project":"Open Props","Reviewed":"2022-10-05","Scheduled for":"2022-10-06","URL":"https://open-props.style/","Category":"Developer Tools - Frontend framework","Type":"Open Source","What is it?":"Open CSS vars.","Len":"157","What we like":"Framework agnostic CSS variables with minimalist styling for all HTML elements. Includes dark+light mode. Supports CSS, PostCSS, JSON, or props as Javascript. Covers colors, gradients, typography, animations, media queries, and masks. Available via NPM, CDN, or CLI. Open source.","What we dislike":"Docs don’t provide quick “get started” examples, although the GitHub repo has example commands for generating output e.g. PostCSS files or minimized bundles.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"La Terminal","Tool/Product/Project":"La Terminal","Reviewed":"2022-10-05","Scheduled for":"2022-10-06","URL":"https://xibbon.com/","Category":"Misc - Terminal emulators","Type":"Other","What is it?":"SSH client for iOS.","Len":"75","What we like":"Native (Swift) terminal emulation and SSH client for iPhone/iPad. Generate device specific keys stored in the secure enclave (or sync keys + settings over iCloud). Store a series of commands as snippets for easy execution. Built-in session keepalive via an agent or Tmux. Lots of themes. Env vars. PowerShell for Windows hosts.","What we dislike":"Obviously iPhone/iPad only. You can choose the theme, but not customize it.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Helios","Tool/Product/Project":"Helios","Reviewed":"2022-09-28","Scheduled for":"2022-09-29","URL":"https://gethelios.dev/","Category":"DevOps - Observability","Type":"SaaS","What is it?":"Cloud observability & traces.","Len":"157","What we like":"Augments OpenTelemetry to integrate logs and remote calls. Traces are visualized step by step, which makes it easier to understand the flow. Splits out each remote call e.g. HTTP or Kafka to show all parameters and attributes. Generates replication code for each call to reproduce issues. Integrates with CI to provide build failure visibility.","What we dislike":"Limited number of official SDKs (Go, Java, .NET, JS, Node, Python, Ruby) - for anything else you can manually connect to an existing OpenTelemetry collector.","Interview":"/interviews/helios-eli-cohen/","Sponsored":"TRUE"},{"Company/Org":"Sampler","Tool/Product/Project":"Sampler","Reviewed":"2022-09-28","Scheduled for":"2022-09-29","URL":"https://sampler.dev/","Category":"Misc - Terminal utilities","Type":"Open Source","What is it?":"Shell command dashboard.","Len":"71","What we like":"Visualizes the output of continuously executed shell commands. Build a dashboard of charts, sparklines, barcharts, gauges, text, and ascii components. Managed via a config file. Perform conditional actions e.g. terminal bell or exec command. Can connect to databases, Docker, and SSH. Open source.","What we dislike":"No stable release since 2019, but seems to be under active development.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Neat","Tool/Product/Project":"Neat","Reviewed":"2022-09-28","Scheduled for":"2022-09-29","URL":"https://neat.run/","Category":"Developer Tools - Git tools","Type":"Desktop","What is it?":"Desktop GitHub & Linear notifications.","Len":"157","What we like":"Menu bar app to show notifications from GitHub and Linear. Keyboard shortcuts for all actions (including a global keybinding to show the UI). Preview full notification without marking as read. Mute options to filter by user, repo, notification type.","What we dislike":"Simply replacing a flood of emails with notifications is not recommended - make sure to use the filters and whether you actually want a desktop notification.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Ably","Tool/Product/Project":"Ably","Reviewed":"2022-09-21","Scheduled for":"2022-09-22","URL":"https://ably.com/?utm_campaign=GLB-22Q3Q4-Console.dev&utm_source=ConsoleDev","Category":"DevOps - Message queue","Type":"SaaS","What is it?":"Realtime as a service.","Len":"174","What we like":"Single API/SDK for pub/sub, queues, and streaming. Handles global distribution, scaling, and availability with latency-based routing. Client connection recovery with replay and queuing for disconnected clients. Official SDKs for most major languages & compatible with MQTT, AMQP, STOMP, REST, SSE, XHR, JSONP, Kafka, SQS, webhooks, and other integrations.","What we dislike":"Beware of the default rate limits - 50/msg/sec per client and 100/msg/sec globally (increased by upgrading the pricing plan). Peak connection and bandwidth limits also apply.","Interview":"/interviews/ably-matthew-oriordan/","Sponsored":"TRUE"},{"Company/Org":"Sizzy","Tool/Product/Project":"Sizzy","Reviewed":"2022-09-21","Scheduled for":"2022-09-22","URL":"https://sizzy.co/","Category":"Developer Tools - Testing frameworks","Type":"Desktop","What is it?":"Web dev browser.","Len":"130","What we like":"Web testing with full devtools on multiple devices. Simulate slow/mobile network connections, OS chrome, responsiveness, color schemes, locale, with cursor, nav, input, and scroll sync. Test OG social previews (Twitter, FB, Google, Slack), override fonts and styles. Take screenshots, gifs and videos as if on the device.","What we dislike":"Primarily for UI viewport testing - it does not actually simulate the native browser engines. The underlying renderer is Chromium.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Gitleaks","Tool/Product/Project":"Gitleaks","Reviewed":"2022-09-21","Scheduled for":"2022-09-22","URL":"https://gitleaks.io/","Category":"Security - Secrets management","Type":"Open Source","What is it?":"Detect secrets in code.","Len":"160","What we like":"Simple CLI which analyzes code for secrets. Can run on standalone directories or files as well as Git repos. Scanning repos includes the full history - a baseline can be set to scan from, excluding prior commits. Official GitHub action. Open source.","What we dislike":"Most useful when combined with the pre-commit hook rather than manual scanning, which must be set up separately (really a Git limitation, but worth mentioning).","Interview":"","Sponsored":"FALSE"},{"Company/Org":"RevenueCat","Tool/Product/Project":"RevenueCat","Reviewed":"2022-09-14","Scheduled for":"2022-09-15","URL":"https://www.revenuecat.com/?utm_source=console_dev&utm_medium=referral&utm_campaign=sept_22","Category":"Developer Tools - Backend framework","Type":"SaaS","What is it?":"App subscription management.","Len":"119","What we like":"Provides a single user ID for purchases & subscriptions across app platforms (Apple, Google Play, Amazon, Stripe/web). Single subscription backend & mobile SDKs with analytics e.g. customer count, MRR calculation. Event webhooks and data/ETL integrations with third-parties like S3, Firebase, Intercom, Slack to take actions on subscription events.","What we dislike":"Web SDK is via REST endpoints - no Python, Go, TypeScript SDKs. A/B testing of product/pricing options in private beta.","Interview":"/interviews/revenuecat-jacob-eiting/","Sponsored":"TRUE"},{"Company/Org":"dotenv Vault","Tool/Product/Project":"dotenv Vault","Reviewed":"2022-09-14","Scheduled for":"2022-09-15","URL":"https://www.dotenv.org/","Category":"Developer Tools - Local development","Type":"SaaS","What is it?":"Sync .env files.","Len":"113","What we like":"Secure Git-like method of syncing .env secrets. Team access with permissions per environment makes it easy to give access to different resources. Direct sync with infra e.g. Vercel, Netlify, GitHub, AWS, or dotenv CLI. Version history for secret values allows for rollbacks. VS Code extension.","What we dislike":"Only the JS/TS library is official - libraries for other languages are available, but developed by third parties.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Tabby","Tool/Product/Project":"Tabby","Reviewed":"2022-09-14","Scheduled for":"2022-09-15","URL":"https://tabby.sh/","Category":"Misc - Terminal emulators","Type":"Open Source","What is it?":"Terminal emulator.","Len":"55","What we like":"Full terminal emulator with built-in SSH client. Configure themes, fonts, scrollback, bell, and shortcuts. Built-in tabs and splits (which are remembered with session history on restart). Quake mode global shortcut to show/hide terminal. Notify on process completion. Cross-platform + web client (beta). Open source.","What we dislike":"Can be laggy, especially on startup. Memory intensive. ","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Rowy","Tool/Product/Project":"Rowy","Reviewed":"2022-09-07","Scheduled for":"2022-09-08","URL":"https://www.rowy.io/","Category":"Database - Management","Type":"Open Source","What is it?":"UI + functions for Firestore.","Len":"181","What we like":"Drop-in spreadsheet-like UI for Firestore. Typed fields e.g. dates, checkboxes, uploads, Markdown, JSON. Supports cloud functions workflows on field changes. Integrates with SendGrid, BigQuery, Twilio. Can pull in data from HTTP endpoints or import CSVs. Table/field-level RBAC. Dark mode. Open source.","What we dislike":"Only runs on Firestore (Postgres & MongoDB on the roadmap) which means it only supports GCP. Actions managed by Rowy can’t use npm - have to use Google’s callable functions instead.","Interview":"/interviews/rowy-harini-janakiraman/","Sponsored":"TRUE"},{"Company/Org":"Pagefind","Tool/Product/Project":"Pagefind","Reviewed":"2022-09-07","Scheduled for":"2022-09-08","URL":"https://pagefind.app/","Category":"Developer Tools - Site Search","Type":"Open Source","What is it?":"Static search library.","Len":"163","What we like":"Fulltext search without any backend infrastructure - indexes the output of static site build process i.e. the HTML. Integrate with your site using a provided UI component or with the JS API. Supports string or array filters and search across multiple sites. Static binary with no dynamic dependencies.","What we dislike":"Compatibility issues with WASM and Content Security Policies means you need to set script-src to ‘unsafe-eval’ for full browser support (mainly lagging on Safari).","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Plumber","Tool/Product/Project":"Plumber","Reviewed":"2022-09-07","Scheduled for":"2022-09-08","URL":"https://github.com/batchcorp/plumber","Category":"DevOps - Message queue","Type":"Open Source","What is it?":"Message queue CLI.","Len":"191","What we like":"Inspect, tail, write to, or redirect events in message queues. Supports a wide variety of queues e.g. Kafka, RabbitMQ, SQS, NSQ, GCP Pub/Sub. Pipe messages into the queue. Can decode various message formats in real-time e.g. protobuf, JSON, etc. Single binary for macOS, Windows, Linux.","What we dislike":"Limited docs for getting started e.g. connecting to backends requires passing IDs via CLI options or manually setting different environment variables. The --help flag provides useful details.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"just","Tool/Product/Project":"just","Reviewed":"2022-08-31","Scheduled for":"2022-09-01","URL":"https://just.systems/man/en/","Category":"Misc - Terminal utilities","Type":"Open Source","What is it?":"Command runner.","Len":"102","What we like":"Easy, but flexible CLI for running scripts as commands, which are stored in a `justfile` i.e. per project/directory. Commands can take arguments and load .env files. Write commands in arbitrary languages e.g. JS, Python, Ruby. Editor plugins for Vim, VS Code, JetBrains, etc. Proper error handling. Works on Mac, Linux, Windows.","What we dislike":"Assumes existence of `sh` on all platforms, but can be set to use something different e.g. PowerShell.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"SnapShooter","Tool/Product/Project":"SnapShooter","Reviewed":"2022-08-31","Scheduled for":"2022-09-01","URL":"https://snapshooter.com/","Category":"DevOps - Infrastructure automation","Type":"SaaS","What is it?":"Server, database, app backups.","Len":"167","What we like":"Run independent backups that would otherwise be a pain to deal with e.g. offsite AWS, GCP, DO volumes, MySQL, MongoDB, Postgres databases. Serverless backup runner or hosted on your own instances. Bring your own storage e.g. S3 (or any compatible), Google Drive, Dropbox. Can also backup apps like WordPress and repos from GitHub.","What we dislike":"Encryption is a premium feature. Missing support for some managed database features e.g. serverless export on Google Cloud SQL to avoid degrading the primary instance.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"k9s","Tool/Product/Project":"k9s","Reviewed":"2022-08-31","Scheduled for":"2022-09-01","URL":"https://k9scli.io/","Category":"DevOps - Containers","Type":"Open Source","What is it?":"k8s management TUI.","Len":"159","What we like":"Real-time view of your k8s cluster in a TUI. Provides a high level view of deployments, sets, pods, jobs, volumes, CPU, memory, etc. Drill-down views with more details and related resource usage. Log streaming view. Run commands e.g. scale, shell, kill. Keybindings, plugins, themes. Works on Mac, Linux, Windows.","What we dislike":"Generally expects the latest version of k8s and sufficient RBAC permissions, otherwise it may not work properly. Log output is quite raw and difficult to read.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"CodeSee","Tool/Product/Project":"CodeSee","Reviewed":"2022-08-24","Scheduled for":"2022-08-25","URL":"https://www.codesee.io/","Category":"Developer Tools - Documentation","Type":"SaaS","What is it?":"Code visibility.","Len":"53","What we like":"Generates visualizations of code relationships to help understand how the codebase works. Create visual tours of code to help onboard new engineers or document functionality. Maps are posted to pull requests like a visual diff of what was changed and can be used to tour the changes in logical order. Maps auto-update with commits.","What we dislike":"No dark mode. Only supports JS, TS, Python, Java, Go.","Interview":"/interviews/codesee-josh-leven/","Sponsored":"TRUE"},{"Company/Org":"Crunchy Data","Tool/Product/Project":"Postgres Playground","Reviewed":"2022-08-24","Scheduled for":"2022-08-25","URL":"https://www.crunchydata.com/developers/playground/psql-basics","Category":"Database - Relational database","Type":"Other","What is it?":"Postgres in the browser.","Len":"72","What we like":"A full Postgres instance compiled to WASM and running in your browser. Provided as an ephemeral playground which makes it easy to test commands and learn how things work. Several tutorials provided, including for features like partitioning and PostGIS. Interact via psql CLI.","What we dislike":"No persistence. Browser sandboxing prevents any other connection method.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"direnv","Tool/Product/Project":"direnv","Reviewed":"2022-08-24","Scheduled for":"2022-08-25","URL":"https://direnv.net/","Category":"Developer Tools - Local development","Type":"Open Source","What is it?":"Auto load env vars.","Len":"125","What we like":"Hooks into your shell to auto-load/unload environment variables when you cd into a directory. Loads a simple .envrc file in each directory. First-run in each dir asks for permission to mitigate malicious execution. The .envrc file can just be a list of exports, but it is also a bash script which allows you to execute other code. A useful stdlib of utility functions is provided.","What we dislike":"Aliases and functions not exportable due to how direnv loads the environment from a sub-process back into the original shell.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Eraser","Tool/Product/Project":"Eraser","Reviewed":"2022-08-17","Scheduled for":"2022-08-18","URL":"https://www.tryeraser.com/","Category":"Developer Tools - Code collaboration","Type":"SaaS","What is it?":"Whiteboards for developers.","Len":"142","What we like":"Combines markdown notes with a collaborative whiteboard. Developer specific components such as code blocks, browser frames, tech related icons, and sequence and entity relationship diagrams defined in code. Notes can link to specific areas of canvas. Keyboard commands for most actions. Signup not required.","What we dislike":"No dark mode. Images can be exported with a solid or transparent background, but the solid background is not configurable (it’s always white).","Interview":"","Sponsored":"TRUE"},{"Company/Org":"Grafana OnCall","Tool/Product/Project":"Grafana OnCall","Reviewed":"2022-08-17","Scheduled for":"2022-08-18","URL":"https://grafana.com/products/oncall/","Category":"DevOps - Observability","Type":"Open Source","What is it?":"On call management.","Len":"212","What we like":"Can manage schedules from whichever calendar you already use e.g. Google Calendar. Ingests alerts from a wide range of sources including Grafana, Prometheus, AWS, New Relic, Datadog. Handles rotations, overrides, upcoming shift notifications, and escalations. Configs can be managed in Terraform. Open source.","What we dislike":"Limited chat integrations (Slack, Telegram, MS Teams). More advanced features e.g. auto-create Zoom bridge & Slack room, take incident notes, timeline reports are in a separate product that is in private preview.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Hono","Tool/Product/Project":"Hono","Reviewed":"2022-08-17","Scheduled for":"2022-08-18","URL":"https://honojs.dev/","Category":"Cloud - Serverless","Type":"Open Source","What is it?":"Serverless worker framework.","Len":"106","What we like":"Supports Cloudflare Workers, Deno, Bun, Fastly, plus anything else that supports Web Standard API, which makes it simple to use and (mostly) works cross-platform. Built-in middleware for auth, cache, CORS, JSX, logs, JWT, JSON and static assets. Written in TS so you get proper types. Open source.","What we dislike":"There are some minor differences between platforms, such as the JWT middleware not being supported on Bun.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Steadybit","Tool/Product/Project":"Steadybit","Reviewed":"2022-08-10","Scheduled for":"2022-08-11","URL":"https://steadybit.com/","Category":"DevOps - Infrastructure automation","Type":"SaaS","What is it?":"Chaos engineering platform.","Len":"73","What we like":"Automate chaos testing in k8s, Docker, and Linux environments. Run experiments such as shut down instance or pod, simulate packet loss, drop DNS requests, and stress CPU. Control what is affected by attributes such as cloud zone, pod name, % of containers, etc. Simulate rippling outages across multiple applications. Trigger and monitor tests via CI/CD.","What we dislike":"Weak spot analysis not supported on GCP. Windows hosts are not supported.","Interview":"","Sponsored":"TRUE"},{"Company/Org":"ClinicJS","Tool/Product/Project":"ClinicJS","Reviewed":"2022-08-10","Scheduled for":"2022-08-11","URL":"https://clinicjs.org/","Category":"DevOps - Observability","Type":"Open Source","What is it?":"NodeJS performance tools.","Len":"89","What we like":"Provides a suite of tools for creating flame graphs, profiling CPU, GC, memory allocation, and async calls. Docs do a good job of walking through what the output means and how to solve common problems. Visualizes how async calls chain together and where time is spent. Open source.","What we dislike":"NodeJS only. Not supposed to run in production, so doesn’t help with prod-related issues.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Nano ID","Tool/Product/Project":"Nano ID","Reviewed":"2022-08-10","Scheduled for":"2022-08-11","URL":"https://github.com/ai/nanoid","Category":"Developer Tools - Local development","Type":"Open Source","What is it?":"Tiny, URL friendly IDs.","Len":"143","What we like":"Easier to work with than UUIDs e.g. you can double click and copy them from a URL. Uses more (configurable) characters than UUID so the ID size can be reduced (also configurable). Faster to generate than UUID. Collision probability can be calculated based on config values so you can trade off usability for chance of collision. Available for lots of languages.","What we dislike":"If you need to (effectively) guarantee uniqueness then UUID is better. Can’t take advantage of specialist database types e.g. UUID in Postgres.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Stellate","Tool/Product/Project":"Stellate","Reviewed":"2022-08-03","Scheduled for":"2022-08-04","URL":"https://stellate.co/","Category":"Cloud - CDN","Type":"SaaS","What is it?":"GraphQL caching & analytics.","Len":"166","What we like":"Config is defined in a TS|JS|YML file in your code repo. Query caching is automatic, but can be made smarter by syncing the schema (via CLI or CI). Fine-grained cache rules per type or field. Cache invalidation can be based on TTL or mutations. Supports query batching without any server-side changes.","What we dislike":"There are some size limits to be aware of e.g. 40KB maximum query size and 10MB response cache limit. Empty responses are also not cached. No support for rate limits.","Interview":"/interviews/stellate-max-stoiber/","Sponsored":"FALSE"},{"Company/Org":"multi-gitter","Tool/Product/Project":"multi-gitter","Reviewed":"2022-08-03","Scheduled for":"2022-08-04","URL":"https://github.com/lindell/multi-gitter","Category":"Developer Tools - Git tools","Type":"Open Source","What is it?":"Run scripts across Git repos.","Len":"66","What we like":"Simple CLI to run scripts across multiple Git repos or all repos in an org. Can run a shell script or run code through a runtime e.g. Python or node. Clones the repo, runs the script, then submits a PR with the changes. Can run against branches. All configurable e.g. PR title and description. Open source.","What we dislike":"Requires some kind of Git host - GitHub, GitLab, Gitea, BitBucket.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Remix","Tool/Product/Project":"Remix","Reviewed":"2022-08-03","Scheduled for":"2022-08-04","URL":"https://remix.run/","Category":"Developer Tools - Frontend framework","Type":"Open Source","What is it?":"Frontend framework.","Len":"158","What we like":"Builds on standard web APIs e.g. Fetch and Form rather than custom implementations. Clear separation between client and server with strong preference for server-side rendering. Progressive enhancement - JS not required. Performance focused by only reloading what has changed. TypeScript by default. Accessibility built in.","What we dislike":"Some libraries / modules don’t work where they assume they run in the browser or a full Node environment. There are workarounds, but this can be a constraint.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Teleport","Tool/Product/Project":"Teleport","Reviewed":"2022-07-27","Scheduled for":"2022-07-28","URL":"https://goteleport.com/","Category":"Security - Authentication","Type":"Open Source","What is it?":"Remote access management.","Len":"144","What we like":"New passwordless feature enables WebAuthn e.g. Apple TouchID, FIDO keys, etc, to authenticate users. Users can be provisioned on demand e.g. assuming a particular role with restricted permissions. “Just in time” access requests via tickets (JIRA) or chat (Slack) for approval flows. All this helps implement concept of least privileged access. Open source. ","What we dislike":"Windows Hello only supports Web UI, not terminal access. Teleport Connect local GUI offers an easy way to access all resources, but is Mac only.","Interview":"/interviews/teleport-isaiah-becker-mayer/","Sponsored":"TRUE"},{"Company/Org":"CotEditor","Tool/Product/Project":"CotEditor","Reviewed":"2022-07-27","Scheduled for":"2022-07-28","URL":"https://coteditor.com/","Category":"Developer Tools - Text editors","Type":"Open Source","What is it?":"Plain-text editor for macOS.","Len":"76","What we like":"Very lightweight and minimalist. Syntax highlighting for lots of formats. Basic content parsing e.g. highlighting matching braces. Supports splits. Has themes, or just uses macOS default look. Text editing features like outline, snippets, smart substitutions. Implemented in Swift and open source.","What we dislike":"Default font is Helvetica - nice for plain text, but feels strange for code.","Interview":"","Sponsored":"FALSE"}],"header":["Company/Org","Tool/Product/Project","Reviewed","Scheduled for","URL","Category","Type","What is it?","Len","What we like","Len","What we dislike","Len","Interview","Sponsored"],"range":"'All Tools'!A1:O90"}}]}
