{"items": [{"Company/Org": "Temporal", "Tool/Product/Project": "Temporal", "Reviewed": "2021-03-16", "Scheduled for": "2021-04-01", "URL": "https://temporal.io/", "Category": "API", "Type": "Open Source", "What is it?": "Framework for workflow orchestration.", "What we like": "Deals with the underlying infrastructure for reliable task execution: state management, retries, scaling, fault tolerance. Avoid building and running your own timers / queues - just write the function business logic. Open source server you can run yourself, or use their cloud option (in private beta).", "What we dislike": "SDKs are still being built out (currently available for Go, Java, PHP, Ruby). You still need to run / scale your own database (Cassandra, MySQL, or PostgreSQL). ", "Twitter": "@temporalio", "Source": "COSS Funding List"}, {"Company/Org": "Mirage JS", "Tool/Product/Project": "Mirage JS", "Reviewed": "2021-03-29", "Scheduled for": "2021-04-01", "URL": "https://miragejs.com", "Category": "Developer Tools", "Type": "Open Source", "What is it?": "API mocking library for frontend developers.", "What we like": "Intercepts all XMLHttpRequest and fetch requests so no code changes required (one additional import). Includes in-memory database for persistence tests. Can simulate slow responses or errors. Built-in ORM handles data relationships, output formatting, serialization.", "What we dislike": "Only supports REST APIs out of the box - GraphQL available as an optional plugin (still in development). Runs in the browser, not as a server, so it cannot be used to mock server-side APIs.", "Twitter": "@miragejs", "Source": ""}, {"Company/Org": "git-plan", "Tool/Product/Project": "git-plan", "Reviewed": "2021-03-30", "Scheduled for": "2021-04-01", "URL": "https://github.com/synek/git-plan", "Category": "Developer Tools", "Type": "Open Source", "What is it?": "Git workflow for planning / writing commits in advance.", "What we like": "Forces you to think about what you are going to work on in advance - writing out a plan probably helps improve your thinking, and also creates better commit messages. If you think of something you need to switch to, you can create a plan whilst it’s still top-of-mind, then come back to it later.", "What we dislike": "Unintuitive to begin with, but makes sense once you try it (see blog posts linked in the project readme for guidance). Interactive rebasing is an alternative that doesn’t force you to reverse your workflow.", "Twitter": "@ryrobyrne", "Source": "Lobsters"}]}