{"results":[{"command":{"func":"getData","kwargs":[{"range":"'All Tools'!A:O","hasHeaderRow":true},null]},"result":{"rawData":[["CloudGraph","CloudGraph","2021-11-10","2021-11-11","https://github.com/cloudgraphdev/cli","API - API","Open Source","GraphQL API for your cloud resources.","37","Use GraphQL to query resources. Queries run against a cached database which you can scale yourself, avoiding AWS limits. Consistent interface across products - avoid complex JOINs. Query historical state because data is versioned. Bundled UI with autocompletion and schema explorer.","282","Currently only supports AWS. Deployment is currently manual (or via Docker). Docs are still quite limited.","106","/interviews/cloudgraph-tyson-kunovsky/","TRUE"],["sysz","sysz","2021-11-10","2021-11-11","https://github.com/joehillen/sysz","Misc - Terminal utilities","Open Source","Search TUI for systemctl.","25","Quickly search and filter system and user units. State view shows service metadata plus recent logs. Shortcuts for filtering by state and reloading. Prompts to run relevant commands.","182","Requires fzf, which must be installed manually. Assumes you know what you’re doing, but since it’s Linux-only, you probably do.","127","","FALSE"],["Edamagit","Edamagit","2021-11-10","2021-11-11","https://github.com/kahole/edamagit","Developer Tools - Git tools","Open Source","Magit (better Git) for VSCode.","30","Significantly speed up common git tasks with shortcuts. Improved version control view with show/hide diff, easily stage individual files or multi-select changes. Stage chunks of changes. Forge mode provides extra context from GitHub e.g. issues, PRs.","250","Forge mode slows down status view initial load. Doesn’t yet support the more advanced features from Magit (advanced diff, bisect, patch).","137","","FALSE"],["Plow","Plow","2021-11-03","2021-11-04","https://github.com/six-ddc/plow","Developer Tools - Benchmarking / Load testing","Open Source","High-performance HTTP benchmarking.","35","Displays real-time stats as tests are executed, both on the CLI and via a web UI. Reports latency, req/s, errors, read/writes. Includes latency histogram and percentiles. Supports all HTTP verbs including reading in POST data from a file. Dockerfile provided.","259","Histogram charts disappear and web UI stops serving on test completion.","71","","FALSE"],["SQLime","SQLime","2021-11-03","2021-11-04","https://sqlime.org/","Database - Relational database","Open Source","SQLite browser playground.","26","Runs a full version of SQLite entirely in the browser. Can load DB files from a URL or a file. Can optionally sync with GitHub to save data and queries in plain text. Easy to share via a link. There is no server. Open source.","225","No code completion. No error handling UI (check the browser console).","69","","FALSE"],["werf","werf","2021-11-03","2021-11-04","https://werf.io/","DevOps - CI/CD","Open Source","Git CLI for consistent delivery & deployment.","45","Implements automated delivery from Git to k8s. “giterminism” concept provides reproducibility without external config dependencies - everything is based on the git repo. Handles Docker image builds, k8s rollout and cleanup. Can be embedded in existing CI/CD pipelines. Generates and manages Helm templates.","306","Needs expanded guides for languages - basics are covered but missing more detailed real-world examples. Assumes you’re running on k8s.","134","","FALSE"],["FireHydrant","FireHydrant","2021-10-27","2021-10-28","https://firehydrant.io/","DevOps - Infrastructure automation","SaaS","Incident response automation.","29","Automate tedious incident handling workflows e.g. create new Slack room, status page update, create Zoom bridge. Inventory catalog assigns teams and aggregates useful tools (e.g. PagerDuty on call, Datadog dashboard, last GitHub event) for quick lookup during incidents. Auto-generate timelines based on chat logs, events, actions to make retrospectives easier.","361","Small number of integrations e.g. assumes using Slack for chat, JIRA for tickets, Zoom/Meet for conferencing.","109","/interviews/firehydrant-robert-ross/","TRUE"],["OpenReplay","OpenReplay","2021-10-27","2021-10-28","https://openreplay.com/","DevOps - Error logging","Open Source","Open source session replay debugging.","37","Record and debug user sessions with full devtool capture (JS errors, network, perf, state). Sanitize data before it is captured through generic global rules or HTML attributes. Can un-minify JS with source maps. Plugins to capture API requests e.g. GraphQL and correlate with backend monitoring (Datadog, New Relic, Cloudwatch, etc).","333","Limited documentation for scalability and reliability - you must manage multiple components e.g. Redis, PostgreSQL (a fully managed cloud version is available). Data exporter only available in enterprise version.","212","","FALSE"],["git-bug","git-bug","2021-10-27","2021-10-28","https://github.com/MichaelMure/git-bug","Developer Tools - Git tools","Open Source","Bug tracker embedded in your git repo.","38","Work from a CLI, interactive TUI or web UI. Doesn’t pollute your repo (everything lives in .git) and interactions are like normal Git (add, push, pull, etc). Issues can live alongside the code repo they belong to. Can bridge with GitHub, GitLab and JIRA so you can use git-bug and others can stick with a centralized server.","324","Web UI is currently read-only. Does not support media file attachments. Not a stable release yet, but still worth playing with.","127","","FALSE"],["immudb","immudb","2021-10-20","2021-10-21","https://github.com/codenotary/immudb","Database - Relational database","Open Source","Open source immutable database.","31","Can be used as a database server or as a library. Acts as a k/v store or can be queried using SQL. Storage agnostic - can even be S3. Built-in Prometheus endpoint. Can disable synchronous indexing to increase performance. Supports PostgreSQL wire protocol. Interesting use case as a secondary database for cryptographic verification of the primary.","348","Only Go SDK is fully developed - others still in progress. No replication or hot backup support yet.","100","/interviews/immudb-jeronimo-irazabal/","TRUE"],["gron","gron","2021-10-20","2021-10-21","https://github.com/tomnomnom/gron","Misc - Terminal utilities","Open Source","Makes JSON greppable.\n","22","Supports input from a file, URL or stdin so it can be piped to grep and properly searched. Allows the full path to be revealed. Colorizes output. Easily diff sets of JSON. ungron reverses the conversion, so you can pipe grep results back to JSON. Cross-platform binaries available for Windows, Linux and Mac.","308","You could just use jq which has more features, but it assumes you know more about your JSON data structure. gron is deliberately simple and grep is well known.","159","","FALSE"],["git-branchless","git-branchless","2021-10-20","2021-10-21","https://github.com/arxanas/git-branchless","Developer Tools - Git tools","Open Source","Git tools for repo visualization and navigation.","48","Allows you to move between stacks of commits without using branches. `git move` is implemented in-memory so is faster than `git rebase`, which works on-disk. Interactive `git undo` command helps fix commits, merges, rebases, checkouts and branches. Smartlog command visualizes work without branches (unlike `git log --graph`).","326","No release binaries - must be installed (and compiled) with Rust’s cargo. Not designed to handle untracked files.","113","","FALSE"],["LambdaTest","LambdaTest","2021-10-13","2021-10-14","https://www.lambdatest.com/","Developer Tools - Browser testing","SaaS","Cross browser testing platform.","31","Lots of desktop and mobile browser versions, including very old devices and new betas. Can write tests in open source Selenium or Cypress frameworks. Tests can be automatically compared against previous runs. Integrates into CI/CD to detect regressions. Geotarget features can test localization e.g. currencies, time zone changes etc.","334","Mobile tests are executed on emulators (real device support currently in beta). No support for testing on Linux.","112","/interviews/lambdatest-mayank-bhola/","TRUE"],["Delta","Delta","2021-10-13","2021-10-14","https://github.com/dandavison/delta","Developer Tools - Git tools","Open Source","CLI for (git) code diffs.","25","Displays line numbers. Side by side view. Can be used independently from the terminal, but configured through git means it supports all git features outputting code. Highly configurable theming and output options e.g. colors, line number styles. Cross platform and OS packages for multiple systems.","298","Colorized output does not follow the current terminal theme - must be independently configured. ","96","","FALSE"],["exo","exo","2021-10-06","2021-10-07","https://exo.deref.io/","Developer Tools - Local development","Open Source","Process and log manager for dev.","32","Runs the commands from your Procfile or Docker Compose config e.g. running separate commands to launch your project’s UI and API. Aggregates logs into a single, colorized terminal output. Local web GUI allows log toggle, search & filtering, manage spawned processes and other resources e.g. Docker storage. CLI can control processes, query logs and daemonize.","359","Weird, custom open source license. Web docs could do with expanding - CLI has a useful builtin help command though. No OS packages - binaries for Linux and macOS only.","167","","FALSE"],["Unleash","Unleash","2021-10-06","2021-10-07","https://www.getunleash.io/","Developer Tools - Testing frameworks","Open Source","Open source feature flags.","26","Local evaluation of feature toggles avoids network latency. SDKs for all major languages. Proxy module means it can work even for single page apps. Support for gradual rollout and user segmentation strategies e.g. by user profile fields. Tech debt dashboard tracks use of feature flags and warns if they are unused.","315","Unclear how to deploy in a high availability configuration. Limited usage stats (evaluations over the last minute and hour).\n","125","","FALSE"],["CodeSee","CodeSee Maps","2021-09-29","2021-09-30","https://www.codesee.io/","Developer Tools - Documentation","SaaS","Code maps as documentation.","27","Highlights dependencies and related code structure. Code maps auto-update with each commit - map diffs posted into GitHub PRs. Can build step-by-step tours for onboarding new devs into the codebase. Auto heat maps by latest activity, creation date or commit count.","264","Requires GitHub. Currently only supports dependency resolution for 4 languages (Python, JS, Java, Go).","102","/interviews/codesee-shanea-leven/","TRUE"],["procs","procs","2021-09-29","2021-09-30","https://github.com/dalance/procs","Misc - Terminal utilities","Open Source","Process status viewer; replacement for ps.","42","Uses terminal theme colors. Layout makes it easy to read. Tree option shows parent and child processes. Can look into Docker to reveal container name & commands. Watch mode like top. Columns can be configured at run time or in a config file. Can show ports processes are listening on. Cross-platform support.","308","macOS and Windows support is experimental (worked fine in our tests). No pager on Windows. Search is case sensitive.","116","","FALSE"],["zoxide","zoxide","2021-09-21","2021-09-23","https://github.com/ajeetdsouza/zoxide","Misc - Terminal utilities","Open Source","Smarter cd for your terminal.","29","Ranking algorithm means it usually guesses which path you mean so you can navigate common long paths without typing them all out. Multi-platform options for installing. Includes an fzf-powered interactive mode. Integrations available for Emacs, Ranger, Neovim. Zsh autocomplete available.","288","Years of muscle memory using cd means you probably want to alias it to zoxide. Renamed paths can confuse the history - need to edit the DB to update them.","154","","FALSE"],["HTTP Toolkit","HTTP Toolkit","2021-09-21","2021-09-23","https://httptoolkit.tech/","Developer Tools - Browser testing","Desktop","Intercept, mock, rewrite HTTP requests.","39","Auto connects to Brave, Firefox, Chrome, terminal, Android, Edge or acts as a generic proxy. Inspect all HTTP requests. Create rules (match on regex, URL, host, JSON, headers), intercept and rewrite - pause requests to manually edit them, time out, transform, forward to different hosts or return fixed responses. Open source.","326","No support for Safari, iOS or Docker (on the roadmap). No free trial for pro features like import/export HAR, more advanced rules, mock API templates, etc.","155","","FALSE"],["Slim.AI","Slim.AI","2021-09-15","2021-09-16","https://www.slim.ai/","DevOps - Containers","SaaS","Container analysis and comparison.","34","Quickly examine or search the full contents of any container - files, layers, Dockerfile. Visual diff of file system, image metadata, and Dockerfile between container versions makes it easy to see what has changed. Examine popular public images and connect private registries (Docker Hub, GCR, AWS ECR).","303","Does not yet support GitHub Container Registry. Would like to see saved searches or suggested alerts to monitor for common issues with new versions.","148","/interviews/slimai-john-amaral/","TRUE"],["Oso","Oso","2021-09-15","2021-09-16","https://www.osohq.com","Security - Authentication","Open Source","Declarative application authorization framework.","48","Methods for enforcement at request and field level. Relations allow hierarchical access control. Data filtering converts policy expressions into DB query plans to efficiently retrieve only the data that matches the filter. Generic policy language is evaluated locally by language-SDKs (NodeJS, Java, Python, Ruby, Go, Rust).","324","Provides the hooks for framework / ORE integrations but you still need to build them. Currently focused on backend auth - anything frontend you need to figure out yourself.","172","/interviews/oso-sam-scott/","TRUE"],["Cue","Cue","2021-09-08","2021-09-09","https://cuelang.org/","Developer Tools - Testing frameworks","Open Source","Data validation language.","25","Helps validate files, APIs and configs e.g. k8s files. Definitions start broad e.g. types then narrow down e.g. values, so it is easy to get started, but still supports specific validations. Language is a JSON superset. Supports comments (unlike JSON!). Can extract existing definitions from Go and Protobufs.","309","Documentation explains the concepts well but is missing a “from zero” getting started tutorial (the k8s tutorial is good, though).","130","","FALSE"],["Leapp","Leapp","2021-09-08","2021-09-09","https://www.leapp.cloud/","Security - Authentication","Desktop","Manage cloud access credentials.","32","Stores access credentials in native OS storage e.g. Windows Credential Vault, macOS Keychain. Easy to switch between credentials e.g. AWS IAM, Azure User. Session credentials are temporary, minimizing risk of leaks and making them easy to rotate. Open source.","259","Only supports AWS and Azure. No U2F support. Supports some federated identity providers e.g. Okta, GSuite, AWS SSO, but only to AWS and Azure.","142","","FALSE"],["Tyk","Tyk","2021-09-01","2021-09-02","https://tyk.io/","DevOps - API Management","Open Source","API gateway.","12","Supports all API protocols (REST, GraphQL, TCP, gRPC). Handles API versioning and deprecation. Hot-reload without dropping requests. Minimal dependencies (Redis for distributed rate limits and tokens). Drop-in products for developer portal + docs, analytics, social auth, management dashboard. Open source or cloud options.","323","Architecture gets complex once you start to add the extra components, which are also not open source. Historical performance issues in older versions due to overhead of some features enabled by default (reportedly now fixed).","225","","FALSE"],["DeepSource","DeepSource","2021-09-01","2021-09-02","https://deepsource.io/","Developer Tools - Source control","SaaS","Automated code reviews.","23","Catches common issues which can either be fixed as part of a PR and/or blocked by CI. Can open “Autofix” PRs for code issues as well as linting errors. Examines docs and code coverage and reports metrics for both. Image badges for readme files. Can configure analysis via a config file in the repo or via the UI. Self-hosted version available.","343","Doesn’t explain “why?” you should make the suggested changes or follow its rules - good to fix errors but better to understand how to avoid them in the future. Autofix can’t solve everything (yet?).","198","","FALSE"],["Fission","Fission","2021-08-25","2021-08-26","https://fission.codes/","Developer Tools - Backend framework","Open Source","Decentralized app backend for storage and identity.","51","Abstracts auth and storage so you can use P2P decentralized tech like IPFS without worrying about the underlying protocol. Web Native File System works across platforms and has a POSIX-style interface. Supports storage/execution of WebAssembly modules which are then available on every platform. Open source.","308","Auth tokens live in browser storage so you could lose access if you clear the data. Risky to rely on such an early new backend tech that is not yet standardized and built by a new startup (everything is open source so you can run it yourself).","243","/interviews/fission-brooklyn-zelenka/","FALSE"],["AskGit","AskGit","2021-08-25","2021-08-26","https://github.com/askgitdev/askgit","Developer Tools - Git tools","Open Source","Query git repos with SQL.","25","Web demo allows you to query any public repo (+ GitHub issues), or download the CLI. Can do complex queries like commits by email domain, most frequently changed files, filter by branch. Supports querying GitHub API e.g. query stars, repo language stats, issues/PRs. Outputs as an ASCII table, JSON, CSV or SQLite file for other tools to query the results.","356","Queries can be slow - several seconds. Read-only queries. Only integrated with GitHub Issues (for now).","103","","FALSE"],["Sourcegraph","Sourcegraph","2021-08-18","2021-08-19","https://sourcegraph.com/search","Developer Tools - Code collaboration","Other","Code search engine.","19","Code structure search on syntax e.g. function arguments, multi-line blocks, JSON structures. Can scope to repos (public / private), commit diffs/dates, languages. Option for self-hosted indexer for private code. Browser & IDE extensions for quick search and overlay on top of existing tools e.g. GitHub/GitLab PRs. CLI or web UI (with dark mode).","346","No custom theme support for the web UI. Can’t search issue trackers.","68","/interviews/sourcegraph-beyang-liu/","TRUE"],["Hoppscotch","Hoppscotch","2021-08-18","2021-08-19","https://hoppscotch.io/","Developer Tools - Code collaboration","Open Source","Test UI for API requests.","25","Build & execute HTTP, GraphQL & WebSocket requests. Syntax highlighted response parsing. Generate code to execute requests via curl, Go, Python, and other languages. Save config to local storage or GitHub Gist. Also available as a Chrome or Firefox extension. CLI in beta. Open source.","285","Can’t automate a chain of requests - have to manually set up each request. Can’t support cookie headers due to browser security limitations.","140","","FALSE"],["Appsmith","Appsmith","2021-08-11","2021-08-12","https://www.appsmith.com/","Developer Tools - UI Builder","Open Source","Open source internal tool builder.","34","Quickly build interfaces to existing databases. Proxies queries to the data source so results are not stored. Easy form construction with validation and data binding. Can use JS to write data transformations (both read and write). If the GUI concepts are too restrictive, you can always fall back to JS to customize widgets. Open source so you can host it all inside your own network.","384","No user collaboration in the UI editor so others editing the same project can overwrite each other. Your UI config is stored inside Appsmith’s database (MongoDB) so you can’t use version control (can be exported to JSON).","221","/interviews/appsmith-arpit-mohan/","FALSE"],["Retool","Retool","2021-08-11","2021-08-12","https://retool.com/","Developer Tools - UI Builder","SaaS","Internal tool builder.","22","Supports staging / non-staging environments. Datasources can be databases like MySQL and Postgres or APIs like Stripe, S3 or GraphQL. Can query all sources with SQL even if they aren’t databases. Everything is a JS object you can manipulate. You can build your own custom React components. Can configure your own Redis/Memcached cache.","335","Not open source, but there is a self-hosted option. Ability to sync to Git is enterprise-only. Doesn’t support complex logic e.g. multiple API calls.","149","/interviews/retool-snir-kodesh/","FALSE"],["Snyk","Snyk Open Source","2021-08-05","2021-08-05","https://snyk.io/product/open-source-security-management/?utm_medium=Organic-Email&utm_source=consoledev&utm_content=snyk-open-source","Security - Vulnerability management","SaaS","Dependency security monitoring for open source.","47","Easy to see security status for everything. Scans full dependency tree revealing your actual security posture e.g. vulns in dependency dependencies. Relative severity scoring helps understand how relevant issues are. Inspects containers & OS packages as well as code. Separates dev dependencies from prod. Multiple options for fixes e.g. via CLI, not just PRs.","360","Showing vulnerabilities in dependency dependencies is interesting, but what are you going to do about them? CLI to apply fixes still in beta (Python only).","155","/interviews/snyk-guy-podjarny/","FALSE"],["OSSF","Security Scorecard","2021-08-05","2021-08-05","https://github.com/ossf/scorecard","Security - Vulnerability management","Open Source","Security health metrics for open source.","40","Assessment criteria are objective, consistent and documented so OSS projects can start to adopt them. Makes it easy to assess the security posture of the projects you rely on. CLI output is clear why a check fails. Can scan a GitHub repo or infer it from npm, pypi or rubygem package names. JSON or CSV output means results can be scripted.","340","Some assessment criteria (such as looking for commits from >1 GitHub organizations) may be onerous for small, one-person projects. No easy way to integrate into CI/CD yet (on the roadmap).","188","","FALSE"],["Liveblocks","Liveblocks","2021-07-16","2021-07-29","https://liveblocks.io/","Developer Tools - Frontend framework","SaaS","Real-time collaboration API.","28","Components to easily add live presence (live cursors, chat and reactions). Abstracts away the backend implementation challenges - networking, performance, presence detection, multi-browser support. Vendored as React / Node packages. Auth hooks to validate user permissions. Examples for raw JS, Next.js, Nuxt.js and React + Firebase.","333","Assumes you’re building with web technologies i.e. JS. No mobile support. Still requires implementing authentication. Classic build vs buy - is it a good use of your time to try and build this?","193","/interviews/liveblocks-guillaume-salles/","TRUE"],["Livekit","Livekit","2021-07-19","2021-07-29","https://livekit.io/","API - Communication","Open Source","Open source live video and audio API.","37","SDKs for React, JS, iOS and Android to build video / audio without needing to understand WebRTC. Selective Forwarding Unit server makes it easy to scale from P2P to supporting large numbers of participants. Server scales horizontally using Redis as the backend. Automatically supports different connection types (UDP, TCP, TURN) and simulcasting.","346","Still need to set up SSL + load balancers. Using a server component defeats the idea of P2P. Your code still needs to deal with issuing access tokens to each participant. Simulcasting only works in the browser/JS SDK.","217","/interviews/livekit-david-zhao/","FALSE"],["Polypane","Polypane","2021-06-18","2021-07-22","https://polypane.app/","Developer Tools - Browser testing","Desktop","Browser testing tool.","21","Multiple browser panes side-by-side to test various sizes. Inspect element works across panes simultaneously. Scroll sync helps comparison. Built on Chrome so devtools available. Shows Web Vitals scores. Can trigger media features e.g. prefers-color-scheme, reduced-motion. Debug tools like a11y, CSS injection, disable images, mobile reachability.","348","Signup/license key process is a bit fiddly. Quite CPU intensive. You need a very big screen to see all the windows properly.","124","","FALSE"],["automerge","automerge","2021-06-12","2021-07-22","https://github.com/automerge/automerge","Developer Tools - Backend framework","Open Source","Conflict-free JSON-like data structure.","39","Built for JS applications to allow read/write to properties whilst avoiding conflicts. Maintains a history of all changes. Network-agnostic but includes a sync protocol for send/receive messages. Custom types for conflict free counters, collaborative text editing and tables. Follows the idea of functional reactive programming.","328","Documents are not actually immutable by default - you just code as if they are. Enforcing this can be turned on but has a major performance hit. Implementation is only in JS but versions in Rust, Swift, Python in various stages of development.\n","244","","FALSE"],["Tuple","Tuple","2021-06-22","2021-07-15","https://tuple.app","Developer Tools - Code collaboration","Desktop","Screen sharing optimized for developers.","40","Quick start a P2P encrypted call + screen sharing session. Quality settings go up to 5k to make code crisp and easy to read, unlike generic conferencing services. Easy to take control to type, send through keyboard shortcuts, highlight areas of the screen. Live call debug info to see any connection problems. The “ship it” stamp effect is fun.","344","Really needs a high quality connection otherwise you can’t reach the higher resolutions and the mouse/keyboard sharing is laggy. macOS only - Linux client on the roadmap for 2021.","179","/interviews/tuple-ben-orenstein/","FALSE"],["GitHub","GitHub Copilot","2021-07-08","2021-07-15","https://copilot.github.com/","Developer Tools - IDE","SaaS","AI pair programming for VS Code.","32","Autocomplete is accurate - speeds up work on a line-by-line basis, just like GMail/Google Docs. Understands file context - imports, variable names, etc. Using comments to describe what you want to do then reviewing suggestions is like doing a web search. Time saver for simple, common, but annoying tasks e.g. regexes, test skeletons.","334","Not clear if it’s thinking or not - sometimes you wait for nothing to happen. Licensing questions remain unanswered - is the code a derivative of copyrighted material? Doesn’t understand project context.","203","","FALSE"],["Hashicorp","Waypoint","2021-06-16","2021-07-08","https://www.waypointproject.io/","DevOps - CI/CD","Open Source","Build, deploy, and release across platforms.","44","Single command to get your code into production. Can track Git repos to auto-deploy. Integrates with AWS, Azure, Google to upload artifacts, configure LBs, DNS, env vars, etc. Stream logs and execute remote commands. Preview URLs for staging. Web dashboard summarizes deploy status. Extensible hooks via plugins.","312","Assumes your app is containerized. Need to run / maintain your own Waypoint server - still early so not entirely prod-ready. Preview URLs are public so you must set up authorization or disable them (self-hosting URL service is an option, but complex).","251","","FALSE"],["Zellij","Zellij","2021-06-14","2021-07-08","https://zellij.dev/","Misc - Terminal emulators","Open Source","Terminal workspace manager (tabs + multiplexing).","49","Built-in tabs, panes, sessions, resizing, scrollback. Shows (customizable) keybindings to help discovery. “New pane” algorithmically placed in the most optimized position (or use manual splits). Can configure layouts in yaml then auto start them. Single compiled binary. Has a built-in file manager (a clone of ranger). WASM-based plugin system.","345","Colors not inherited from existing shell config. Docs are still very limited. Some core shortcuts used by other tools e.g. Ctrl + r in bash (use Zellij lock mode to pass these through). Slightly laggy over remote connections (compared to tmux).","244","","FALSE"],["Prestige","Prestige","2021-06-17","2021-07-01","https://prestigemad.com/","Developer Tools - API Client","Open Source","Browser- and text-based HTTP client.","36","Really simple way to execute HTTP commands but can also send more complex requests e.g. headers, file uploads, cookies, JSON. Can write commands in plain text, JS, or define variables in templates. Prettified and syntax-highlighted response parsing. Can save to local browser storage (GitHub and others on roadmap). Open source codebase.","337","Requests run through a proxy rather than your browser (due to CORS), but localhost URLs are routed directly. No support for OAuth APIs.","135","","FALSE"],["chezmoi","chezmoi","2021-06-17","2021-07-01","https://www.chezmoi.io/","Misc - Terminal utilities","Open Source","dotfile manager.","16","Single compiled binary. No bootstrap requirements - supports many platforms. Can query password manager for secrets and supports encrypted files. Configs can be templated for differences across environments. Can run scripts, including run-once (ideal for cloud IDEs or ephemeral environments). File edit flow similar to git (which is used for versioning).","355","You can edit files directly but using the edit flow ensures changes/conflicts are handled properly, which may require retraining muscle memory. Doesn’t handle git subdirectories e.g. Oh My Zsh particularly well (better to use a script to install outside of chezmoi).","266","","FALSE"],["IPInfo","IPInfo","2021-06-07","2021-06-24","https://ipinfo.io","API - API","SaaS","CLI for IP address metadata lookup.","35","Lookup IP details such as ASN, location, hostname, abuse contact, tor/VPN/hosting IP categorization. Cross-platform binaries. Colored output. Bulk summarize IPs from a file (or piped in). Bash, zsh, fish auto-completion. SDKs available for major languages.","256","Responses not cached. Available via Homebrew on Mac but not Linux or Windows package managers. No man pages.","108","","TRUE"],["gitui","gitui","2021-06-02","2021-06-24","https://github.com/extrawurst/gitui","Developer Tools - Git tools","Open Source","Fast git TUI.","13","Focus on high-performance repo parsing using async means the UI is responsive, low memory and low CPU even for the largest of repos. Keyboard control of common tasks e.g. stash, stage, diff review and commit with keybindings highlighted for newer users (or when you forget). Adopts terminal color scheme. Cross-platform packages (Arch, Fedora, Homebrew, Chocolatey, Nix).","371","No log search or file history log and does not yet support bare repos (all on the roadmap).","91","","FALSE"],["GitLive","GitLive","2021-06-02","2021-06-17","https://git.live","Developer Tools - Code collaboration","Desktop","Live Git diffs for uncommitted changes.","39","Real-time change indicators show where others have made changes to files but not yet committed. Preview live diffs and get warnings about conflicts from other collaborators. Privacy option to stop sharing when required. Built-in video calls and codesharing which works across IDEs - VS Code, JetBrains, Android Studio.","318","Requires everyone to use GitLive and one of the supported editors. Uploads code diffs (not the full source) to GitLive servers while changes are uncommitted, deleted once pushed.","178","/interviews/gitlive-nick-bransby-williams/","FALSE"],["Runops","Runops","2021-06-14","2021-06-17","https://runops.io/","DevOps - Infrastructure automation","SaaS","Control access to run commands in production.","45","Terminal-based signup/demo. Template / version control production commands - scripts, databases, containers, cloud consoles. CLI or Slack Bot to trigger them without direct prod access. Auth/approval flows before commands execute. Optional self-hosted runner with secrets stored in your own secrets storage. Auto-redaction of sensitive logs. Bastion SSH support.","362","Cloud version requires public access to resources e.g. database connection URL, and doesn’t support IP allowlists - self-hosted runner allows private network access. Reliant on Slack for approvals, team management, etc.","219","","FALSE"],["Filippo Valsorda","mkcert","2021-06-04","2021-06-10","https://github.com/FiloSottile/mkcert","Developer Tools - Local development","Open Source","CLI for managing local dev certificates.","40","Solves the hassle of configuring SSL for local dev endpoints by configuring and managing a root CA. Means you don’t need to leave testing SSL to staging (or prod!) or store real certs locally. Allows you to generate certs for localhost. Cross platform + support for browser specific root stores.","295","You still need to configure your server to use the certs. GitHub binaries built with a slightly older version of Go (1.13) so no Apple Silicon support - use the homebrew version which does have Apple Silicon binaries.","217","","FALSE"],["Openbase","Openbase","2021-06-03","2021-06-10","https://openbase.com","Developer Tools - Dependency management","SaaS","Database of open source packages.","33","Packages ranked based on various criteria such as documentation, performance, popularity. Categories for common use cases to help find most used packages. Analyze dependencies and project activity e.g. release cadence, commit frequency.","236","Only supports searching JS packages - leaderboards available for Python, Rust, Go, Swift and Java libraries. Some criteria are more subjective than others e.g. are frequent commits good or bad?","193","","FALSE"],["gitmoji-cli","gitmoji-cli","2021-05-20","2021-06-03","https://github.com/carloscuesta/gitmoji-cli","Developer Tools - Git tools","Open Source","CLI to add Gitmoji to commits.","30","gitmoji helps identify commits at a glance. CLI sets up a Git commit hook to trigger the interactive CLI to pick a gitmoji for the commit. Text search to find right emoji based on commit purpose. Can be configured to use Conventional Commits scopes.","249","By default only renders on GitHub, but you can configure it to use actual emoji characters. Some may consider this polluting the git log, especially if you write your commits properly and use git shortlog in your release notes.","227","","FALSE"],["Xonsh","Xonsh","2021-03-26","2021-06-03","https://xon.sh/","Developer Tools - Shells","Open Source","Python-powered shell.","21","Can do arithmetic, import modules, use data types, loops, etc, because everything it receives is interpreted with Python. Tab completion based on man-pages. Community extensions e.g. Powerline, written in Python. Cross-platform.","228","Small community of extensions. Not bash compatible, so you have to relearn some syntax. Incompatible with Python virtual environments (has its own replacement called vox).","171","","FALSE"],["Big Sky Software","htmx","2021-04-27","2021-05-27","https://htmx.org","Developer Tools - Frontend framework","Open Source","HTML attribute-based frontend framework.","40","Access AJAX, CSS Transitions, WebSockets and SSEs directly in HTML. Any HTML element can issue AJAX requests. Implements the principle of  “locality of behavior” so it’s easier to understand what code is doing. Small (10k min gz), no dependencies.","247","Injecting remote responses is a potential security issue: JS can still be executed even with a restrictive CSP, and user-generated content must be escaped. Execution must be denied within specific areas of the DOM. Violates separation of concerns principle.\n","258","","FALSE"],["Semgrep","Semgrep","2021-05-24","2021-05-27","https://semgrep.dev","Developer Tools - Testing frameworks","Open Source","Static analysis tool.","21","Open source, runs locally and/or in CI/CD. No DSL - write rules in the language you use and alongside the code they check. Plugins for as-you-code analysis in Vim, VS Code, IntelliJ. Lots of community rules for common languages and frameworks (Django, Flask, Java, Rails). Integrates with CI and can add comments to PRs. Cloud web UI is optional.","346","Experimental support for C, Rust, PHP, Lua, C#, Kotlin. No Windows support.","75","","FALSE"],["QuestDB","QuestDB","2021-05-13","2021-05-20","https://questdb.io","Database - Time series database","Open Source","Timeseries database with SQL.","29","InfluxDB-compatible ingestion. Postgres-compatible wire API (allows querying with Grafana). Handles out of order inserts in a configurable way even though it uses an append column-based storage model. Official Docker image and Helm chart for dev/prod deploys. ANSI SQL with additional time functions. No GC.","307","No built-in replication/clustering. Partitioning is only supported by timestamp (day, month, year) which means you tradeoff easier retention policies and faster calculations/seek times with the potential for hotspots if reads are mostly on recent data.","252","/interviews/questdb-vlad-ilyushchenko/","FALSE"],["atuin","atuin","2021-05-10","2021-05-20","https://github.com/ellie/atuin","Misc - Terminal utilities","Open Source","Shell history search/sync with SQLite.","38","Search shell history with CLI or interactive TUI (ctrl+r). Query by date, current directory, string terms. Encrypted sync across machines with log of exit code, session, command. Fun stats e.g. “most used command”. Option to run your own sync server.","250","Can’t delete entries from history. Default rebind on up-key takes some getting used to, or disable it in config. Only supports zsh and bash.","140","/interviews/atuin-ellie-huxtable/","FALSE"],["Deepnote","Deepnote","2021-05-08","2021-05-13","https://deepnote.com","Data Science - Collaboration","SaaS","Collaborative Jupyter notebooks.","32","Google Docs-style real-time sharing / editing. Detects dependencies, prompts for pip install and updates requirements.txt. Running the Jupyter environment in the cloud saves hassle installing kernels locally. Integrates with git. Public links. Supports Python & R.","264","Visualizations are custom HTML embeds when exported to Jupyter notebook format - better to embed something like Plotly in code to ensure portability.","149","/interviews/deepnote-jan-matas/","FALSE"],["Skruv","Skruv","2021-04-08","2021-05-13","https://skruv.io/","Developer Tools - Frontend framework","Open Source","No-build, small JS framework.","29","No dependencies. No build step. Very small (~400 LoC vDOM, ~100 LoC state management, ~230 LoC HTML helpers). Works with async components. Web tutorial does a good job explaining how it works (built using itself).","213","No router. Great for very simple SPAs, but something like Mithril.js (or Vue. Or Svelte) probably needed for anything of significance (if you don’t mind the build step).","169","","FALSE"],["Hookdeck","Hookdeck","2021-04-30","2021-05-06","https://hookdeck.com","DevOps - API Management","SaaS","Inbound webhook store and forward proxy.","40","Saves building your own queuing system - acts as a proxy to store and forward webhooks. Set up throttling and retry rules. Mirror inbound webhooks to multiple destinations, including a local CLI for testing. Alerts on failures - allows you to search & retry failures so you don’t lose any data.","294","Assumes your webhook destinations are idempotent with “at least once” delivery. No support for signature verification - will forward all requests (you can configure schema filters), so you need to implement this yourself. No support for custom webhook URL domains.","264","/interviews/hookdeck-alex-bouchard/","FALSE"],["act","act","2021-03-24","2021-05-06","https://github.com/nektos/act","Developer Tools - Local development","Open Source","Run your GitHub Actions locally.","32","Local simulation of the GitHub Actions environment using Docker. Much faster than commit/push for testing changes. Supports environment variables and secrets. Can trigger specific events e.g. pull request, push, and jobs within workflows (including skipping steps).","265","Only supports Linux runners (host is multi-platform). Full Docker images are quite large (>20GB), but you can try slimmer images with fewer bundled tools.","154","","FALSE"],["fselect","fselect","2021-04-21","2021-04-29","https://github.com/jhspetersson/fselect","Misc - Terminal utilities","Open Source","Find files with SQL-like queries.","33","Packages for all platforms (+ Nix, AUR, musl). Uses relaxed SQL to support fields e.g. size, path; operators e.g. AND, gte, like; date queries e.g. created, modified; filename glob and regex. Can use .gitignore and search MP3, MIME and other file attributes. Output in CSV, JSON, HTML.","285","Requires the absolute path (~/path doesn’t work), or searches current working directory if no path provided. Be careful to use quotes if you use shell characters such as >","171","","FALSE"],["Gruntwork","git-xargs","2021-04-27","2021-04-29","https://github.com/gruntwork-io/git-xargs","Developer Tools - Git tools","Open Source","Execute commands across multiple git repos.","43","Write a script to make a change to a single Git repo, then apply that change across multiple (specified in a list, or entire GitHub Org). Executes in parallel. Can open GitHub PRs with changes. Lots of use cases for otherwise tedious work e.g. name changes, updating dependencies, mass config changes.","301","Only supports GitHub PRs, but can push remote branches. Releases only available as binaries, no packages (you can use go get). Sometimes scripting these things actually takes longer than doing it manually.","205","","FALSE"],["KeyDB","KeyDB","2021-03-08","2021-04-22","https://keydb.dev/","Database - KV store","Open Source","A multi-threaded high-performance fork of Redis.","48","Drop-in replacement for Redis. Claims x5 speed boost from multi-threading. Adds some extra features like backup to S3 and active replication. Potentially reduces operational complexity by shifting scaling to CPU cores and network throughput rather than requiring clustering.","274","Runs the normal Redis event loop on multiple threads which requires locking (low contention, but work ongoing to improve). Expects exclusive use of assigned CPU cores.","167","/interviews/keydb-john-sully/","FALSE"],["Ranga Vadhineni","Thunder Client","2021-04-06","2021-04-22","https://www.thunderclient.io/","Developer Tools - Local development","Desktop","An HTTP client for VS Code.","27","Easily build HTTP requests with custom params, auth (basic, bearer, OAuth), headers and body (text, JSON, XML, form, GraphQL). Parses and syntax highlights response, headers and cookies. Can create automated tests with conditions such as response time, status codes, headers, etc.","280","All local - no config sync or dynamic loading from config files, but configs can be exported and imported.","106","","FALSE"],["Retool","REST API Generator","2021-04-09","2021-04-15","https://retool.com/api-generator/","DevOps - API Management","SaaS","Build an API to develop against.","32","Create a read/write REST API to start building against before your backend is ready. Supports all HTTP verbs. Lots of default field types with sample data e.g. location, emails, avatars, credit cards.","200","Limited to 150 rows. Hosted by a third party, so don’t send anything sensitive. Deleted after 30 days of inactivity.","116","","FALSE"],["Nelson Elhage","llama","2021-04-13","2021-04-15","https://github.com/nelhage/llama","Cloud - Serverless","Open Source","CLI for parallelizing commands inside AWS Lambda.","49","Makes it easy to burst parallelizable commands into Lambda. Uses Go template language for managing input and output. Supports Docker wrappers to bootstrap environments. Includes a drop-in GCC/clang replacement for outsourcing compilation.","238","Lambda is CPU and memory constrained, and the network is a bottleneck, so use cases are constrained to where parallelization makes a big difference (or there is a benefit to freeing local resources).","199","","FALSE"],["Typesense","Typesense","2021-03-24","2021-04-08","https://typesense.org","Developer Tools - Site Search","Open Source","Fast, typo-tolerant search engine.","34","Single binary (C++) runs natively on Linux and macOS. Tunable ranking for relevancy score tie-breaks. Sort at query-time without additional indexes. Scoped API keys. InstantSearch.js adapter. REST API with clients for JS, PHP, Python, Ruby. Open source + cloud option.","268","Need to build your own index updater mechanism to process new data. API-only means you need to build your own UI/admin. Only supports Latin-based languages.","156","/interviews/typesense-jason-bosco/","FALSE"],["Svix","Svix","2021-04-05","2021-04-08","https://www.svix.com/","DevOps - API Management","SaaS","Webhook infrastructure as a service.","36","Offering webhooks is actually more complex than you'd expect. Diahook deals with signing requests, queueing, retries, reliability, auth, E2E encryption, rate limiting, logs and debugging.","187","You need to send your events to Diahook, which means you still need to ensure they get there (retries, debugging, etc).","119","/interviews/svix-tom-hacohen/","FALSE"],["Temporal","Temporal","2021-03-16","2021-04-01","https://temporal.io/","Developer Tools - Workflow management","Open Source","Framework for workflow orchestration.","37","Deals with the underlying infrastructure for reliable task execution: state management, retries, scaling, fault tolerance. Avoid building and running your own timers / queues - just write the function business logic. Open source server you can run yourself, or use their cloud option (in private beta).","302","SDKs are still being built out (currently available for Go, Java, PHP, Ruby). You still need to run / scale your own database (Cassandra, MySQL, or PostgreSQL). ","161","/interviews/temporal-manu-srivastava/","FALSE"],["Mirage JS","Mirage JS","2021-03-29","2021-04-01","https://miragejs.com","Developer Tools - Testing frameworks","Open Source","API mocking library for frontend developers.","44","Intercepts all XMLHttpRequest and fetch requests so no code changes required (one additional import). Includes in-memory database for persistence tests. Can simulate slow responses or errors. Built-in ORM handles data relationships, output formatting, serialization.","266","Only supports REST APIs out of the box - GraphQL available as an optional plugin (still in development). Runs in the browser, not as a server, so it cannot be used to mock server-side APIs.","189","","FALSE"],["git-plan","git-plan","2021-03-30","2021-04-01","https://github.com/synek/git-plan","Developer Tools - Git tools","Open Source","Git workflow for planning / writing commits in advance.","55","Forces you to think about what you are going to work on in advance - writing out a plan probably helps improve your thinking, and also creates better commit messages. If you think of something you need to switch to, you can create a plan whilst it’s still top-of-mind, then come back to it later.","296","Unintuitive to begin with, but makes sense once you try it (see blog posts linked in the project readme for guidance). Interactive rebasing is an alternative that doesn’t force you to reverse your workflow.","206","","FALSE"],["WayScript","WayScript","2021-03-05","2021-03-25","https://wayscript.com","Cloud - PaaS","SaaS","Rapid API scripting platform.","29","Quickly create step function APIs from lots of pre-built integrations. Cron support. Connect to external data sources and manipulate data. Write real Python, JS, Java, shell script, GraphQL, HTML, and SQL (including using packaged dependencies) as separate steps. Configurable editor e.g. use vim keybindings, tabs vs spaces, etc.","330","Can be slow to execute (many seconds) especially with lots of steps. Have to use their browser editor - can’t develop and run code locally (this is on the roadmap).","164","/interviews/wayscript-jesse-orshan/","FALSE"],["Buddy","Buddy","2021-03-01","2021-03-25","https://buddy.works/","DevOps - CI/CD","SaaS","CI/CD.","6","Fast execution of steps due to caching. Can retry builds from specific steps and live-debug in a terminal which makes setting up pipelines easier. Can switch between UI or YAML config. Commenting/sharing helps team collaboration. UI has useful features, such as env var autocompletion.","285","Ecosystem of official build actions is small relative to GitHub Actions. UI is sometimes confusing due to the number of config options.","135","","FALSE"],["ORY","Kratos","2021-03-11","2021-03-18","https://www.ory.sh/kratos","Security - Authentication","Open Source","Cloud native user management.","29","Open source & self hosted: you probably don't want to build all your own user management (signup, login, MFA, FIDO2, etc) but do care about control and ownership. Runs as a compact, single Go binary. JSON Schema data model. Headless; example UI and API SDKs for Python, PHP, Node, Go, Java, Ruby. Scale horizontally.","316","Focus on APIs means there is no admin UI. Federation (OAuth2, OpenID) requires a separate project (ORY Hydra). \"Scale horizontally\" still means you need to scale your own RDBMS. Pre-1.0, targeting \"stable\" in 2022.","214","","FALSE"],["Chris Walz","bit","2021-03-01","2021-03-18","https://github.com/chriswalz/bit","Developer Tools - Git tools","Open Source","git CLI.","8","Autocomplete and flag suggestions. Commands such as release or sync combine several commands in one to speed up common tasks. Branch autocomplete for checkout. GitHub PR integration. Support for themes. Open source & cross platform.","232","Not what you might expect from a cli: you run the bit command, then it suggests subcommands and flags, rather than tab completion. Official OS packages missing on Linux.","169","/interviews/bit-chris-walz/","FALSE"],["Bird Eats Bug","Bird Eats Bug","2021-03-01","2021-03-11","https://birdeatsbug.com","Developer Tools - Testing frameworks","Desktop","Screensharing with technical metadata.","38","Captures screenshare and click journey with associated metadata like console and network logs. Local-first; uploadable for sharing (private or public). Quick submit to JIRA, Linear, Trello, GitHub","196","Chrome only (works on Microsoft Edge). More integrations needed.","64","","FALSE"],["Earthly","Earthly","2021-03-04","2021-03-11","https://earthly.dev","DevOps - Containers","Open Source","Containerized reproducible builds.","34","Runs existing build steps inside a container using your existing CI system (Jenkins, CircleCI, GitHub Actions, etc). This makes builds reproducible locally so they run the same on your laptop as in remote CI. Steps can be parallelized. Dependency caching locally and across repos.","280","Assumes you are building an already containerized application. Multi-platform builds are experimental.","102","/interviews/earthly-adam-gordon-bell/","FALSE"],["Microsoft","Playwright","2021-03-03","2021-03-04","https://playwright.dev","Developer Tools - Testing frameworks","Open Source","Automate Chromium, Firefox & Webkit with a single API.","54","Single API to launch and script Chromium, Firefox and WebKit. Emulate devices for testing responsiveness. Auto-wait API avoids hard coding timeouts. Extract screenshots, video and debug info. Library for JS, TypeScript, Python, C#, Java. Works on Windows, macOS, Linux.","269","Only supports latest browser versions - can’t pick older versions to test against. Browser binaries are quite large so may slow down CI/CD (cache is configurable).","163","","FALSE"],["Stoplight","Stoplight","2021-03-02","2021-03-04","https://stoplight.io","DevOps - API Management","SaaS","API design and development platform.","36","Build OpenAPI (v2 Swagger or v3) compliant APIs with auto-generated docs, example code, and mocking. Write docs in Markdown. Save everything (and load existing APIs) from Git. Offline/local dev support with desktop API studio app.","230","Limited ability to customize doc output to fit into your own design/brand. Some editor/docs UI bugs in Firefox. It does work without using OpenAPI specs, but most features assume you do.","186","","FALSE"],["Raycast","Raycast","2021-02-22","2021-02-25","https://raycast.com","Misc - OS","Desktop","Quick-launcher for developers.","30","Search cloud and local documents. Clipboard history. Manage GitHub PRs, JIRA issues, join Zoom calls, schedule calendar blocks. API and scripting to create your own commands. Tiling window management. Connects directly to remote services to avoid privacy issues.","262","macOS only. Shortcuts for sub-commands are difficult to find. File search requires scoping rather than searching everywhere.","124","/interviews/raycast-petr-nikolaev/","FALSE"],["DBCLI","DBCLI","2021-02-22","2021-02-25","https://www.dbcli.com","Database - Management","Desktop","CLIs for databases.","19","Autocomplete and syntax highlighted output. Support for Postgres, MySQL, SQLite, MSSQL, Redis, AWS Athena. History, search, vi/Emacs keybindings, saved queries. Open source & cross-platform.","190","Only available via pip or brew - official OS packages would make installation easier to integrate with native package management. Installation on Windows is a hassle due to needing Python. Large results don't line-wrap well.","224","","FALSE"],["Accurics","Terrascan","2021-02-16","2021-02-18","https://github.com/accurics/terrascan","Developer Tools - Testing frameworks","Open Source","Static code analyzer for Infrastructure as Code.","48","Scans Terraform, k8s, and Helm configs for security and compliance. Supports AWS, Azure, GCP, Kubernetes, GitHub and has lots of sensible policy defaults which can be extended using the Open Policy Agent Rego language. Can be run in CI/CD.","239","Docs need work: quickstart didn't work smoothly and default policies are not well explained. Explanations of how to rectify policy violations would help.","153","","FALSE"],["GitPod","GitPod","2021-02-09","2021-02-11","https://www.gitpod.io","Developer Tools - IDE","SaaS","Dev environments as code and hosted in the cloud.","49",".gitpod.yml file in the repo describes the full dev environment so it's version controlled and always up to date. GitPod pre-builds after every commit so the environment is ready when you activate it. VS Code in the browser means you can develop anywhere on any machine. Easily switch workspaces e.g. to review a pull request without disrupting your current environment. Self-hosted version so you can run it all yourself (some features limited to paid license).","462","Limited IDE support - VS Code or Theia (based on VS Code) means you have to code in the browser so you can't use your own IDE/editor (support for other IDEs in development). Requires you to be online with good connectivity because everything is remote.","252","/interviews/gitpod-christian-weichel/","FALSE"],["asdf","asdf","2021-02-04","2021-02-11","https://asdf-vm.com/","Developer Tools - Dependency management","Open Source","A CLI to manage language runtimes.","34","Makes it easy to switch language runtime versions without messing up the system install (if any). Lots of plugins so it supports pretty much every language. Configs can be defined in a per-project file so it can auto switch based on current working directory. Means you can forget about language specific virtual environments because asdf manages them for you. Has an official GitHub Action.","391","Language support is via community plugins so quality is variable. Windows support still in development.","103","","FALSE"],["StackHawk","StackHawk","2021-02-05","2021-02-11","https://www.stackhawk.com/","Security - Vulnerability management","SaaS","Black box security scanning for developers.","43","An easy way for developers to run a standardized suite of black box tests. Spiders and auto-discovers endpoints so there is almost zero config. Runs inside a container so it can be run anywhere. Web UI highlights and prioritizes all detected vulnerabilities. Can easily be run locally against any local or remote endpoint. Built on top of open source OWASP ZAP. Good quality documentation. Integrations into CI/CD e.g. GitHub Actions, GitLab, CircleCI.","452","Assumes you know about OWASP and how to resolve highlighted issues. The nature of black box testing means some OWASP issues are false positives and are not comprehensive e.g. no detection of dependency vulnerabilities. Large example app takes >25min to scan (although our own simple app took <1 min).","300","/interviews/stackhawk-scott-gerlach/","FALSE"],["Opstrace","Opstrace","2021-02-02","2021-02-04","https://opstrace.com","DevOps - Observability","Open Source","A management layer on top of independent open source observability tools.","73","Automates deployment of Prometheus, Cortex, and Loki and configures them to store data in your own S3 or GCS buckets. This means you keep control of the data and the price of storage from your existing cloud provider.  Supports multiple tenants e.g. prod vs dev, and deals with scaling them. Existing Prometheus instances can be configured to send data to Opstrace.","365","Installation and cluster management are the main differentiator - otherwise it's just packaging open source projects. API uses an Opstrace managed endpoint - custom domains supported only in the commercial version which is hidden behind \"contact us\". If you already have Prometheus, you could just set up Cortex yourself. Only supports AWS and GCP. No Windows support.","368","","FALSE"],["Nushell","Nushell","2021-02-02","2021-02-04","https://www.nushell.sh","Developer Tools - Shells","Open Source","A shell where everything is data.","33","The first thing you notice is running `ls` outputs a structured table. All output is actually data, so it is like interacting with a spreadsheet. Nushell applies the Unix philosophy of piping commands but allows for commands like `ls | where size > 1kb`. Supports parsing data like CSV and JSON. You can script your own commands. Cross platform.","345","Although it can be run as a command, it is designed to replace your existing shell. It is still in development so may not be stable. You will have to reconfigure everything if you have heavily customized your shell.","215","","FALSE"]],"formatted":[{"Company/Org":"CloudGraph","Tool/Product/Project":"CloudGraph","Reviewed":"2021-11-10","Scheduled for":"2021-11-11","URL":"https://github.com/cloudgraphdev/cli","Category":"API - API","Type":"Open Source","What is it?":"GraphQL API for your cloud resources.","Len":"106","What we like":"Use GraphQL to query resources. Queries run against a cached database which you can scale yourself, avoiding AWS limits. Consistent interface across products - avoid complex JOINs. Query historical state because data is versioned. Bundled UI with autocompletion and schema explorer.","What we dislike":"Currently only supports AWS. Deployment is currently manual (or via Docker). Docs are still quite limited.","Interview":"/interviews/cloudgraph-tyson-kunovsky/","Sponsored":"TRUE"},{"Company/Org":"sysz","Tool/Product/Project":"sysz","Reviewed":"2021-11-10","Scheduled for":"2021-11-11","URL":"https://github.com/joehillen/sysz","Category":"Misc - Terminal utilities","Type":"Open Source","What is it?":"Search TUI for systemctl.","Len":"127","What we like":"Quickly search and filter system and user units. State view shows service metadata plus recent logs. Shortcuts for filtering by state and reloading. Prompts to run relevant commands.","What we dislike":"Requires fzf, which must be installed manually. Assumes you know what you’re doing, but since it’s Linux-only, you probably do.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Edamagit","Tool/Product/Project":"Edamagit","Reviewed":"2021-11-10","Scheduled for":"2021-11-11","URL":"https://github.com/kahole/edamagit","Category":"Developer Tools - Git tools","Type":"Open Source","What is it?":"Magit (better Git) for VSCode.","Len":"137","What we like":"Significantly speed up common git tasks with shortcuts. Improved version control view with show/hide diff, easily stage individual files or multi-select changes. Stage chunks of changes. Forge mode provides extra context from GitHub e.g. issues, PRs.","What we dislike":"Forge mode slows down status view initial load. Doesn’t yet support the more advanced features from Magit (advanced diff, bisect, patch).","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Plow","Tool/Product/Project":"Plow","Reviewed":"2021-11-03","Scheduled for":"2021-11-04","URL":"https://github.com/six-ddc/plow","Category":"Developer Tools - Benchmarking / Load testing","Type":"Open Source","What is it?":"High-performance HTTP benchmarking.","Len":"71","What we like":"Displays real-time stats as tests are executed, both on the CLI and via a web UI. Reports latency, req/s, errors, read/writes. Includes latency histogram and percentiles. Supports all HTTP verbs including reading in POST data from a file. Dockerfile provided.","What we dislike":"Histogram charts disappear and web UI stops serving on test completion.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"SQLime","Tool/Product/Project":"SQLime","Reviewed":"2021-11-03","Scheduled for":"2021-11-04","URL":"https://sqlime.org/","Category":"Database - Relational database","Type":"Open Source","What is it?":"SQLite browser playground.","Len":"69","What we like":"Runs a full version of SQLite entirely in the browser. Can load DB files from a URL or a file. Can optionally sync with GitHub to save data and queries in plain text. Easy to share via a link. There is no server. Open source.","What we dislike":"No code completion. No error handling UI (check the browser console).","Interview":"","Sponsored":"FALSE"},{"Company/Org":"werf","Tool/Product/Project":"werf","Reviewed":"2021-11-03","Scheduled for":"2021-11-04","URL":"https://werf.io/","Category":"DevOps - CI/CD","Type":"Open Source","What is it?":"Git CLI for consistent delivery & deployment.","Len":"134","What we like":"Implements automated delivery from Git to k8s. “giterminism” concept provides reproducibility without external config dependencies - everything is based on the git repo. Handles Docker image builds, k8s rollout and cleanup. Can be embedded in existing CI/CD pipelines. Generates and manages Helm templates.","What we dislike":"Needs expanded guides for languages - basics are covered but missing more detailed real-world examples. Assumes you’re running on k8s.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"FireHydrant","Tool/Product/Project":"FireHydrant","Reviewed":"2021-10-27","Scheduled for":"2021-10-28","URL":"https://firehydrant.io/","Category":"DevOps - Infrastructure automation","Type":"SaaS","What is it?":"Incident response automation.","Len":"109","What we like":"Automate tedious incident handling workflows e.g. create new Slack room, status page update, create Zoom bridge. Inventory catalog assigns teams and aggregates useful tools (e.g. PagerDuty on call, Datadog dashboard, last GitHub event) for quick lookup during incidents. Auto-generate timelines based on chat logs, events, actions to make retrospectives easier.","What we dislike":"Small number of integrations e.g. assumes using Slack for chat, JIRA for tickets, Zoom/Meet for conferencing.","Interview":"/interviews/firehydrant-robert-ross/","Sponsored":"TRUE"},{"Company/Org":"OpenReplay","Tool/Product/Project":"OpenReplay","Reviewed":"2021-10-27","Scheduled for":"2021-10-28","URL":"https://openreplay.com/","Category":"DevOps - Error logging","Type":"Open Source","What is it?":"Open source session replay debugging.","Len":"212","What we like":"Record and debug user sessions with full devtool capture (JS errors, network, perf, state). Sanitize data before it is captured through generic global rules or HTML attributes. Can un-minify JS with source maps. Plugins to capture API requests e.g. GraphQL and correlate with backend monitoring (Datadog, New Relic, Cloudwatch, etc).","What we dislike":"Limited documentation for scalability and reliability - you must manage multiple components e.g. Redis, PostgreSQL (a fully managed cloud version is available). Data exporter only available in enterprise version.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"git-bug","Tool/Product/Project":"git-bug","Reviewed":"2021-10-27","Scheduled for":"2021-10-28","URL":"https://github.com/MichaelMure/git-bug","Category":"Developer Tools - Git tools","Type":"Open Source","What is it?":"Bug tracker embedded in your git repo.","Len":"127","What we like":"Work from a CLI, interactive TUI or web UI. Doesn’t pollute your repo (everything lives in .git) and interactions are like normal Git (add, push, pull, etc). Issues can live alongside the code repo they belong to. Can bridge with GitHub, GitLab and JIRA so you can use git-bug and others can stick with a centralized server.","What we dislike":"Web UI is currently read-only. Does not support media file attachments. Not a stable release yet, but still worth playing with.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"immudb","Tool/Product/Project":"immudb","Reviewed":"2021-10-20","Scheduled for":"2021-10-21","URL":"https://github.com/codenotary/immudb","Category":"Database - Relational database","Type":"Open Source","What is it?":"Open source immutable database.","Len":"100","What we like":"Can be used as a database server or as a library. Acts as a k/v store or can be queried using SQL. Storage agnostic - can even be S3. Built-in Prometheus endpoint. Can disable synchronous indexing to increase performance. Supports PostgreSQL wire protocol. Interesting use case as a secondary database for cryptographic verification of the primary.","What we dislike":"Only Go SDK is fully developed - others still in progress. No replication or hot backup support yet.","Interview":"/interviews/immudb-jeronimo-irazabal/","Sponsored":"TRUE"},{"Company/Org":"gron","Tool/Product/Project":"gron","Reviewed":"2021-10-20","Scheduled for":"2021-10-21","URL":"https://github.com/tomnomnom/gron","Category":"Misc - Terminal utilities","Type":"Open Source","What is it?":"Makes JSON greppable.\n","Len":"159","What we like":"Supports input from a file, URL or stdin so it can be piped to grep and properly searched. Allows the full path to be revealed. Colorizes output. Easily diff sets of JSON. ungron reverses the conversion, so you can pipe grep results back to JSON. Cross-platform binaries available for Windows, Linux and Mac.","What we dislike":"You could just use jq which has more features, but it assumes you know more about your JSON data structure. gron is deliberately simple and grep is well known.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"git-branchless","Tool/Product/Project":"git-branchless","Reviewed":"2021-10-20","Scheduled for":"2021-10-21","URL":"https://github.com/arxanas/git-branchless","Category":"Developer Tools - Git tools","Type":"Open Source","What is it?":"Git tools for repo visualization and navigation.","Len":"113","What we like":"Allows you to move between stacks of commits without using branches. `git move` is implemented in-memory so is faster than `git rebase`, which works on-disk. Interactive `git undo` command helps fix commits, merges, rebases, checkouts and branches. Smartlog command visualizes work without branches (unlike `git log --graph`).","What we dislike":"No release binaries - must be installed (and compiled) with Rust’s cargo. Not designed to handle untracked files.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"LambdaTest","Tool/Product/Project":"LambdaTest","Reviewed":"2021-10-13","Scheduled for":"2021-10-14","URL":"https://www.lambdatest.com/","Category":"Developer Tools - Browser testing","Type":"SaaS","What is it?":"Cross browser testing platform.","Len":"112","What we like":"Lots of desktop and mobile browser versions, including very old devices and new betas. Can write tests in open source Selenium or Cypress frameworks. Tests can be automatically compared against previous runs. Integrates into CI/CD to detect regressions. Geotarget features can test localization e.g. currencies, time zone changes etc.","What we dislike":"Mobile tests are executed on emulators (real device support currently in beta). No support for testing on Linux.","Interview":"/interviews/lambdatest-mayank-bhola/","Sponsored":"TRUE"},{"Company/Org":"Delta","Tool/Product/Project":"Delta","Reviewed":"2021-10-13","Scheduled for":"2021-10-14","URL":"https://github.com/dandavison/delta","Category":"Developer Tools - Git tools","Type":"Open Source","What is it?":"CLI for (git) code diffs.","Len":"96","What we like":"Displays line numbers. Side by side view. Can be used independently from the terminal, but configured through git means it supports all git features outputting code. Highly configurable theming and output options e.g. colors, line number styles. Cross platform and OS packages for multiple systems.","What we dislike":"Colorized output does not follow the current terminal theme - must be independently configured. ","Interview":"","Sponsored":"FALSE"},{"Company/Org":"exo","Tool/Product/Project":"exo","Reviewed":"2021-10-06","Scheduled for":"2021-10-07","URL":"https://exo.deref.io/","Category":"Developer Tools - Local development","Type":"Open Source","What is it?":"Process and log manager for dev.","Len":"167","What we like":"Runs the commands from your Procfile or Docker Compose config e.g. running separate commands to launch your project’s UI and API. Aggregates logs into a single, colorized terminal output. Local web GUI allows log toggle, search & filtering, manage spawned processes and other resources e.g. Docker storage. CLI can control processes, query logs and daemonize.","What we dislike":"Weird, custom open source license. Web docs could do with expanding - CLI has a useful builtin help command though. No OS packages - binaries for Linux and macOS only.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Unleash","Tool/Product/Project":"Unleash","Reviewed":"2021-10-06","Scheduled for":"2021-10-07","URL":"https://www.getunleash.io/","Category":"Developer Tools - Testing frameworks","Type":"Open Source","What is it?":"Open source feature flags.","Len":"125","What we like":"Local evaluation of feature toggles avoids network latency. SDKs for all major languages. Proxy module means it can work even for single page apps. Support for gradual rollout and user segmentation strategies e.g. by user profile fields. Tech debt dashboard tracks use of feature flags and warns if they are unused.","What we dislike":"Unclear how to deploy in a high availability configuration. Limited usage stats (evaluations over the last minute and hour).\n","Interview":"","Sponsored":"FALSE"},{"Company/Org":"CodeSee","Tool/Product/Project":"CodeSee Maps","Reviewed":"2021-09-29","Scheduled for":"2021-09-30","URL":"https://www.codesee.io/","Category":"Developer Tools - Documentation","Type":"SaaS","What is it?":"Code maps as documentation.","Len":"102","What we like":"Highlights dependencies and related code structure. Code maps auto-update with each commit - map diffs posted into GitHub PRs. Can build step-by-step tours for onboarding new devs into the codebase. Auto heat maps by latest activity, creation date or commit count.","What we dislike":"Requires GitHub. Currently only supports dependency resolution for 4 languages (Python, JS, Java, Go).","Interview":"/interviews/codesee-shanea-leven/","Sponsored":"TRUE"},{"Company/Org":"procs","Tool/Product/Project":"procs","Reviewed":"2021-09-29","Scheduled for":"2021-09-30","URL":"https://github.com/dalance/procs","Category":"Misc - Terminal utilities","Type":"Open Source","What is it?":"Process status viewer; replacement for ps.","Len":"116","What we like":"Uses terminal theme colors. Layout makes it easy to read. Tree option shows parent and child processes. Can look into Docker to reveal container name & commands. Watch mode like top. Columns can be configured at run time or in a config file. Can show ports processes are listening on. Cross-platform support.","What we dislike":"macOS and Windows support is experimental (worked fine in our tests). No pager on Windows. Search is case sensitive.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"zoxide","Tool/Product/Project":"zoxide","Reviewed":"2021-09-21","Scheduled for":"2021-09-23","URL":"https://github.com/ajeetdsouza/zoxide","Category":"Misc - Terminal utilities","Type":"Open Source","What is it?":"Smarter cd for your terminal.","Len":"154","What we like":"Ranking algorithm means it usually guesses which path you mean so you can navigate common long paths without typing them all out. Multi-platform options for installing. Includes an fzf-powered interactive mode. Integrations available for Emacs, Ranger, Neovim. Zsh autocomplete available.","What we dislike":"Years of muscle memory using cd means you probably want to alias it to zoxide. Renamed paths can confuse the history - need to edit the DB to update them.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"HTTP Toolkit","Tool/Product/Project":"HTTP Toolkit","Reviewed":"2021-09-21","Scheduled for":"2021-09-23","URL":"https://httptoolkit.tech/","Category":"Developer Tools - Browser testing","Type":"Desktop","What is it?":"Intercept, mock, rewrite HTTP requests.","Len":"155","What we like":"Auto connects to Brave, Firefox, Chrome, terminal, Android, Edge or acts as a generic proxy. Inspect all HTTP requests. Create rules (match on regex, URL, host, JSON, headers), intercept and rewrite - pause requests to manually edit them, time out, transform, forward to different hosts or return fixed responses. Open source.","What we dislike":"No support for Safari, iOS or Docker (on the roadmap). No free trial for pro features like import/export HAR, more advanced rules, mock API templates, etc.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Slim.AI","Tool/Product/Project":"Slim.AI","Reviewed":"2021-09-15","Scheduled for":"2021-09-16","URL":"https://www.slim.ai/","Category":"DevOps - Containers","Type":"SaaS","What is it?":"Container analysis and comparison.","Len":"148","What we like":"Quickly examine or search the full contents of any container - files, layers, Dockerfile. Visual diff of file system, image metadata, and Dockerfile between container versions makes it easy to see what has changed. Examine popular public images and connect private registries (Docker Hub, GCR, AWS ECR).","What we dislike":"Does not yet support GitHub Container Registry. Would like to see saved searches or suggested alerts to monitor for common issues with new versions.","Interview":"/interviews/slimai-john-amaral/","Sponsored":"TRUE"},{"Company/Org":"Oso","Tool/Product/Project":"Oso","Reviewed":"2021-09-15","Scheduled for":"2021-09-16","URL":"https://www.osohq.com","Category":"Security - Authentication","Type":"Open Source","What is it?":"Declarative application authorization framework.","Len":"172","What we like":"Methods for enforcement at request and field level. Relations allow hierarchical access control. Data filtering converts policy expressions into DB query plans to efficiently retrieve only the data that matches the filter. Generic policy language is evaluated locally by language-SDKs (NodeJS, Java, Python, Ruby, Go, Rust).","What we dislike":"Provides the hooks for framework / ORE integrations but you still need to build them. Currently focused on backend auth - anything frontend you need to figure out yourself.","Interview":"/interviews/oso-sam-scott/","Sponsored":"TRUE"},{"Company/Org":"Cue","Tool/Product/Project":"Cue","Reviewed":"2021-09-08","Scheduled for":"2021-09-09","URL":"https://cuelang.org/","Category":"Developer Tools - Testing frameworks","Type":"Open Source","What is it?":"Data validation language.","Len":"130","What we like":"Helps validate files, APIs and configs e.g. k8s files. Definitions start broad e.g. types then narrow down e.g. values, so it is easy to get started, but still supports specific validations. Language is a JSON superset. Supports comments (unlike JSON!). Can extract existing definitions from Go and Protobufs.","What we dislike":"Documentation explains the concepts well but is missing a “from zero” getting started tutorial (the k8s tutorial is good, though).","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Leapp","Tool/Product/Project":"Leapp","Reviewed":"2021-09-08","Scheduled for":"2021-09-09","URL":"https://www.leapp.cloud/","Category":"Security - Authentication","Type":"Desktop","What is it?":"Manage cloud access credentials.","Len":"142","What we like":"Stores access credentials in native OS storage e.g. Windows Credential Vault, macOS Keychain. Easy to switch between credentials e.g. AWS IAM, Azure User. Session credentials are temporary, minimizing risk of leaks and making them easy to rotate. Open source.","What we dislike":"Only supports AWS and Azure. No U2F support. Supports some federated identity providers e.g. Okta, GSuite, AWS SSO, but only to AWS and Azure.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Tyk","Tool/Product/Project":"Tyk","Reviewed":"2021-09-01","Scheduled for":"2021-09-02","URL":"https://tyk.io/","Category":"DevOps - API Management","Type":"Open Source","What is it?":"API gateway.","Len":"225","What we like":"Supports all API protocols (REST, GraphQL, TCP, gRPC). Handles API versioning and deprecation. Hot-reload without dropping requests. Minimal dependencies (Redis for distributed rate limits and tokens). Drop-in products for developer portal + docs, analytics, social auth, management dashboard. Open source or cloud options.","What we dislike":"Architecture gets complex once you start to add the extra components, which are also not open source. Historical performance issues in older versions due to overhead of some features enabled by default (reportedly now fixed).","Interview":"","Sponsored":"FALSE"},{"Company/Org":"DeepSource","Tool/Product/Project":"DeepSource","Reviewed":"2021-09-01","Scheduled for":"2021-09-02","URL":"https://deepsource.io/","Category":"Developer Tools - Source control","Type":"SaaS","What is it?":"Automated code reviews.","Len":"198","What we like":"Catches common issues which can either be fixed as part of a PR and/or blocked by CI. Can open “Autofix” PRs for code issues as well as linting errors. Examines docs and code coverage and reports metrics for both. Image badges for readme files. Can configure analysis via a config file in the repo or via the UI. Self-hosted version available.","What we dislike":"Doesn’t explain “why?” you should make the suggested changes or follow its rules - good to fix errors but better to understand how to avoid them in the future. Autofix can’t solve everything (yet?).","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Fission","Tool/Product/Project":"Fission","Reviewed":"2021-08-25","Scheduled for":"2021-08-26","URL":"https://fission.codes/","Category":"Developer Tools - Backend framework","Type":"Open Source","What is it?":"Decentralized app backend for storage and identity.","Len":"243","What we like":"Abstracts auth and storage so you can use P2P decentralized tech like IPFS without worrying about the underlying protocol. Web Native File System works across platforms and has a POSIX-style interface. Supports storage/execution of WebAssembly modules which are then available on every platform. Open source.","What we dislike":"Auth tokens live in browser storage so you could lose access if you clear the data. Risky to rely on such an early new backend tech that is not yet standardized and built by a new startup (everything is open source so you can run it yourself).","Interview":"/interviews/fission-brooklyn-zelenka/","Sponsored":"FALSE"},{"Company/Org":"AskGit","Tool/Product/Project":"AskGit","Reviewed":"2021-08-25","Scheduled for":"2021-08-26","URL":"https://github.com/askgitdev/askgit","Category":"Developer Tools - Git tools","Type":"Open Source","What is it?":"Query git repos with SQL.","Len":"103","What we like":"Web demo allows you to query any public repo (+ GitHub issues), or download the CLI. Can do complex queries like commits by email domain, most frequently changed files, filter by branch. Supports querying GitHub API e.g. query stars, repo language stats, issues/PRs. Outputs as an ASCII table, JSON, CSV or SQLite file for other tools to query the results.","What we dislike":"Queries can be slow - several seconds. Read-only queries. Only integrated with GitHub Issues (for now).","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Sourcegraph","Tool/Product/Project":"Sourcegraph","Reviewed":"2021-08-18","Scheduled for":"2021-08-19","URL":"https://sourcegraph.com/search","Category":"Developer Tools - Code collaboration","Type":"Other","What is it?":"Code search engine.","Len":"68","What we like":"Code structure search on syntax e.g. function arguments, multi-line blocks, JSON structures. Can scope to repos (public / private), commit diffs/dates, languages. Option for self-hosted indexer for private code. Browser & IDE extensions for quick search and overlay on top of existing tools e.g. GitHub/GitLab PRs. CLI or web UI (with dark mode).","What we dislike":"No custom theme support for the web UI. Can’t search issue trackers.","Interview":"/interviews/sourcegraph-beyang-liu/","Sponsored":"TRUE"},{"Company/Org":"Hoppscotch","Tool/Product/Project":"Hoppscotch","Reviewed":"2021-08-18","Scheduled for":"2021-08-19","URL":"https://hoppscotch.io/","Category":"Developer Tools - Code collaboration","Type":"Open Source","What is it?":"Test UI for API requests.","Len":"140","What we like":"Build & execute HTTP, GraphQL & WebSocket requests. Syntax highlighted response parsing. Generate code to execute requests via curl, Go, Python, and other languages. Save config to local storage or GitHub Gist. Also available as a Chrome or Firefox extension. CLI in beta. Open source.","What we dislike":"Can’t automate a chain of requests - have to manually set up each request. Can’t support cookie headers due to browser security limitations.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Appsmith","Tool/Product/Project":"Appsmith","Reviewed":"2021-08-11","Scheduled for":"2021-08-12","URL":"https://www.appsmith.com/","Category":"Developer Tools - UI Builder","Type":"Open Source","What is it?":"Open source internal tool builder.","Len":"221","What we like":"Quickly build interfaces to existing databases. Proxies queries to the data source so results are not stored. Easy form construction with validation and data binding. Can use JS to write data transformations (both read and write). If the GUI concepts are too restrictive, you can always fall back to JS to customize widgets. Open source so you can host it all inside your own network.","What we dislike":"No user collaboration in the UI editor so others editing the same project can overwrite each other. Your UI config is stored inside Appsmith’s database (MongoDB) so you can’t use version control (can be exported to JSON).","Interview":"/interviews/appsmith-arpit-mohan/","Sponsored":"FALSE"},{"Company/Org":"Retool","Tool/Product/Project":"Retool","Reviewed":"2021-08-11","Scheduled for":"2021-08-12","URL":"https://retool.com/","Category":"Developer Tools - UI Builder","Type":"SaaS","What is it?":"Internal tool builder.","Len":"149","What we like":"Supports staging / non-staging environments. Datasources can be databases like MySQL and Postgres or APIs like Stripe, S3 or GraphQL. Can query all sources with SQL even if they aren’t databases. Everything is a JS object you can manipulate. You can build your own custom React components. Can configure your own Redis/Memcached cache.","What we dislike":"Not open source, but there is a self-hosted option. Ability to sync to Git is enterprise-only. Doesn’t support complex logic e.g. multiple API calls.","Interview":"/interviews/retool-snir-kodesh/","Sponsored":"FALSE"},{"Company/Org":"Snyk","Tool/Product/Project":"Snyk Open Source","Reviewed":"2021-08-05","Scheduled for":"2021-08-05","URL":"https://snyk.io/product/open-source-security-management/?utm_medium=Organic-Email&utm_source=consoledev&utm_content=snyk-open-source","Category":"Security - Vulnerability management","Type":"SaaS","What is it?":"Dependency security monitoring for open source.","Len":"155","What we like":"Easy to see security status for everything. Scans full dependency tree revealing your actual security posture e.g. vulns in dependency dependencies. Relative severity scoring helps understand how relevant issues are. Inspects containers & OS packages as well as code. Separates dev dependencies from prod. Multiple options for fixes e.g. via CLI, not just PRs.","What we dislike":"Showing vulnerabilities in dependency dependencies is interesting, but what are you going to do about them? CLI to apply fixes still in beta (Python only).","Interview":"/interviews/snyk-guy-podjarny/","Sponsored":"FALSE"},{"Company/Org":"OSSF","Tool/Product/Project":"Security Scorecard","Reviewed":"2021-08-05","Scheduled for":"2021-08-05","URL":"https://github.com/ossf/scorecard","Category":"Security - Vulnerability management","Type":"Open Source","What is it?":"Security health metrics for open source.","Len":"188","What we like":"Assessment criteria are objective, consistent and documented so OSS projects can start to adopt them. Makes it easy to assess the security posture of the projects you rely on. CLI output is clear why a check fails. Can scan a GitHub repo or infer it from npm, pypi or rubygem package names. JSON or CSV output means results can be scripted.","What we dislike":"Some assessment criteria (such as looking for commits from >1 GitHub organizations) may be onerous for small, one-person projects. No easy way to integrate into CI/CD yet (on the roadmap).","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Liveblocks","Tool/Product/Project":"Liveblocks","Reviewed":"2021-07-16","Scheduled for":"2021-07-29","URL":"https://liveblocks.io/","Category":"Developer Tools - Frontend framework","Type":"SaaS","What is it?":"Real-time collaboration API.","Len":"193","What we like":"Components to easily add live presence (live cursors, chat and reactions). Abstracts away the backend implementation challenges - networking, performance, presence detection, multi-browser support. Vendored as React / Node packages. Auth hooks to validate user permissions. Examples for raw JS, Next.js, Nuxt.js and React + Firebase.","What we dislike":"Assumes you’re building with web technologies i.e. JS. No mobile support. Still requires implementing authentication. Classic build vs buy - is it a good use of your time to try and build this?","Interview":"/interviews/liveblocks-guillaume-salles/","Sponsored":"TRUE"},{"Company/Org":"Livekit","Tool/Product/Project":"Livekit","Reviewed":"2021-07-19","Scheduled for":"2021-07-29","URL":"https://livekit.io/","Category":"API - Communication","Type":"Open Source","What is it?":"Open source live video and audio API.","Len":"217","What we like":"SDKs for React, JS, iOS and Android to build video / audio without needing to understand WebRTC. Selective Forwarding Unit server makes it easy to scale from P2P to supporting large numbers of participants. Server scales horizontally using Redis as the backend. Automatically supports different connection types (UDP, TCP, TURN) and simulcasting.","What we dislike":"Still need to set up SSL + load balancers. Using a server component defeats the idea of P2P. Your code still needs to deal with issuing access tokens to each participant. Simulcasting only works in the browser/JS SDK.","Interview":"/interviews/livekit-david-zhao/","Sponsored":"FALSE"},{"Company/Org":"Polypane","Tool/Product/Project":"Polypane","Reviewed":"2021-06-18","Scheduled for":"2021-07-22","URL":"https://polypane.app/","Category":"Developer Tools - Browser testing","Type":"Desktop","What is it?":"Browser testing tool.","Len":"124","What we like":"Multiple browser panes side-by-side to test various sizes. Inspect element works across panes simultaneously. Scroll sync helps comparison. Built on Chrome so devtools available. Shows Web Vitals scores. Can trigger media features e.g. prefers-color-scheme, reduced-motion. Debug tools like a11y, CSS injection, disable images, mobile reachability.","What we dislike":"Signup/license key process is a bit fiddly. Quite CPU intensive. You need a very big screen to see all the windows properly.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"automerge","Tool/Product/Project":"automerge","Reviewed":"2021-06-12","Scheduled for":"2021-07-22","URL":"https://github.com/automerge/automerge","Category":"Developer Tools - Backend framework","Type":"Open Source","What is it?":"Conflict-free JSON-like data structure.","Len":"244","What we like":"Built for JS applications to allow read/write to properties whilst avoiding conflicts. Maintains a history of all changes. Network-agnostic but includes a sync protocol for send/receive messages. Custom types for conflict free counters, collaborative text editing and tables. Follows the idea of functional reactive programming.","What we dislike":"Documents are not actually immutable by default - you just code as if they are. Enforcing this can be turned on but has a major performance hit. Implementation is only in JS but versions in Rust, Swift, Python in various stages of development.\n","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Tuple","Tool/Product/Project":"Tuple","Reviewed":"2021-06-22","Scheduled for":"2021-07-15","URL":"https://tuple.app","Category":"Developer Tools - Code collaboration","Type":"Desktop","What is it?":"Screen sharing optimized for developers.","Len":"179","What we like":"Quick start a P2P encrypted call + screen sharing session. Quality settings go up to 5k to make code crisp and easy to read, unlike generic conferencing services. Easy to take control to type, send through keyboard shortcuts, highlight areas of the screen. Live call debug info to see any connection problems. The “ship it” stamp effect is fun.","What we dislike":"Really needs a high quality connection otherwise you can’t reach the higher resolutions and the mouse/keyboard sharing is laggy. macOS only - Linux client on the roadmap for 2021.","Interview":"/interviews/tuple-ben-orenstein/","Sponsored":"FALSE"},{"Company/Org":"GitHub","Tool/Product/Project":"GitHub Copilot","Reviewed":"2021-07-08","Scheduled for":"2021-07-15","URL":"https://copilot.github.com/","Category":"Developer Tools - IDE","Type":"SaaS","What is it?":"AI pair programming for VS Code.","Len":"203","What we like":"Autocomplete is accurate - speeds up work on a line-by-line basis, just like GMail/Google Docs. Understands file context - imports, variable names, etc. Using comments to describe what you want to do then reviewing suggestions is like doing a web search. Time saver for simple, common, but annoying tasks e.g. regexes, test skeletons.","What we dislike":"Not clear if it’s thinking or not - sometimes you wait for nothing to happen. Licensing questions remain unanswered - is the code a derivative of copyrighted material? Doesn’t understand project context.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Hashicorp","Tool/Product/Project":"Waypoint","Reviewed":"2021-06-16","Scheduled for":"2021-07-08","URL":"https://www.waypointproject.io/","Category":"DevOps - CI/CD","Type":"Open Source","What is it?":"Build, deploy, and release across platforms.","Len":"251","What we like":"Single command to get your code into production. Can track Git repos to auto-deploy. Integrates with AWS, Azure, Google to upload artifacts, configure LBs, DNS, env vars, etc. Stream logs and execute remote commands. Preview URLs for staging. Web dashboard summarizes deploy status. Extensible hooks via plugins.","What we dislike":"Assumes your app is containerized. Need to run / maintain your own Waypoint server - still early so not entirely prod-ready. Preview URLs are public so you must set up authorization or disable them (self-hosting URL service is an option, but complex).","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Zellij","Tool/Product/Project":"Zellij","Reviewed":"2021-06-14","Scheduled for":"2021-07-08","URL":"https://zellij.dev/","Category":"Misc - Terminal emulators","Type":"Open Source","What is it?":"Terminal workspace manager (tabs + multiplexing).","Len":"244","What we like":"Built-in tabs, panes, sessions, resizing, scrollback. Shows (customizable) keybindings to help discovery. “New pane” algorithmically placed in the most optimized position (or use manual splits). Can configure layouts in yaml then auto start them. Single compiled binary. Has a built-in file manager (a clone of ranger). WASM-based plugin system.","What we dislike":"Colors not inherited from existing shell config. Docs are still very limited. Some core shortcuts used by other tools e.g. Ctrl + r in bash (use Zellij lock mode to pass these through). Slightly laggy over remote connections (compared to tmux).","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Prestige","Tool/Product/Project":"Prestige","Reviewed":"2021-06-17","Scheduled for":"2021-07-01","URL":"https://prestigemad.com/","Category":"Developer Tools - API Client","Type":"Open Source","What is it?":"Browser- and text-based HTTP client.","Len":"135","What we like":"Really simple way to execute HTTP commands but can also send more complex requests e.g. headers, file uploads, cookies, JSON. Can write commands in plain text, JS, or define variables in templates. Prettified and syntax-highlighted response parsing. Can save to local browser storage (GitHub and others on roadmap). Open source codebase.","What we dislike":"Requests run through a proxy rather than your browser (due to CORS), but localhost URLs are routed directly. No support for OAuth APIs.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"chezmoi","Tool/Product/Project":"chezmoi","Reviewed":"2021-06-17","Scheduled for":"2021-07-01","URL":"https://www.chezmoi.io/","Category":"Misc - Terminal utilities","Type":"Open Source","What is it?":"dotfile manager.","Len":"266","What we like":"Single compiled binary. No bootstrap requirements - supports many platforms. Can query password manager for secrets and supports encrypted files. Configs can be templated for differences across environments. Can run scripts, including run-once (ideal for cloud IDEs or ephemeral environments). File edit flow similar to git (which is used for versioning).","What we dislike":"You can edit files directly but using the edit flow ensures changes/conflicts are handled properly, which may require retraining muscle memory. Doesn’t handle git subdirectories e.g. Oh My Zsh particularly well (better to use a script to install outside of chezmoi).","Interview":"","Sponsored":"FALSE"},{"Company/Org":"IPInfo","Tool/Product/Project":"IPInfo","Reviewed":"2021-06-07","Scheduled for":"2021-06-24","URL":"https://ipinfo.io","Category":"API - API","Type":"SaaS","What is it?":"CLI for IP address metadata lookup.","Len":"108","What we like":"Lookup IP details such as ASN, location, hostname, abuse contact, tor/VPN/hosting IP categorization. Cross-platform binaries. Colored output. Bulk summarize IPs from a file (or piped in). Bash, zsh, fish auto-completion. SDKs available for major languages.","What we dislike":"Responses not cached. Available via Homebrew on Mac but not Linux or Windows package managers. No man pages.","Interview":"","Sponsored":"TRUE"},{"Company/Org":"gitui","Tool/Product/Project":"gitui","Reviewed":"2021-06-02","Scheduled for":"2021-06-24","URL":"https://github.com/extrawurst/gitui","Category":"Developer Tools - Git tools","Type":"Open Source","What is it?":"Fast git TUI.","Len":"91","What we like":"Focus on high-performance repo parsing using async means the UI is responsive, low memory and low CPU even for the largest of repos. Keyboard control of common tasks e.g. stash, stage, diff review and commit with keybindings highlighted for newer users (or when you forget). Adopts terminal color scheme. Cross-platform packages (Arch, Fedora, Homebrew, Chocolatey, Nix).","What we dislike":"No log search or file history log and does not yet support bare repos (all on the roadmap).","Interview":"","Sponsored":"FALSE"},{"Company/Org":"GitLive","Tool/Product/Project":"GitLive","Reviewed":"2021-06-02","Scheduled for":"2021-06-17","URL":"https://git.live","Category":"Developer Tools - Code collaboration","Type":"Desktop","What is it?":"Live Git diffs for uncommitted changes.","Len":"178","What we like":"Real-time change indicators show where others have made changes to files but not yet committed. Preview live diffs and get warnings about conflicts from other collaborators. Privacy option to stop sharing when required. Built-in video calls and codesharing which works across IDEs - VS Code, JetBrains, Android Studio.","What we dislike":"Requires everyone to use GitLive and one of the supported editors. Uploads code diffs (not the full source) to GitLive servers while changes are uncommitted, deleted once pushed.","Interview":"/interviews/gitlive-nick-bransby-williams/","Sponsored":"FALSE"},{"Company/Org":"Runops","Tool/Product/Project":"Runops","Reviewed":"2021-06-14","Scheduled for":"2021-06-17","URL":"https://runops.io/","Category":"DevOps - Infrastructure automation","Type":"SaaS","What is it?":"Control access to run commands in production.","Len":"219","What we like":"Terminal-based signup/demo. Template / version control production commands - scripts, databases, containers, cloud consoles. CLI or Slack Bot to trigger them without direct prod access. Auth/approval flows before commands execute. Optional self-hosted runner with secrets stored in your own secrets storage. Auto-redaction of sensitive logs. Bastion SSH support.","What we dislike":"Cloud version requires public access to resources e.g. database connection URL, and doesn’t support IP allowlists - self-hosted runner allows private network access. Reliant on Slack for approvals, team management, etc.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Filippo Valsorda","Tool/Product/Project":"mkcert","Reviewed":"2021-06-04","Scheduled for":"2021-06-10","URL":"https://github.com/FiloSottile/mkcert","Category":"Developer Tools - Local development","Type":"Open Source","What is it?":"CLI for managing local dev certificates.","Len":"217","What we like":"Solves the hassle of configuring SSL for local dev endpoints by configuring and managing a root CA. Means you don’t need to leave testing SSL to staging (or prod!) or store real certs locally. Allows you to generate certs for localhost. Cross platform + support for browser specific root stores.","What we dislike":"You still need to configure your server to use the certs. GitHub binaries built with a slightly older version of Go (1.13) so no Apple Silicon support - use the homebrew version which does have Apple Silicon binaries.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Openbase","Tool/Product/Project":"Openbase","Reviewed":"2021-06-03","Scheduled for":"2021-06-10","URL":"https://openbase.com","Category":"Developer Tools - Dependency management","Type":"SaaS","What is it?":"Database of open source packages.","Len":"193","What we like":"Packages ranked based on various criteria such as documentation, performance, popularity. Categories for common use cases to help find most used packages. Analyze dependencies and project activity e.g. release cadence, commit frequency.","What we dislike":"Only supports searching JS packages - leaderboards available for Python, Rust, Go, Swift and Java libraries. Some criteria are more subjective than others e.g. are frequent commits good or bad?","Interview":"","Sponsored":"FALSE"},{"Company/Org":"gitmoji-cli","Tool/Product/Project":"gitmoji-cli","Reviewed":"2021-05-20","Scheduled for":"2021-06-03","URL":"https://github.com/carloscuesta/gitmoji-cli","Category":"Developer Tools - Git tools","Type":"Open Source","What is it?":"CLI to add Gitmoji to commits.","Len":"227","What we like":"gitmoji helps identify commits at a glance. CLI sets up a Git commit hook to trigger the interactive CLI to pick a gitmoji for the commit. Text search to find right emoji based on commit purpose. Can be configured to use Conventional Commits scopes.","What we dislike":"By default only renders on GitHub, but you can configure it to use actual emoji characters. Some may consider this polluting the git log, especially if you write your commits properly and use git shortlog in your release notes.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Xonsh","Tool/Product/Project":"Xonsh","Reviewed":"2021-03-26","Scheduled for":"2021-06-03","URL":"https://xon.sh/","Category":"Developer Tools - Shells","Type":"Open Source","What is it?":"Python-powered shell.","Len":"171","What we like":"Can do arithmetic, import modules, use data types, loops, etc, because everything it receives is interpreted with Python. Tab completion based on man-pages. Community extensions e.g. Powerline, written in Python. Cross-platform.","What we dislike":"Small community of extensions. Not bash compatible, so you have to relearn some syntax. Incompatible with Python virtual environments (has its own replacement called vox).","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Big Sky Software","Tool/Product/Project":"htmx","Reviewed":"2021-04-27","Scheduled for":"2021-05-27","URL":"https://htmx.org","Category":"Developer Tools - Frontend framework","Type":"Open Source","What is it?":"HTML attribute-based frontend framework.","Len":"258","What we like":"Access AJAX, CSS Transitions, WebSockets and SSEs directly in HTML. Any HTML element can issue AJAX requests. Implements the principle of  “locality of behavior” so it’s easier to understand what code is doing. Small (10k min gz), no dependencies.","What we dislike":"Injecting remote responses is a potential security issue: JS can still be executed even with a restrictive CSP, and user-generated content must be escaped. Execution must be denied within specific areas of the DOM. Violates separation of concerns principle.\n","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Semgrep","Tool/Product/Project":"Semgrep","Reviewed":"2021-05-24","Scheduled for":"2021-05-27","URL":"https://semgrep.dev","Category":"Developer Tools - Testing frameworks","Type":"Open Source","What is it?":"Static analysis tool.","Len":"75","What we like":"Open source, runs locally and/or in CI/CD. No DSL - write rules in the language you use and alongside the code they check. Plugins for as-you-code analysis in Vim, VS Code, IntelliJ. Lots of community rules for common languages and frameworks (Django, Flask, Java, Rails). Integrates with CI and can add comments to PRs. Cloud web UI is optional.","What we dislike":"Experimental support for C, Rust, PHP, Lua, C#, Kotlin. No Windows support.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"QuestDB","Tool/Product/Project":"QuestDB","Reviewed":"2021-05-13","Scheduled for":"2021-05-20","URL":"https://questdb.io","Category":"Database - Time series database","Type":"Open Source","What is it?":"Timeseries database with SQL.","Len":"252","What we like":"InfluxDB-compatible ingestion. Postgres-compatible wire API (allows querying with Grafana). Handles out of order inserts in a configurable way even though it uses an append column-based storage model. Official Docker image and Helm chart for dev/prod deploys. ANSI SQL with additional time functions. No GC.","What we dislike":"No built-in replication/clustering. Partitioning is only supported by timestamp (day, month, year) which means you tradeoff easier retention policies and faster calculations/seek times with the potential for hotspots if reads are mostly on recent data.","Interview":"/interviews/questdb-vlad-ilyushchenko/","Sponsored":"FALSE"},{"Company/Org":"atuin","Tool/Product/Project":"atuin","Reviewed":"2021-05-10","Scheduled for":"2021-05-20","URL":"https://github.com/ellie/atuin","Category":"Misc - Terminal utilities","Type":"Open Source","What is it?":"Shell history search/sync with SQLite.","Len":"140","What we like":"Search shell history with CLI or interactive TUI (ctrl+r). Query by date, current directory, string terms. Encrypted sync across machines with log of exit code, session, command. Fun stats e.g. “most used command”. Option to run your own sync server.","What we dislike":"Can’t delete entries from history. Default rebind on up-key takes some getting used to, or disable it in config. Only supports zsh and bash.","Interview":"/interviews/atuin-ellie-huxtable/","Sponsored":"FALSE"},{"Company/Org":"Deepnote","Tool/Product/Project":"Deepnote","Reviewed":"2021-05-08","Scheduled for":"2021-05-13","URL":"https://deepnote.com","Category":"Data Science - Collaboration","Type":"SaaS","What is it?":"Collaborative Jupyter notebooks.","Len":"149","What we like":"Google Docs-style real-time sharing / editing. Detects dependencies, prompts for pip install and updates requirements.txt. Running the Jupyter environment in the cloud saves hassle installing kernels locally. Integrates with git. Public links. Supports Python & R.","What we dislike":"Visualizations are custom HTML embeds when exported to Jupyter notebook format - better to embed something like Plotly in code to ensure portability.","Interview":"/interviews/deepnote-jan-matas/","Sponsored":"FALSE"},{"Company/Org":"Skruv","Tool/Product/Project":"Skruv","Reviewed":"2021-04-08","Scheduled for":"2021-05-13","URL":"https://skruv.io/","Category":"Developer Tools - Frontend framework","Type":"Open Source","What is it?":"No-build, small JS framework.","Len":"169","What we like":"No dependencies. No build step. Very small (~400 LoC vDOM, ~100 LoC state management, ~230 LoC HTML helpers). Works with async components. Web tutorial does a good job explaining how it works (built using itself).","What we dislike":"No router. Great for very simple SPAs, but something like Mithril.js (or Vue. Or Svelte) probably needed for anything of significance (if you don’t mind the build step).","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Hookdeck","Tool/Product/Project":"Hookdeck","Reviewed":"2021-04-30","Scheduled for":"2021-05-06","URL":"https://hookdeck.com","Category":"DevOps - API Management","Type":"SaaS","What is it?":"Inbound webhook store and forward proxy.","Len":"264","What we like":"Saves building your own queuing system - acts as a proxy to store and forward webhooks. Set up throttling and retry rules. Mirror inbound webhooks to multiple destinations, including a local CLI for testing. Alerts on failures - allows you to search & retry failures so you don’t lose any data.","What we dislike":"Assumes your webhook destinations are idempotent with “at least once” delivery. No support for signature verification - will forward all requests (you can configure schema filters), so you need to implement this yourself. No support for custom webhook URL domains.","Interview":"/interviews/hookdeck-alex-bouchard/","Sponsored":"FALSE"},{"Company/Org":"act","Tool/Product/Project":"act","Reviewed":"2021-03-24","Scheduled for":"2021-05-06","URL":"https://github.com/nektos/act","Category":"Developer Tools - Local development","Type":"Open Source","What is it?":"Run your GitHub Actions locally.","Len":"154","What we like":"Local simulation of the GitHub Actions environment using Docker. Much faster than commit/push for testing changes. Supports environment variables and secrets. Can trigger specific events e.g. pull request, push, and jobs within workflows (including skipping steps).","What we dislike":"Only supports Linux runners (host is multi-platform). Full Docker images are quite large (>20GB), but you can try slimmer images with fewer bundled tools.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"fselect","Tool/Product/Project":"fselect","Reviewed":"2021-04-21","Scheduled for":"2021-04-29","URL":"https://github.com/jhspetersson/fselect","Category":"Misc - Terminal utilities","Type":"Open Source","What is it?":"Find files with SQL-like queries.","Len":"171","What we like":"Packages for all platforms (+ Nix, AUR, musl). Uses relaxed SQL to support fields e.g. size, path; operators e.g. AND, gte, like; date queries e.g. created, modified; filename glob and regex. Can use .gitignore and search MP3, MIME and other file attributes. Output in CSV, JSON, HTML.","What we dislike":"Requires the absolute path (~/path doesn’t work), or searches current working directory if no path provided. Be careful to use quotes if you use shell characters such as >","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Gruntwork","Tool/Product/Project":"git-xargs","Reviewed":"2021-04-27","Scheduled for":"2021-04-29","URL":"https://github.com/gruntwork-io/git-xargs","Category":"Developer Tools - Git tools","Type":"Open Source","What is it?":"Execute commands across multiple git repos.","Len":"205","What we like":"Write a script to make a change to a single Git repo, then apply that change across multiple (specified in a list, or entire GitHub Org). Executes in parallel. Can open GitHub PRs with changes. Lots of use cases for otherwise tedious work e.g. name changes, updating dependencies, mass config changes.","What we dislike":"Only supports GitHub PRs, but can push remote branches. Releases only available as binaries, no packages (you can use go get). Sometimes scripting these things actually takes longer than doing it manually.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"KeyDB","Tool/Product/Project":"KeyDB","Reviewed":"2021-03-08","Scheduled for":"2021-04-22","URL":"https://keydb.dev/","Category":"Database - KV store","Type":"Open Source","What is it?":"A multi-threaded high-performance fork of Redis.","Len":"167","What we like":"Drop-in replacement for Redis. Claims x5 speed boost from multi-threading. Adds some extra features like backup to S3 and active replication. Potentially reduces operational complexity by shifting scaling to CPU cores and network throughput rather than requiring clustering.","What we dislike":"Runs the normal Redis event loop on multiple threads which requires locking (low contention, but work ongoing to improve). Expects exclusive use of assigned CPU cores.","Interview":"/interviews/keydb-john-sully/","Sponsored":"FALSE"},{"Company/Org":"Ranga Vadhineni","Tool/Product/Project":"Thunder Client","Reviewed":"2021-04-06","Scheduled for":"2021-04-22","URL":"https://www.thunderclient.io/","Category":"Developer Tools - Local development","Type":"Desktop","What is it?":"An HTTP client for VS Code.","Len":"106","What we like":"Easily build HTTP requests with custom params, auth (basic, bearer, OAuth), headers and body (text, JSON, XML, form, GraphQL). Parses and syntax highlights response, headers and cookies. Can create automated tests with conditions such as response time, status codes, headers, etc.","What we dislike":"All local - no config sync or dynamic loading from config files, but configs can be exported and imported.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Retool","Tool/Product/Project":"REST API Generator","Reviewed":"2021-04-09","Scheduled for":"2021-04-15","URL":"https://retool.com/api-generator/","Category":"DevOps - API Management","Type":"SaaS","What is it?":"Build an API to develop against.","Len":"116","What we like":"Create a read/write REST API to start building against before your backend is ready. Supports all HTTP verbs. Lots of default field types with sample data e.g. location, emails, avatars, credit cards.","What we dislike":"Limited to 150 rows. Hosted by a third party, so don’t send anything sensitive. Deleted after 30 days of inactivity.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Nelson Elhage","Tool/Product/Project":"llama","Reviewed":"2021-04-13","Scheduled for":"2021-04-15","URL":"https://github.com/nelhage/llama","Category":"Cloud - Serverless","Type":"Open Source","What is it?":"CLI for parallelizing commands inside AWS Lambda.","Len":"199","What we like":"Makes it easy to burst parallelizable commands into Lambda. Uses Go template language for managing input and output. Supports Docker wrappers to bootstrap environments. Includes a drop-in GCC/clang replacement for outsourcing compilation.","What we dislike":"Lambda is CPU and memory constrained, and the network is a bottleneck, so use cases are constrained to where parallelization makes a big difference (or there is a benefit to freeing local resources).","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Typesense","Tool/Product/Project":"Typesense","Reviewed":"2021-03-24","Scheduled for":"2021-04-08","URL":"https://typesense.org","Category":"Developer Tools - Site Search","Type":"Open Source","What is it?":"Fast, typo-tolerant search engine.","Len":"156","What we like":"Single binary (C++) runs natively on Linux and macOS. Tunable ranking for relevancy score tie-breaks. Sort at query-time without additional indexes. Scoped API keys. InstantSearch.js adapter. REST API with clients for JS, PHP, Python, Ruby. Open source + cloud option.","What we dislike":"Need to build your own index updater mechanism to process new data. API-only means you need to build your own UI/admin. Only supports Latin-based languages.","Interview":"/interviews/typesense-jason-bosco/","Sponsored":"FALSE"},{"Company/Org":"Svix","Tool/Product/Project":"Svix","Reviewed":"2021-04-05","Scheduled for":"2021-04-08","URL":"https://www.svix.com/","Category":"DevOps - API Management","Type":"SaaS","What is it?":"Webhook infrastructure as a service.","Len":"119","What we like":"Offering webhooks is actually more complex than you'd expect. Diahook deals with signing requests, queueing, retries, reliability, auth, E2E encryption, rate limiting, logs and debugging.","What we dislike":"You need to send your events to Diahook, which means you still need to ensure they get there (retries, debugging, etc).","Interview":"/interviews/svix-tom-hacohen/","Sponsored":"FALSE"},{"Company/Org":"Temporal","Tool/Product/Project":"Temporal","Reviewed":"2021-03-16","Scheduled for":"2021-04-01","URL":"https://temporal.io/","Category":"Developer Tools - Workflow management","Type":"Open Source","What is it?":"Framework for workflow orchestration.","Len":"161","What we like":"Deals with the underlying infrastructure for reliable task execution: state management, retries, scaling, fault tolerance. Avoid building and running your own timers / queues - just write the function business logic. Open source server you can run yourself, or use their cloud option (in private beta).","What we dislike":"SDKs are still being built out (currently available for Go, Java, PHP, Ruby). You still need to run / scale your own database (Cassandra, MySQL, or PostgreSQL). ","Interview":"/interviews/temporal-manu-srivastava/","Sponsored":"FALSE"},{"Company/Org":"Mirage JS","Tool/Product/Project":"Mirage JS","Reviewed":"2021-03-29","Scheduled for":"2021-04-01","URL":"https://miragejs.com","Category":"Developer Tools - Testing frameworks","Type":"Open Source","What is it?":"API mocking library for frontend developers.","Len":"189","What we like":"Intercepts all XMLHttpRequest and fetch requests so no code changes required (one additional import). Includes in-memory database for persistence tests. Can simulate slow responses or errors. Built-in ORM handles data relationships, output formatting, serialization.","What we dislike":"Only supports REST APIs out of the box - GraphQL available as an optional plugin (still in development). Runs in the browser, not as a server, so it cannot be used to mock server-side APIs.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"git-plan","Tool/Product/Project":"git-plan","Reviewed":"2021-03-30","Scheduled for":"2021-04-01","URL":"https://github.com/synek/git-plan","Category":"Developer Tools - Git tools","Type":"Open Source","What is it?":"Git workflow for planning / writing commits in advance.","Len":"206","What we like":"Forces you to think about what you are going to work on in advance - writing out a plan probably helps improve your thinking, and also creates better commit messages. If you think of something you need to switch to, you can create a plan whilst it’s still top-of-mind, then come back to it later.","What we dislike":"Unintuitive to begin with, but makes sense once you try it (see blog posts linked in the project readme for guidance). Interactive rebasing is an alternative that doesn’t force you to reverse your workflow.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"WayScript","Tool/Product/Project":"WayScript","Reviewed":"2021-03-05","Scheduled for":"2021-03-25","URL":"https://wayscript.com","Category":"Cloud - PaaS","Type":"SaaS","What is it?":"Rapid API scripting platform.","Len":"164","What we like":"Quickly create step function APIs from lots of pre-built integrations. Cron support. Connect to external data sources and manipulate data. Write real Python, JS, Java, shell script, GraphQL, HTML, and SQL (including using packaged dependencies) as separate steps. Configurable editor e.g. use vim keybindings, tabs vs spaces, etc.","What we dislike":"Can be slow to execute (many seconds) especially with lots of steps. Have to use their browser editor - can’t develop and run code locally (this is on the roadmap).","Interview":"/interviews/wayscript-jesse-orshan/","Sponsored":"FALSE"},{"Company/Org":"Buddy","Tool/Product/Project":"Buddy","Reviewed":"2021-03-01","Scheduled for":"2021-03-25","URL":"https://buddy.works/","Category":"DevOps - CI/CD","Type":"SaaS","What is it?":"CI/CD.","Len":"135","What we like":"Fast execution of steps due to caching. Can retry builds from specific steps and live-debug in a terminal which makes setting up pipelines easier. Can switch between UI or YAML config. Commenting/sharing helps team collaboration. UI has useful features, such as env var autocompletion.","What we dislike":"Ecosystem of official build actions is small relative to GitHub Actions. UI is sometimes confusing due to the number of config options.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"ORY","Tool/Product/Project":"Kratos","Reviewed":"2021-03-11","Scheduled for":"2021-03-18","URL":"https://www.ory.sh/kratos","Category":"Security - Authentication","Type":"Open Source","What is it?":"Cloud native user management.","Len":"214","What we like":"Open source & self hosted: you probably don't want to build all your own user management (signup, login, MFA, FIDO2, etc) but do care about control and ownership. Runs as a compact, single Go binary. JSON Schema data model. Headless; example UI and API SDKs for Python, PHP, Node, Go, Java, Ruby. Scale horizontally.","What we dislike":"Focus on APIs means there is no admin UI. Federation (OAuth2, OpenID) requires a separate project (ORY Hydra). \"Scale horizontally\" still means you need to scale your own RDBMS. Pre-1.0, targeting \"stable\" in 2022.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Chris Walz","Tool/Product/Project":"bit","Reviewed":"2021-03-01","Scheduled for":"2021-03-18","URL":"https://github.com/chriswalz/bit","Category":"Developer Tools - Git tools","Type":"Open Source","What is it?":"git CLI.","Len":"169","What we like":"Autocomplete and flag suggestions. Commands such as release or sync combine several commands in one to speed up common tasks. Branch autocomplete for checkout. GitHub PR integration. Support for themes. Open source & cross platform.","What we dislike":"Not what you might expect from a cli: you run the bit command, then it suggests subcommands and flags, rather than tab completion. Official OS packages missing on Linux.","Interview":"/interviews/bit-chris-walz/","Sponsored":"FALSE"},{"Company/Org":"Bird Eats Bug","Tool/Product/Project":"Bird Eats Bug","Reviewed":"2021-03-01","Scheduled for":"2021-03-11","URL":"https://birdeatsbug.com","Category":"Developer Tools - Testing frameworks","Type":"Desktop","What is it?":"Screensharing with technical metadata.","Len":"64","What we like":"Captures screenshare and click journey with associated metadata like console and network logs. Local-first; uploadable for sharing (private or public). Quick submit to JIRA, Linear, Trello, GitHub","What we dislike":"Chrome only (works on Microsoft Edge). More integrations needed.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Earthly","Tool/Product/Project":"Earthly","Reviewed":"2021-03-04","Scheduled for":"2021-03-11","URL":"https://earthly.dev","Category":"DevOps - Containers","Type":"Open Source","What is it?":"Containerized reproducible builds.","Len":"102","What we like":"Runs existing build steps inside a container using your existing CI system (Jenkins, CircleCI, GitHub Actions, etc). This makes builds reproducible locally so they run the same on your laptop as in remote CI. Steps can be parallelized. Dependency caching locally and across repos.","What we dislike":"Assumes you are building an already containerized application. Multi-platform builds are experimental.","Interview":"/interviews/earthly-adam-gordon-bell/","Sponsored":"FALSE"},{"Company/Org":"Microsoft","Tool/Product/Project":"Playwright","Reviewed":"2021-03-03","Scheduled for":"2021-03-04","URL":"https://playwright.dev","Category":"Developer Tools - Testing frameworks","Type":"Open Source","What is it?":"Automate Chromium, Firefox & Webkit with a single API.","Len":"163","What we like":"Single API to launch and script Chromium, Firefox and WebKit. Emulate devices for testing responsiveness. Auto-wait API avoids hard coding timeouts. Extract screenshots, video and debug info. Library for JS, TypeScript, Python, C#, Java. Works on Windows, macOS, Linux.","What we dislike":"Only supports latest browser versions - can’t pick older versions to test against. Browser binaries are quite large so may slow down CI/CD (cache is configurable).","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Stoplight","Tool/Product/Project":"Stoplight","Reviewed":"2021-03-02","Scheduled for":"2021-03-04","URL":"https://stoplight.io","Category":"DevOps - API Management","Type":"SaaS","What is it?":"API design and development platform.","Len":"186","What we like":"Build OpenAPI (v2 Swagger or v3) compliant APIs with auto-generated docs, example code, and mocking. Write docs in Markdown. Save everything (and load existing APIs) from Git. Offline/local dev support with desktop API studio app.","What we dislike":"Limited ability to customize doc output to fit into your own design/brand. Some editor/docs UI bugs in Firefox. It does work without using OpenAPI specs, but most features assume you do.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Raycast","Tool/Product/Project":"Raycast","Reviewed":"2021-02-22","Scheduled for":"2021-02-25","URL":"https://raycast.com","Category":"Misc - OS","Type":"Desktop","What is it?":"Quick-launcher for developers.","Len":"124","What we like":"Search cloud and local documents. Clipboard history. Manage GitHub PRs, JIRA issues, join Zoom calls, schedule calendar blocks. API and scripting to create your own commands. Tiling window management. Connects directly to remote services to avoid privacy issues.","What we dislike":"macOS only. Shortcuts for sub-commands are difficult to find. File search requires scoping rather than searching everywhere.","Interview":"/interviews/raycast-petr-nikolaev/","Sponsored":"FALSE"},{"Company/Org":"DBCLI","Tool/Product/Project":"DBCLI","Reviewed":"2021-02-22","Scheduled for":"2021-02-25","URL":"https://www.dbcli.com","Category":"Database - Management","Type":"Desktop","What is it?":"CLIs for databases.","Len":"224","What we like":"Autocomplete and syntax highlighted output. Support for Postgres, MySQL, SQLite, MSSQL, Redis, AWS Athena. History, search, vi/Emacs keybindings, saved queries. Open source & cross-platform.","What we dislike":"Only available via pip or brew - official OS packages would make installation easier to integrate with native package management. Installation on Windows is a hassle due to needing Python. Large results don't line-wrap well.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Accurics","Tool/Product/Project":"Terrascan","Reviewed":"2021-02-16","Scheduled for":"2021-02-18","URL":"https://github.com/accurics/terrascan","Category":"Developer Tools - Testing frameworks","Type":"Open Source","What is it?":"Static code analyzer for Infrastructure as Code.","Len":"153","What we like":"Scans Terraform, k8s, and Helm configs for security and compliance. Supports AWS, Azure, GCP, Kubernetes, GitHub and has lots of sensible policy defaults which can be extended using the Open Policy Agent Rego language. Can be run in CI/CD.","What we dislike":"Docs need work: quickstart didn't work smoothly and default policies are not well explained. Explanations of how to rectify policy violations would help.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"GitPod","Tool/Product/Project":"GitPod","Reviewed":"2021-02-09","Scheduled for":"2021-02-11","URL":"https://www.gitpod.io","Category":"Developer Tools - IDE","Type":"SaaS","What is it?":"Dev environments as code and hosted in the cloud.","Len":"252","What we like":".gitpod.yml file in the repo describes the full dev environment so it's version controlled and always up to date. GitPod pre-builds after every commit so the environment is ready when you activate it. VS Code in the browser means you can develop anywhere on any machine. Easily switch workspaces e.g. to review a pull request without disrupting your current environment. Self-hosted version so you can run it all yourself (some features limited to paid license).","What we dislike":"Limited IDE support - VS Code or Theia (based on VS Code) means you have to code in the browser so you can't use your own IDE/editor (support for other IDEs in development). Requires you to be online with good connectivity because everything is remote.","Interview":"/interviews/gitpod-christian-weichel/","Sponsored":"FALSE"},{"Company/Org":"asdf","Tool/Product/Project":"asdf","Reviewed":"2021-02-04","Scheduled for":"2021-02-11","URL":"https://asdf-vm.com/","Category":"Developer Tools - Dependency management","Type":"Open Source","What is it?":"A CLI to manage language runtimes.","Len":"103","What we like":"Makes it easy to switch language runtime versions without messing up the system install (if any). Lots of plugins so it supports pretty much every language. Configs can be defined in a per-project file so it can auto switch based on current working directory. Means you can forget about language specific virtual environments because asdf manages them for you. Has an official GitHub Action.","What we dislike":"Language support is via community plugins so quality is variable. Windows support still in development.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"StackHawk","Tool/Product/Project":"StackHawk","Reviewed":"2021-02-05","Scheduled for":"2021-02-11","URL":"https://www.stackhawk.com/","Category":"Security - Vulnerability management","Type":"SaaS","What is it?":"Black box security scanning for developers.","Len":"300","What we like":"An easy way for developers to run a standardized suite of black box tests. Spiders and auto-discovers endpoints so there is almost zero config. Runs inside a container so it can be run anywhere. Web UI highlights and prioritizes all detected vulnerabilities. Can easily be run locally against any local or remote endpoint. Built on top of open source OWASP ZAP. Good quality documentation. Integrations into CI/CD e.g. GitHub Actions, GitLab, CircleCI.","What we dislike":"Assumes you know about OWASP and how to resolve highlighted issues. The nature of black box testing means some OWASP issues are false positives and are not comprehensive e.g. no detection of dependency vulnerabilities. Large example app takes >25min to scan (although our own simple app took <1 min).","Interview":"/interviews/stackhawk-scott-gerlach/","Sponsored":"FALSE"},{"Company/Org":"Opstrace","Tool/Product/Project":"Opstrace","Reviewed":"2021-02-02","Scheduled for":"2021-02-04","URL":"https://opstrace.com","Category":"DevOps - Observability","Type":"Open Source","What is it?":"A management layer on top of independent open source observability tools.","Len":"368","What we like":"Automates deployment of Prometheus, Cortex, and Loki and configures them to store data in your own S3 or GCS buckets. This means you keep control of the data and the price of storage from your existing cloud provider.  Supports multiple tenants e.g. prod vs dev, and deals with scaling them. Existing Prometheus instances can be configured to send data to Opstrace.","What we dislike":"Installation and cluster management are the main differentiator - otherwise it's just packaging open source projects. API uses an Opstrace managed endpoint - custom domains supported only in the commercial version which is hidden behind \"contact us\". If you already have Prometheus, you could just set up Cortex yourself. Only supports AWS and GCP. No Windows support.","Interview":"","Sponsored":"FALSE"},{"Company/Org":"Nushell","Tool/Product/Project":"Nushell","Reviewed":"2021-02-02","Scheduled for":"2021-02-04","URL":"https://www.nushell.sh","Category":"Developer Tools - Shells","Type":"Open Source","What is it?":"A shell where everything is data.","Len":"215","What we like":"The first thing you notice is running `ls` outputs a structured table. All output is actually data, so it is like interacting with a spreadsheet. Nushell applies the Unix philosophy of piping commands but allows for commands like `ls | where size > 1kb`. Supports parsing data like CSV and JSON. You can script your own commands. Cross platform.","What we dislike":"Although it can be run as a command, it is designed to replace your existing shell. It is still in development so may not be stable. You will have to reconfigure everything if you have heavily customized your shell.","Interview":"","Sponsored":"FALSE"}],"header":["Company/Org","Tool/Product/Project","Reviewed","Scheduled for","URL","Category","Type","What is it?","Len","What we like","Len","What we dislike","Len","Interview","Sponsored"],"range":"'All Tools'!A1:O88"}}]}
