{
    "@context": "https://schema.org",
    "@type": "FAQPage",
    "mainEntity": [
        {
            "@type": "Question",
            "name": "What is a Docker container?",
            "acceptedAnswer": {
                "@type": "Answer",
                "text": "<p>A Docker container is a small virtual machine designed to provide a consistent running environment to applications. They can startup/shutdown quickly and are stateless.</p>"
            }
        },
        {
            "@type": "Question",
            "name": "What is container monitoring?",
            "acceptedAnswer": {
                "@type": "Answer",
                "text": "<p>Container monitoring is the process of monitoring containerized applications by collecting metrics to track health and resource usage.</p>"
            }
        },
        {
            "@type": "Question",
            "name": "What Are Docker container logs?",
            "acceptedAnswer": {
                "@type": "Answer",
                "text": "<p>The logs generated by containers running on Docker host are Docker container logs. These logs generally consist of information like when the container was started and if it encountered any errors during initialization.</p>"
            }
        },
        {
            "@type": "Question",
            "name": "What are container & host metrics?",
            "acceptedAnswer": {
                "@type": "Answer",
                "text": "<p>A single virtual environment could have hundreds of containers running, these containers could use vast amounts of resources and might throttle. The resource usage of individual containers running inside a virtual environment must be tracked and this tracked data is the container's metrics.</p><p>Host metrics are the data points collected on the host machine (can be a virtual machine as well) running a containerized workload.</p>"
            }
        },
        {
            "@type": "Question",
            "name": "Why use a specialized container monitoring tool over in-built docker stats?",
            "acceptedAnswer": {
                "@type": "Answer",
                "text": "<p>Docker stats command is a great way to get a quick overview of running containers and resource usage on the Docker host. It does not store historical data. When running a service on Docker swarm that spans across multiple containers, the user has to individually log into each machine and run the commands. Using a specialized tool allays these concerns.</p>"
            }
        }
    ]
}